{"index": {"_index": "imdb", "_type": "film", "_id": 0}}
{"title": "Papá piernas largas", "year": "1919", "director": ["Marshall Neilan"], "writers": ["Jean Webster", "Agnes Christine Johnston", "Jean Webster"], "actors": ["Mary Pickford", "Milla Davenport", "Percy Haswell", "Fay Lemport", "Mahlon Hamilton", "Lillian Langdon", "Betty Bouton", "Audrey Chapman", "Marshall Neilan", "Carrie Clark Ward", "Wesley Barry", "True Boardman", "Jeanne Carpenter", "Estelle Evans", "Fred Huntley", "Frankie Lee", "Joan Marsh"], "genres": ["Comedy", "Drama"], "country": "United States", "lenguages": ["English"], "runtime": "85 min", "summary": ["An orphan discovers that she has an anonymous benefactor who is willing to pay her college tuition, unaware he's the same man who has been romantically pursuing her.", "Wealthy Jervis Pendleton acts as benefactor for orphan Judy Abbott, anonymously sponsoring her in her boarding school. But as she grows up, he finds himself falling in love with her, and she with him, though she does not know that the man she has fallen for is her benefactor.\n\n—Jim Beaver <jumblejim@prodigy.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 1}}
{"title": "Un día de juerga", "year": "1919", "director": ["Charles Chaplin"], "writers": ["Charles Chaplin"], "actors": ["Charles Chaplin", "Edna Purviance", "C. Allen", "Naomi Bailey", "Sallie Barr", "Henry Bergman", "True Boardman", "James Bryson", "Jackie Coogan", "Dixie Doll", "Charles S. Drew", "Elmer Ellsworth", "Marion Feducha", "Leroy Finnegan", "Mrs. Fowler", "Warren Gilbert", "J.A. Irvin", "Bob Kelly", "Toraichi Kono", "Raymond Lee", "Babe London", "Nancy Mix", "Louise Muma", "Dorothy Oliver", "Granville Redmond", "Alfred Reeves", "Charles Reisner", "Jean Riley", "Mrs. Roos", "Sylvia Sarto", "Elsie Sindora", "E. Sorral", "Arthur Thalasso", "Loyal Underwood", "Jessalyn Van Trump", "John Williams", "Tom Wilson", "Tom Wood", "Elsie Young", "K. Zimmerman"], "genres": ["Short", "Comedy"], "country": "United States", "lenguages": ["English"], "runtime": "18 min", "sinopsis": "\nCharlie, the father (Charles Chaplin) and his family are off for a rattling good time. Two children, a beautiful mother (Edna Purviance) and Charlie leave the house and enter their Model T Ford. Charlie attempts to start the car. It shimmers and shakes but the engine dies, every time Charlies tries to enter the driver seat. Turning the starting crank handle the opposite way causes smoke shoots out. Finally, a minor adjustment to the engine and they are on their way.The family enters the ferry boat. Charlie carries one child under each arm because children in arms are free. They find their seats. Charlie leaves momentarily. In his absence, his seat is occupied by a large man (Tom Wilson) and his wife (Babe London). Charlie wedges his way in when he returns. He sticks the man with a pin to make room. Then Charlie leaves the boat again to buy cigarettes.The captain calls all aboard and the boat starts to pull away from the pier. A heavy woman (Tom Wood) arrives just as the boat is depart and fires her baby carriage across the bow. She trips as she tries to board and stretches herself between the boat and the landing. When Charlie returns, he is able to walk across the woman's back to board the boat. The heavy set woman falls into the water. Charlie thinks it may be helpful to use a gaff pole to help her climb onto the boat. Finally, she is helped on board and the trip is underway.A black band of ragtime musicians provides music. Several couples begin dancing. Charlie and his wife are among them. Dancing is a challenge as the boat tosses in the waves. Charlie and many others do not look like they are feeling too well overcome with seasickness. With rougher waters, the dance floor clears and many people cling to the edge of the boat. Charlie tries to find his balance on the dance floor alone. Eventually, Charlie finds a seat near the trombone player and has to navigate the trombone's slide continually. Charles, the trombone player and the drummer all are consumed with the same thought of seasickness. The trombone player is so ill his face turns white. Charlies seeks another location.A vendor pressures Charlie to buy ham sandwiches, buttered popcorn, cigars or cigarettes. Charlie returns to his snoozing family and struggles to set up a deck chair. The fat couple who occupied the seat earlier are near. The fat man eats popcorn, feels ill and leaves. Frustrated, Charlie throws the deck chair overboard and seats himself next to the fat woman. She is also not feeling well and faints into Charlie's lap. Charlie props her up but succumbs to the seasickness can keels over face first into the woman's lap. A steward comes along and puts a blanket over Charlie and the woman. The man returns, bringing a drink for his wife. Charlie extends his arm from under the blanket. The man thinks he is holding his wife's hand as Charlies wave his rejection of the drink. When Charlie is discovered under the blanket, the man flings Charlie across the deck and a fight ensues. Charlie is choked repeatedly but is saved when the man runs across the deck to lean over the edge with sea sickness. Charlie finds this the ideal opportunity to kick the man's posterior. Then Charlie pulls him away and dominates the fight with the much larger man. The captain finally intercedes in the fight between the two very tired and seasick men. At the end of the cruise, the day trippers disembark. The large man Charlie was fighting has a black eye.On the way home, the family encounters a hold up at the crossroads where a traffic officer directs traffic. When Charlie's Model T approaches the corner, Charlie fails to yield to the traffic cop's direction. The traffic officer politely asks Charlie to reverse back to the corner and wait. A woman pedestrian meets another lady and her husband crossing the street in front of Charlie's car. Charlie blows his horn repeatedly but they do not move. The short little man (Loyal Underwood) leans against Charlie's car tire. Charlie reverses the car and the man tumbles to the ground. Finally, the pedestrians retreat to the street corner. The man cusses out Charlie as a stupid ass. Charlie plugs his ears with his fingers.Charlie again tries to proceed with his left turn. The traffic cop stops him again. This time he issues Charlie a citation. When Charlie backs his car to the corner, he bumps into a truck carrying a large box which tips over onto another vehicle with a well-dressed man inside. The traffic offer intervenes. The well-dressed man's car is allowed to proceed. The truck forced to back up.As Charlie waits, men wheel a barrel of tar out in front of Charlie's car. When another car backs up, the barrel of hot tar in spilled in front of Charlie's car. Charlie pulls ahead and his car become stuck. Charlie cannot move ahead when the traffic officer signals him. A portly officer (Henry Bergman) approaches and clears the tar bucket and street workers from the scene. The officer is forced backward by another car reversing and gets his feet stuck in the tar. Now both Charlie's car and the officer are stuck in the tar. The traffic officer approaches to give Charlie yet another citation. The portly officer frees himself from the tar. In the process, he steps on a manhole cover behind the traffic officer and removes it. The traffic officer disappears down the manhole. The portly officer replaces the manhole cover and approaches Charlie. When Charlie notices him, he says \"how you have changed.\" This results in a confrontation where Charlie is pulled from his car by the portly officer and tossed back into the tar. Charlie's feet are so embedded in the tar that he can lean forward without falling over much to the delight of the growing crowd of pedestrians. The portly officer tells him \"you've been sticking around here long enough.\" As the altercation continues, the portly officer ends up with both feet and hands stuck in the tar. The traffic officer climbs out of the manhole and trips over the other officer. The traffic officer also ends up stuck in the tar. Charlie removes his shoes steps on the officer's hat and climbs down the officers back to free himself from the sticky situation. Charlie climbs back into his car, puts it in reverse, and drives around *the officers who are still stuck, one on top of the other. It is the end of a perfect day. 7*\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 2}}
{"title": "No cambies de esposo", "year": "1919", "director": ["Cecil B. DeMille"], "writers": ["Jeanie Macpherson"], "actors": ["Elliott Dexter", "Gloria Swanson", "Lew Cody", "Sylvia Ashton", "Theodore Roberts", "Julia Faye", "James Neill", "Ted Shawn", "Irving Cummings", "Clarence Geldert", "Raymond Hatton", "Jack Mulhall", "Guy Oliver", "Sam Wood"], "genres": ["Comedy"], "country": "United States", "lenguages": [], "runtime": "71 min", "summary": ["Leila Porter comes to dislike her husband James, a glue king who is always eating onions and looking sloppy. But after she divorces him and marries two-timing playboy Schuyler Van Sutphen the now-reformed James looks pretty good."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 3}}
{"title": "Fatty en el garaje", "year": "1920", "director": ["Roscoe 'Fatty' Arbuckle"], "writers": ["Jean C. Havez"], "actors": ["Roscoe 'Fatty' Arbuckle", "Buster Keaton", "Molly Malone", "Harry McCoy", "Dan Crimmins", "Monty Banks", "Luke the Dog", "Charles Dorety", "Alice Lake", "Polly Moran"], "genres": ["Short", "Comedy"], "country": "United States", "lenguages": ["English"], "runtime": "25 min", "summary": ["Roscoe and Buster operate a combination garage and fire station. In the first half they destroy a car left for them to clean. In the second half they go off on a false alarm and return to find their own building on fire.", "In this Roscoe 'Fatty' Arbuckle and Buster Keaton's fourteenth and last film together, Fatty, and his willing assistant, Buster, work as automotive mechanics who double as fearless volunteer firemen. During one fateful day--as a neglectful customer discovers the virtue of tipping, and Buster gets to know better Luke the Dog's mighty mandible--an ambitious Casanova who dreams of dating the boss' daughter, Molly, finds himself in an awful predicament. All of a sudden, a frantic fire starts devouring the fire station. Who is behind the firehouse's inexplicable arson?\n\n—Nick Riganas"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 4}}
{"title": "The Grim Game", "year": "1919", "director": ["Irvin Willat"], "writers": ["Arthur B. Reeve", "John Grey", "Walter Woods", "Irvin Willat"], "actors": ["Harry Houdini", "Thomas Jefferson", "Ann Forrest", "Augustus Phillips", "Tully Marshall", "Arthur Hoyt", "Mae Busch", "Edward Martin", "Jane Wolfe", "George Cowl"], "genres": ["Adventure", "Drama"], "country": "United States", "lenguages": ["English"], "runtime": "71 min", "summary": ["Jailed unjustly for a murder he did not commit, a young man uses his amazing powers of escape to free himself and pursue the actual killers, who hold his fiancée captive."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 5}}
{"title": "Harakiri", "year": "1919", "director": ["Fritz Lang"], "writers": ["David Belasco", "Max Jungk", "John Luther Long"], "actors": ["Paul Biensfeldt", "Lil Dagover", "Georg John", "Meinhart Maur", "Rudolf Lettinger", "Erner Huebsch", "Käte Küster", "Niels Prien", "Herta Heden", "Loni Nest"], "genres": ["Drama"], "country": "Germany", "lenguages": ["Dutch"], "runtime": "80 min", "summary": ["The Buddhist priest wants the Daughter of the Daimyo to become a priestess at the Forbidden Garden. The Daimyo thinks if he were in Europe that his daughter should decide on her own, but he is denounced and has to commit harakiri. She meets Olaf, a European officer, falls in love and marries him, but after a few months he has to return to Europe. She gives birth to a child and is waiting for him, while he marries in Europe. When he comes back to Japan 4 years later, he is accompanied by his European wife...\n\n—Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 6}}
{"title": "El tesoro de Arne", "year": "1919", "director": ["Mauritz Stiller"], "writers": ["Selma Lagerlöf", "Gustaf Molander", "Mauritz Stiller"], "actors": ["Erik Stocklassa", "Bror Berger", "Richard Lund", "Axel Nilsson", "Hjalmar Selander", "Concordia Selander", "Gösta Gustafson", "Mary Johnson", "Wanda Rothgardt", "Stina Berg", "Gustav Aronson", "Jenny Öhrström Ebbesen", "Josua Bengtson", "Georg Blomstedt", "Albin Erlandzon", "Yngve Nyqvist", "Artur Rolén"], "genres": ["Drama", "History"], "country": "Sweden", "lenguages": ["Swedish"], "runtime": "122 min", "summary": ["In 16th century Sweden, the lives of three Scottish mercenaries and a vicar's family intersect after a crime forever alters a small coastal town. As the three try to escape, they find themselves trapped when all ships are frozen in ice.", "Three Scottish officers, including Sir Archi, murder Sir Arne and his household for a coffin filled with silver coins. The only survivor is Elsalill, who moves to relatives in Marstrand. There she meets a charming young officer - Sir Archi, and she soon understands that he was one of the murderers. She is in a classic dilemma between her love for Sir Archi and justice.\n\n—Mattias Thuresson", "In 16th-century Sweden, the lives of three Scottish mercenaries and an aging Swedish vicar and his family intersect, and in the unspeakable crime that results, a small coastal community is forever altered. As the three mercenaries struggle to escape from the town, they find that nature has conspired against them - all outbound ships are frozen in the ice - forcing them to remain until the tragic tale reaches its catastrophic conclusion.\n\n—Chase Holden"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 7}}
{"title": "The Hoodlum", "year": "1919", "director": ["Sidney Franklin"], "writers": ["Julie Mathilde Lippmann", "Bernard McConville"], "actors": ["Mary Pickford", "Ralph Lewis", "Kenneth Harlan", "T.D. Crittenden", "Aggie Herring", "Andrew Arbuckle", "Max Davidson", "Paul Mullen", "Buddy Messinger", "Nellie Anderson", "Ernest Butterworth Jr.", "B.A. Lewis", "Lafe McKee"], "genres": ["Comedy"], "country": "United States", "lenguages": ["English"], "runtime": "78 min", "summary": ["A spoiled young rich girl is forced by misfortune to fight for survival in the slums and alleys, where she becomes involved with all manner of unpleasantness."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 8}}
{"title": "No quiero ser un hombre", "year": "1918", "director": ["Ernst Lubitsch"], "writers": ["Hanns Kräly", "Ernst Lubitsch"], "actors": ["Ossi Oswalda", "Curt Goetz", "Ferry Sikla", "Margarete Kupfer", "Victor Janson"], "genres": ["Comedy", "Romance"], "country": "Germany", "lenguages": ["German"], "runtime": "45 min", "summary": ["A teenaged tomboy, tired of being bossed around by her strict guardian, impersonates a man so she can have more fun, but discovers that being the opposite sex isn't as easy as she had hoped.", "High-spirited young Ossi Oswalda is the bane of her uncle and governess' existence. She insists on playing poker and smoking and talks with strange men on the street. When her uncle leaves to take up a new job, she looks forward to enjoying new freedom. Her hopes are dashed when her new guardian Dr. Kersten proves to be strict and unyielding. Frustrated with her cloistered life, Ossi sneaks out on the town dressed as a young man. She finds that being a man has its own disadvantages when she discovers she is not given the same gentle treatment when she is masquerading as a male."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 9}}
{"title": "Yo acuso", "year": "1919", "director": ["Abel Gance"], "writers": ["Abel Gance"], "actors": ["Romuald Joubé", "Maxime Desjardins", "Séverin-Mars", "Angèle Guys", "Maryse Dauvray", "Mancini", "Elizabeth Nizan", "Pierre Danis", "Blaise Cendrars", "Paul Duc"], "genres": ["Drama", "Horror", "War"], "country": "France", "lenguages": [], "runtime": "166 min", "summary": ["The story of two men, one married, the other the lover of the other's wife, who meet in the trenches of the First World War, and how their tale becomes a microcosm for the horrors of war."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 10}}
{"title": "El gabinete del Dr. Caligari", "year": "1920", "director": ["Robert Wiene"], "writers": ["Carl Mayer", "Hans Janowitz"], "actors": ["Werner Krauss", "Conrad Veidt", "Friedrich Feher", "Lil Dagover", "Hans Heinrich von Twardowski", "Rudolf Lettinger", "Rudolf Klein-Rogge", "Hans Lanser-Rudolf", "Henri Peters-Arnolds", "Ludwig Rex", "Elsa Wagner"], "genres": ["Horror", "Mystery", "Thriller"], "country": "Germany", "lenguages": [], "runtime": "76 min", "sinopsis": "\nTHE CABINET OF DR. CALIGARIFrancis (Friedrich Feher) and an older man are sitting in a garden, telling stories. A girl (Lil Dagover) walks past, unresponsive, as in a daze. Francis says she is his fiancée Jane and that the story of how she got that way will be amazing.It all started when a carnival came to his hometown of Hostenwall . . . (we go into flashback) . . .Francis and his best friend Alan (Hans Heinrich von Twardowski) together with Jane go to the carnival for fun. They are enticed by an older mountebank (Werner Krauss) calling himself Dr. Caligari to enter his tent to see his amazing somnambulist Cesare (Conrad Veidt) who has been asleep for 25 years and, under Dr. Caligari's command, is about to awaken.After some people enter the tent and sit down, Dr. Caligari opens a vertical cabinet shaped like a mummys sarcophagus, and we see Cesare is a gaunt young man who wakes and steps forward in extreme slow motion. Supposedly he spends his life sleeping in the cabinet and is able to predict the future when awake. Caligari brags that Cesare can answer any question whatsoever.When Alan asks Cesare how long he has to live, the answer is that Alan will die before dawn tomorrow. This unsettling prediction cuts their fun short, so Alan, Francis, and Jane go home. Jane is particularly affected, since, at that time, she was Alans girl friend although she knew that Francis was also in love with her.After night comes, we see, inside Alan's rooms, the shadows of Alan and his killer fighting on his bedroom wall.Alan is found murdered the next morning. Francis goes to tell the police after he realizes the somnambulist's prophecy has come true. Suspicion turns to the eerie somnambulist and his strange handler.Before police do anything, an attempted murder of an old woman takes place, throwing the town into panic.Back at Dr. Caligari's wagon, we see him feeding gruel to Cesare as he sits in a coffin. When police knock at the wagon asking questions, they are shown Cesare inside the coffin, and Caligari protests that he doesnt ever leave the coffin without his permission.At some point a common criminal confesses to the attempted murder of the old lady, so the police are back to investigating Alans murder only. Francis, along with Jane, keep investigating Caligari and Cesare.\nCaligari orders Cesare to kill Jane. Cesare creeps into Jane's bedroom and as he lifts a knife to kill her, she screams and faints. He carries Jane out of her house, leading the townsfolk on a lengthy chase. Cesare falls from a height to his death to end the pursuit.The townsfolk discover a dummy in Cesare's cabinet, and that Caligari has fled.Francis goes to a nearby insane asylum to inquire whether the fled Dr. Caligari might be a patient there. The worker he speaks with tells him he must go see the director of the institute for patient information, as he's not allowed to discuss any of that.Francis goes to the director's office and it turns out the director and Dr. Caligari are one and the same person.Francis gets the police over there and after looking through books and notebooks in the office, they discover a historical book about a mythical Caligari, who did just what Dr. Caligari is doing now, back in 1793 in northern Italy. The XIth century Caligari used a hypnotized somnambulist to murder people. The director has notes to suggest he is trying to recreate the XIth Century events.When the director arrives, after being confronted with the dead Cesare, he goes nuts, saying he must become the new Caligari, so staff in the institute put him in a straight jacket. His mania is manifest, and he is confined in his own asylum.At this point the flashback is over. The expressionist look of buildings is gone. Francis and the man who was told the story wander back from the garden to the institute patio. Cesare is standing in the corner and Francis warns the older man not to accept one of his prophecies, for he would surely die.Jane is there also, and when Francis asks her to marry him, she says she cannot marry someone not of royal blood.Then down the stairs comes Dr. Caligari (the director), and Francis quickly gets in a scuffle with him. Francis is grabbed by the staff and taken upstairs.Dr. Caligari comes to the conclusion that Francis is a maniac and that his mania is caused by his delusion that Dr. Caligari is in fact the mythic Caligari who would wander from town to town with Cesare killing townsfolk.The twist ending reveals that all of the flashback is actually Francis delusion, symbolized in the film by the distorted buildings and landscapes. Francis, Jane and Cesare are all inmates of the insane asylum, and the man he calls Caligari is the asylum director. The director, after this revelation of the sources of his patient's delusion, says that now he should be able to cure Francis.\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 11}}
{"title": "Macho y hembra", "year": "1919", "director": ["Cecil B. DeMille"], "writers": ["Jeanie Macpherson", "J.M. Barrie"], "actors": ["Thomas Meighan", "Theodore Roberts", "Raymond Hatton", "Robert Cain", "Gloria Swanson", "Lila Lee", "Bebe Daniels", "Julia Faye", "Rhy Darby", "Mildred Reardon", "Mayme Kelso", "Edmund Burns", "Henry Woodward", "Sydney Deane", "Wesley Barry", "Edna Mae Cooper", "Lillian Leighton", "Guy Oliver", "Clarence Burton", "Lawson Butt", "Kamuela C. Searle"], "genres": ["Adventure", "Drama"], "country": "United States", "lenguages": ["English"], "runtime": "116 min", "summary": ["Lady Mary Lasenby is a spoiled maiden who always gets her way until shipwrecked with her butler, then learns which qualities are really admirable in a person.", "Lord Brockelhurst, his unwilling betrothed Lady Mary, his butler Crichton and scullery maid Tweeny are on Lord Loam's yacht which is wrecked leaving them all to cope on a desert island. Class distinctions fall apart for the time being.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "\"The picture is spoken of as a story that enters a family of English blue blood, reveals their luxuries, snobberies, whims and their selfish class distinction. It takes them on a cruise with their servants, wrecks them on the rocks, flings them, mistress and maid, lord and butler into the wilds of an untamed tropical island. What happens after has been woven into one of the most interesting stories that has ever been filmed.\" - Review section, Staff, \"'Male and Female' Is Big Film Story,\" Riverside Daily Press, Riverside, California, Monday 22 December 1919, Volume XXXIV, Number 303, page 7.\n\n—C. Mark Sublette"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 12}}
{"title": "Die Spinnen, 1. Teil - Der Goldene See", "year": "1919", "director": ["Fritz Lang"], "writers": ["Fritz Lang"], "actors": ["Carl de Vogt", "Lil Dagover", "Ressel Orla", "Georg John", "Bruno Lettinger", "Edgar Pauly", "Paul Morgan", "Meinhart Maur", "Friedrich Kühne", "Paul Biensfeldt", "Gilda Langer", "Harry Frank", "Hans Lanser-Rudolf"], "genres": ["Adventure", "Western"], "country": "Germany", "lenguages": [], "runtime": "81 min", "summary": ["Kay Hoog finds a message that indicates that some Incas are still alive, but the secret organisation \"Die Spinnen\" wants the Incas' gold....", "In San Francisco, the sportsman Kay Hoog tells to the members of a club that he has found a message in a bottle with a map from a Harvard's missing professor telling about a treasure of an Inca lost civilization still alive. He decides to go to Peru to seek the gold. However, members of the secret criminal organization \"The Spiders\" leaded by Lio Sha break in Kay's mansion during the night and steal the map. Kay Hoog travels to Peru, where he retrieves his map and a document about the Diamond Ship from The Spiders. Later he saves the Priestess of the Sun Naela and brings her to San Francisco. However, The Spiders kill Naela and Kay Hoog promises revenge for the death of his love.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil", "Im ersten Teil von Fritz Langs zunächst auf vier Teilen angelegten Abenteurer-Serie \"Die Spinnen\" jagt der Sportler, Abenteurer und Weltenbummler Kay Hoog dem sagenhaften Goldschatz der Inkas hinterher, von dem er aus einer Flaschenpost erfährt. Die Verbrecherorganisation \"Die Spinnen\" entsendet eine konkurrierende Expedition, angeführt von der schönen und gefährlichen Lio Sha. Am goldenen See rettet Hoog die Inka-Sonnenpriesterin Naëla und verliebt sich in sie. Er nimmt Naëla mit nach Hause, wo sie von Lio Sha ermordet wird. Kay Hoog schwört Rache.", "A desperate, haggard-looking man puts a message into a bottle, and is able to throw it into the sea just as he is shot by an arrow. Some time later, well-known sportsman Kay Hoog announces to a large audience that he has found the message, which tells of a lost civilization that possesses an immense treasure. Hoog immediately plans an expedition to find it. But Lio Sha, the head of a criminal organization known as the Spiders, plans her own expedition, and she is determined to get the treasure for herself.\n\n—Snow Leopard"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 13}}
{"title": "Al sol", "year": "1919", "director": ["Charles Chaplin"], "writers": ["Charles Chaplin"], "actors": ["Charles Chaplin", "Edna Purviance", "Olive Ann Alcorn", "Albert Austin", "Henry Bergman", "Alva D. Blake", "Olive Burton", "Willie Mae Carson", "George Cole", "Tom Harrington", "N.E. Hendrix", "Lulu Jenks", "J. Parks Jones", "David Kohn", "Helen Kohn", "Granville Redmond", "Tom Terriss", "Loyal Underwood", "Tom Wilson", "Tom Wood"], "genres": ["Comedy", "Short"], "country": "United States", "lenguages": ["English"], "runtime": "34 min", "summary": ["Charlie works on a farm from 4am to late at night. He gets his food on the run (milking a cow into his coffee, holding an chicken over the frying pan to get fried eggs). He loves the neighbor's daughter Edna but is disliked by her father. He rides a cow into a stream and is kicked off. Unconscious, he dreams of a nymph dance. Back in reality a city slicker is hurt in a car crash and is being cared for by Edna. When Charlie is rejected after attempting to imitate the slicker, the result is ambiguous--either tragic or a happy ending. Critics have long argued as to whether the final scene is real or a dream.\n\n—Ed Stephan <stephan@cc.wwu.edu>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 14}}
{"title": "El verdadero corazón de Susie", "year": "1919", "director": ["D.W. Griffith"], "writers": ["Marian Fremont"], "actors": ["Lillian Gish", "Robert Harron", "Wilbur Higby", "Loyola O'Connor", "George Fawcett", "Clarine Seymour", "Kate Bruce", "Carol Dempster", "Raymond Cannon", "Louise Emmons"], "genres": ["Comedy", "Drama", "Romance"], "country": "United States", "lenguages": [], "runtime": "87 min", "summary": ["Susie, a plain young country girl, secretly loves a neighbor boy, William. She believes in him and sacrifices much of her own happiness to promote his own ambitions, all without his knowledge. Eventually he rises to a position of success and sophistication, and Susie realizes that she has through her own efforts raised him to a level where he is inaccessible to her.\n\n—Jim Beaver <jumblejim@prodigy.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 15}}
{"title": "Historias tenebrosas", "year": "1919", "director": ["Richard Oswald"], "writers": ["Anselma Heine", "Robert Liebmann", "Edgar Allan Poe", "Robert Louis Stevenson", "Richard Oswald"], "actors": ["Anita Berber", "Conrad Veidt", "Reinhold Schünzel", "Hugo Döblin", "Paul Morgan", "Georg John", "W. Arnoldi", "Bernhard Goetzke", "Richard Oswald", "Hans Heinrich von Twardowski"], "genres": ["Fantasy", "Horror", "Mystery"], "country": "Germany", "lenguages": [], "runtime": "112 min", "summary": ["A demon, a reaper, and the ghost of a prostitute read gothic short stories and act them out.", "Um Mitternacht steigen der Tod, der Teufel und eine Dirne aus ihren Bildern in einem Antiquariat und erzählen einander fünf Gruselgeschichten: 1. \"Die Erscheinung\": In einem Hotel verschwindet eine Frau spurlos. Die Hotelleitung wollte vertuschen, dass sie an der Pest gestorben ist. 2. \"Die Hand\": Die Hand eines Ermordeten verfolgt den Mörder aus dem Jenseits. 3. \"Die schwarze Katze\": Ein Mann bringt seine Frau um und mauert die Leiche im Keller ein, aber die ebenfalls eingemauerte Katze verrät ihn. 4. \"Der Selbstmörder-Klub\": Ein Polizeikommissar gerät in einen Geheimbund, in dem derjenige, der die Todeskarte zieht, sterben muss. 5. \"Der Spuk\": Durch einen inszenierten Spuk vertreibt ein Mann seinen Nebenbuhler. - Am Ende verschwinden die drei Erzähler, aber der Antiquar ist wahnsinnig geworden.", "After the old-books shop closes, portraits of the Strumpet, Death, and the Devil come to life and amuse themselves by reading stories--about themselves, of course, in various guises and eras. Four of the stories are literary horror stories (one by Poe, one by R. L. Stevenson), and the last one is a comedy involving a fake haunting.\n\n—Judy Shoaf"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 16}}
{"title": "Páginas del libro de Satán", "year": "1920", "director": ["Carl Theodor Dreyer"], "writers": ["Edgar Høyer", "Marie Corelli", "Carl Theodor Dreyer"], "actors": ["Helge Nissen", "Halvard Hoff", "Jacob Texiere", "Hallander Helleman", "Ebon Strandin", "Johannes Meyer", "Nalle Halden", "Tenna Kraft", "Viggo Wiehe", "Emma Wiehe", "Jeanne Tramcourt", "Hugo Bruun", "Elith Pio", "Emil Helsengreen", "Viggo Lindstrøm", "Vilhelm Petersen", "Clara Pontoppidan", "Carlo Wieth", "Karina Bell", "Carl Hillebrandt", "Christian Nielsen", "Erling Hanson", "Wilhelm Jensen", "Sven Scholander"], "genres": ["Drama"], "country": "Denmark", "lenguages": [], "runtime": "167 min", "sinopsis": "\nCarl Theodor Dreyer's classic silent film tells the tale of Satan's (Helge Nissen) banishment from heaven. In order to return, Satan must perform acts of temptation upon humanity with the stipulation that for every soul who yields, 100 years will be added to his time on Earth. For every soul who resists, 1000 years will be commuted from his judgment. The film follows Satan's path through the ages as an instigator during times of conflict.\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 17}}
{"title": "Convicto 13", "year": "1920", "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Edward F. Cline", "Buster Keaton"], "actors": ["Buster Keaton", "Sybil Seely", "Joe Roberts", "Edward F. Cline", "Joe Keaton", "Louise Keaton", "Harry Keaton"], "genres": ["Short", "Comedy", "Crime"], "country": "United States", "lenguages": ["English"], "runtime": "19 min", "summary": ["A young golfer is mugged by an escaped convict and finds himself in a prison where he foils a jailbreak.", "Buster is playing golf with Sybil when he gets knocked out. An escaped prisoner changes clothes with him. Buster goes to prison and learns that he is to be hanged. He changes clothes with a guard just as prisoner Roberts attacks all the guards.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "A prisoner escapes from prison and steals and changes clothes of a golf player (Buster Keaton). The policemen wrongly arrest the player instead and once in prison, he realizes that he is going to be hanged in the afternoon. The player swaps clothes with a guard and fights against a rebellion in the prison.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 18}}
{"title": "El hombre y la bestia", "year": "1920", "director": ["John S. Robertson"], "writers": ["Robert Louis Stevenson", "Clara Beranger", "Thomas Russell Sullivan", "Oscar Wilde"], "actors": ["John Barrymore", "Brandon Hurst", "Martha Mansfield", "Charles Lane", "Cecil Clovelly", "Nita Naldi", "Louis Wolheim", "Alma Aiken", "J. Malcolm Dunn", "Ferdinand Gottschalk", "Julia Hurley", "Jack McHugh", "Georgie Drew Mendum", "Blanche Ring", "May Robson", "George Stevens", "Edgard Varèse"], "genres": ["Drama", "Horror", "Sci-Fi"], "country": "United States", "lenguages": ["English"], "runtime": "69 min", "summary": ["Dr. Henry Jekyll experiments with scientific means of revealing the hidden, dark side of man and releases a murderer from within himself.", "Based on the Robert Louis Stevenson story: Doctor Henry Jekyll's enthusiasm for science and his selfless acts of service have made him a much-admired man. But as he visits Sir George Carew one evening, his host criticizes him for his reluctance to experience the more sensual side of life. Sir George goads Jekyll into visiting a music hall, where he watches the alluring dancer Gina. Jekyll becomes fascinated with the two contrasting sides of human nature, and he becomes obsessed with the idea of separating them. After extensive work in his laboratory, he devises a formula that does indeed allow him to alternate between two completely different personalities, his own and that of a brutish, lascivious person whom he names Hyde. It is not long before the personality of Hyde begins to dominate Jekyll's affairs.\n\n—Snow Leopard"]}
