{
    "took": 5,
    "timed_out": false,
    "_shards": {
        "total": 1,
        "successful": 1,
        "skipped": 0,
        "failed": 0
    },
    "hits": {
        "total": {
            "value": 5862,
            "relation": "eq"
        },
        "max_score": 2.552989,
        "hits": [
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20014",
                "_score": 2.552989,
                "_source": {
                    "title": "Black Hawk derribado",
                    "rating": 7.7,
                    "year": 2001,
                    "directors": [
                        "Ridley Scott"
                    ],
                    "writers": [
                        "Mark Bowden",
                        "Ken Nolan"
                    ],
                    "actors": [
                        "Josh Hartnett",
                        "Ewan McGregor",
                        "Tom Sizemore",
                        "Eric Bana",
                        "William Fichtner",
                        "Ewen Bremner",
                        "Sam Shepard",
                        "Gabriel Casseus",
                        "Kim Coates",
                        "Hugh Dancy",
                        "Ron Eldard",
                        "Ioan Gruffudd",
                        "Tom Guiry",
                        "Charlie Hofheimer",
                        "Danny Hoch",
                        "Jason Isaacs",
                        "Zeljko Ivanek",
                        "Glenn Morshower",
                        "Jeremy Piven",
                        "Brendan Sexton III",
                        "Johnny Strong",
                        "Richard Tyson",
                        "Brian Van Holt",
                        "Nikolaj Coster-Waldau",
                        "Steven Ford",
                        "Ian Virgo",
                        "Tom Hardy",
                        "Gregory Sporleder",
                        "Carmine Giovinazzo",
                        "Chris Beetem",
                        "Tac Fitzgerald",
                        "Matthew Marsden",
                        "Orlando Bloom",
                        "Kent Linville",
                        "Enrique Murciano",
                        "Michael Roof",
                        "George Harris",
                        "Razaaq Adoti",
                        "Treva Etienne",
                        "Abdibashir Mohamed Hersi",
                        "Pavel Vokoun",
                        "Dan Woods",
                        "Ty Burrell",
                        "Boyd Kestner",
                        "Jason Hildebrandt",
                        "Kofi Amankwah",
                        "Joshua Quarcoo",
                        "Johann Myers",
                        "Lee Geohagen",
                        "Marcus Ashley",
                        "Tommy Dallace",
                        "Giannina Facio",
                        "Corey Johnson",
                        "Norman Campbell Rees",
                        "Gibson Rickenbacker",
                        "Nikky Smedley"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Somali",
                        "Arabic"
                    ],
                    "runtime": 144,
                    "summary": " In early 1990s Somalia, famine and civil war have gripped the country, resulting in over 300,000 civilian deaths and a huge United Nations peacekeeping operation being sent in. With the bulk of the peacekeepers withdrawn by 1993, the Somali militia have declared war on the remaining UN personnel. In response, United States Army Rangers, Delta Force, and 160th SOAR are deployed to Somalia to capture Mohammed Farrah Aidid, self-proclaimed president of the country. Outside Mogadishu, Rangers and Delta Force operatives capture Osman Ali Atto, a warlord selling arms to the militia of Aidid. Shortly thereafter, a mission is planned to capture Omar Salad Elmi and Abdi Hassan Awale Qeybdiid, two of Aidid's top advisers. The US forces include experienced men as well as new recruits, including PFC Todd Blackburn and a desk clerk going on his first mission. When his Lieutenant is removed from duty as the result of a seizure, Staff Sergeant Matthew Eversmann is placed in command of Ranger Chalk Four, his first command.The operation is launched and Delta Force successfully captures Aidid's advisers inside the target building, but the Rangers and helicopters escorting the ground-extraction convoy take heavy fire, while SSG Eversmann's Chalk Four is dropped a block away by mistake. When Blackburn is severely injured after falling from one of the Black Hawk helicopters, three HMMWVs led by SGT Jeff Struecker are detached from the convoy to return Blackburn to the UN-held Mogadishu Airport. SGT Dominick Pilla is shot and killed just as Struecker's column gets underway, and shortly thereafter a black hawk, call sign Super-Six One, piloted by CW3 Clifton "Elvis" Wolcott, is shot down by a rocket-propelled grenade (RPG) and crashes deep within the city. Wolcott and his co-pilot are killed, the two crew chiefs are wounded, and one mortally wounded Delta sniper on board escapes in another helicopter that makes it back to base. The ground forces are rerouted to converge on the crash site, but the Somali militia throw up roadblocks, forcing LTC Danny McKnight's Humvee column off it's planned route, while sustaining heavy casualties.Meanwhile, two Ranger Chalks, including Eversmann's unit, reach Super-Six One's crash site, setting up a defensive perimeter to await evacuation with the two wounded men and the fallen pilots. In the interim, call sign Super-Six Four, piloted by CW3 Michael Durant is also shot down by an RPG, crashing several blocks away.With CPT Mike Steele's Rangers pinned down and sustaining heavy casualties, no ground forces can reach Super Six Four's crash site, nor reinforce the Rangers defending Super Six One. Two Delta snipers, SFC Randy Shughart and MSG Gary Gordon are inserted by helicopter to Super Six Four's crash site, where they find Durant still alive. Despite a valiant effort to defend the downed Black Hawk, the crash site is eventually overrun, Gordon and Shughart are killed, and Durant is captured and taken to Aidid. McKnight's column gives up the attempt to reach Six-One's crash site, and returns to base with their prisoners and the casualties. The men prepare to go back to extract the pinned down Rangers and the fallen pilots and MG Garrison orders the 10th Mountain Division, including Malaysian and Pakistani forces, to mobilize as a relief column.As night falls the Somali militia launch a sustained assault on the trapped Americans at Super Six One's crash site. The militia is held off throughout the night by strafing runs and rocket attacks from AH-6J Little Bird helicopter gunships of the Nightstalkers, until the 10th Mountain Division's relief column is able to reach the site. The wounded and casualties are evacuated in the vehicles, however extracting the bodies of Cliff Wolcott and his co-pilot from the downed Black Hawk turns out to be more involved and the column is forced to stay for nearly four more hours. After everyone and any dead soldiers are secured in the vehicles, the convoy leaves. When space inside the vehicles runs short, a handful of remaining Army Rangers and Delta operatives are forced to run from the crash site back to the stadium, in the UN Safe Zone, a journey dubbed the "Mogadishu Mile" by those who ran.The closing credits detail the results of the raid: 19 American soldiers were killed, with over 1,000 Somalis dead. Durant was released after 11 days of captivity. Delta snipers Gordon and Shughart were the first soldiers to be posthumously awarded the Medal of Honor since the Vietnam War. On August 2, 1996, Aidid was killed in a battle with a rival clan. General Garrison retired from active duty the following day. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BYWMwMzQxZjQtODM1YS00YmFiLTk1YjQtNzNiYWY1MDE4NTdiXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20017",
                "_score": 2.552989,
                "_source": {
                    "title": "Legado de sangre",
                    "rating": 4.7,
                    "year": 2001,
                    "directors": [
                        "Michael Oblowitz"
                    ],
                    "writers": [
                        "Christos N. Gage",
                        "Ruth Fletcher"
                    ],
                    "actors": [
                        "Adrian Paul",
                        "Bokeem Woodbine",
                        "Bai Ling",
                        "Péter Halász",
                        "James Booth",
                        "Ming Lo",
                        "Paul Collins",
                        "Debbie Javor",
                        "Reed Diamond",
                        "John Durbin",
                        "Zen Gesner",
                        "István Göz",
                        "William Hootkins",
                        "Brandy Miller",
                        "Donte Calarco",
                        "John Rado",
                        "Barna Illyés",
                        "Erzsébet Bodor",
                        "Antal Leisen",
                        "Norbert Növényi",
                        "Soma Zámbori",
                        "Lajos Szücs",
                        "Zsolt Sáfár Kovács",
                        "Dianna Camacho",
                        "Szonja Oroszlán",
                        "Imre Csuja",
                        "Jake Eberle"
                    ],
                    "genres": [
                        "Action",
                        "Horror",
                        "Sci-Fi"
                    ],
                    "country": "Hungary",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 91,
                    "summary": " The Breed is an interesting take on Vampires as being genetic mutations that are able to transform 80% of the humans (20% being immune). The setting is some form of alt. universe in the near future where Nazi Germany happened, but apparently Socialism/Communism is now the form of Government. The Vampires have contacted the government and desire to establish normal relations as a different race, Jews, Blacks, Indians are mentioned here and the mistreatment by others as a fear. Both sides, humans and vampires, have plans which are going at the same time to wipe out the other.Sounds more interesting than it actually is! Not too much blood shed for a vampire flick along with some toplessness. Overall, this movie is a real DOG!! ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTc1NTc4ODMxMV5BMl5BanBnXkFtZTcwNDYwMzAzMQ@@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20045",
                "_score": 2.552989,
                "_source": {
                    "title": "Arjun",
                    "rating": 7.2,
                    "year": 1985,
                    "directors": [
                        "Rahul Rawail"
                    ],
                    "writers": [
                        "Javed Akhtar",
                        "Javed Akhtar",
                        "Javed Akhtar"
                    ],
                    "actors": [
                        "Sunny Deol",
                        "Dimple Kapadia",
                        "Raj Kiran",
                        "Anupam Kher",
                        "Satyajeet Puri",
                        "Supriya Pathak",
                        "A.K. Hangal",
                        "Shashikala Jawalkar",
                        "Prem Chopra",
                        "Shafi Inamdar",
                        "Paresh Rawal",
                        "Annu Kapoor",
                        "Sunder",
                        "Raja Bundela",
                        "Leena Das",
                        "Goga Kapoor",
                        "Jagdish Raj",
                        "Gabboo",
                        "Nandita Thakur",
                        "Kamaldeep",
                        "Rajan Haksar",
                        "Sunil Dhawan",
                        "Jugnu",
                        "Ghanshyam Rohera",
                        "Nitin Sethi",
                        "Jaspal Sandhu",
                        "Haroon Khan",
                        "Vikas Anand",
                        "Sheela Sharma",
                        "Rashid",
                        "Farid",
                        "Anthony",
                        "Jagdarshan Samra",
                        "Dev Kumar",
                        "Shravan Sagar",
                        "Chacha Chaudhary",
                        "Dharma",
                        "Girija Shankar"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama"
                    ],
                    "country": "India",
                    "languages": [
                        "Hindi"
                    ],
                    "runtime": 154,
                    "summary": [
                        "Arjun Malvankar after his graduation thrives to get job. The corruption and injustice taking place in his community frustrates him to the extent of revolting with the help of some of his friends. This path of his gets him into serious problems with the law and some outrageous gangsters. He is then taken in by a politician named Shivkumar Chowgule; who not only has pity on him but offers him a job and encourages him. Situations take a different turn one morning engulfing Arjun's life into a world of lies, deceit, crime and politics. —gavin (racktoo@hotmail.com)",
                        "Mr. Malwankar lives a small tenement in Grant Road, Bombay, with his son, Arjun, daughter, Sudha, and wife, Rukmini, who is his second wife, as his first wife perished. Although he is well past his retirement age, he continues to work for an abusive employer, Ashok. Arjun's attempts at seeking employment are all in vain. One day when hoodlums are beating up a man, he intervenes, beats the hoodlums up with the help of half of his friends. This is when his life changes forever. One of his friends', Mohan, is killed; Arjun finds out who the killers are, and kills them in broad daylight; he is arrested, and subsequently released, only to be told by his father that he is no longer welcome. A politician, Shiv Kumar Chougule, takes a liking to Arjun and employs him, and gives him all the support and assistance he needs to fight hoodlums. Arjun now finds he has a mission in life, and is quite content. He meets with Geeta Sahani, and they both fall in love. Then there is a change in the political set-up, which results in Shiv Kumar compromises with the very powers he had undertaken to destroy. Now Arjun has no one to stand behind him and support him, and he may have to take up his fight against Shiv Kumar, or die trying. —rAjOo (gunwanti@hotmail.com)"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOGVhNTIxZTctZDY0MC00MmJiLThiYjgtNmFiZjc5MzM4NTM3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR5,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20046",
                "_score": 2.552989,
                "_source": {
                    "title": "Battle Royale",
                    "rating": 7.6,
                    "year": 2000,
                    "directors": [
                        "Kinji Fukasaku"
                    ],
                    "writers": [
                        "Koushun Takami",
                        "Kenta Fukasaku"
                    ],
                    "actors": [
                        "Tatsuya Fujiwara",
                        "Aki Maeda",
                        "Tarô Yamamoto",
                        "Chiaki Kuriyama",
                        "Takashi Tsukamoto",
                        "Sôsuke Takaoka",
                        "Yukihiro Kotani",
                        "Eri Ishikawa",
                        "Sayaka Kamiya",
                        "Takayo Mimura",
                        "Yutaka Shimada",
                        "Ren Matsuzawa",
                        "Hirohito Honda",
                        "Ryou Nitta",
                        "Sayaka Ikeda",
                        "Anna Nagata",
                        "Yukari Kanasawa",
                        "Misao Kato",
                        "Hitomi Hyuga",
                        "Satomi Ishii",
                        "Asami Kanai",
                        "Satomi Hanamura",
                        "Yousuke Shibata",
                        "Shirô Gô",
                        "Yuuki Masuda",
                        "Shigeki Hirokawa",
                        "Tamaki Mihara",
                        "Tomomi Shimaki",
                        "Yasuomi Sano",
                        "Shin Kusaka",
                        "Gouki Nishimura",
                        "Shigehiro Yamaguchi",
                        "Osamu Ohnishi",
                        "Satoshi Yokomichi",
                        "Junichi Naitou",
                        "Tsuyako Kinoshita",
                        "Mai Sekiguchi",
                        "Takako Baba",
                        "Haruka Nomiyama",
                        "Aki Unone",
                        "Ai Iwamura",
                        "Ai Maeda",
                        "Minami",
                        "Michi Yamamura",
                        "Suzuka Tonegawa",
                        "Tarô Suwa",
                        "Reiko Kataoka",
                        "Takeyuki Hirai",
                        "Tomu Asakawa",
                        "Yûya Nakahara",
                        "Takashi Komori",
                        "Ryôta Nakamura",
                        "Akihiro Ugajin",
                        "Yôichi Murakami",
                        "Tsuguharu Niizaki",
                        "Jun'ichi Nashiki",
                        "Hiroshi Kitagawa",
                        "Hideaki Kawashima",
                        "Umiji Tasaki",
                        "Mitsuaki Tachikawa",
                        "Hidetsugu Okumura",
                        "Daisuke Yazawa",
                        "Nobuki Baba",
                        "Naoki Iwasawa",
                        "Kôji Tokuhisa",
                        "Mikiya Sanada",
                        "Kazuhiro Yokokura",
                        "Shigeki Homma",
                        "Kazuo Araki",
                        "Gôshi Matsuhara",
                        "Akira Yoshizawa",
                        "Kenzo Shirahama",
                        "Kanji Okumura",
                        "Shôji Takano",
                        "Ryôji Sugimoto",
                        "Hajime Yoneda",
                        "Hideaki Kojima",
                        "Nanami Ohta",
                        "Ayana Noguchi",
                        "Tetsu Masuda",
                        "Kazutoshi Yokoyama",
                        "Kotaru Kamijou",
                        "Hirobumi Seki",
                        "Kiyoyuki Matsumoto",
                        "Gou Ryugawa",
                        "Takashi Taniguchi",
                        "Ken Nakaide",
                        "Kanako Fukaura",
                        "Yûko Miyamura",
                        "Ko Shibasaki",
                        "Masanobu Andô",
                        "Takeshi Kitano",
                        "Doug Erholtz",
                        "Erin Fitzgerald",
                        "Stephanie Komure",
                        "Stephanie Sheh",
                        "John Snyder",
                        "Spike Spencer",
                        "Kaiji Tang",
                        "Julie Ann Taylor"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "Japan",
                    "languages": [
                        "English",
                        "Japanese"
                    ],
                    "runtime": 114,
                    "summary": " The story opens with a frantic news broadcast about a young girl being brought back to mainland Japan after she wins the latest "Battle Royale", a contest that pits high school students against each other in a fight to the death on a remote island. While being filmed, the girl smiles.Shuya Nanahara, a Japanese middle school student, attempts to cope with life after his father's suicide by hanging. Meanwhile, schoolmate Noriko Nakagawa is the only student attending class -- 3-B. Their teacher, Kitano, quietly leaves upon her tardy, apologetic arrival, but is attacked by student Yoshitoki Kuninobu and resigns after recovering from his wound.One year later, class 3-B takes a field trip after completing their compulsory studies; however, the class is gassed on their bus. They wake up in a "briefing room" on a remote island, wearing strange electronic collars. Kitano explains that the class has been chosen to participate in this year's Battle Royale as a result of the BR Act, which was passed after 800,000 students walked out of school. The orientation video cheerfully instructs the class to kill each other for three days until only one student remains. Students resistant to their rules or entering one of the randomly placed "death zones" for each day are to be killed by the collar's detonation. One of the 42 students, Fumiyo Fujiyoshi, interferes with the video by whispering to her friends; Kitano kills her on the spot with a thrown knife. While a shocked class is subdued by soldiers, Kuninobu openly confronts the viciousness of Kitano and the teacher slashes him with a knife (in the back of leg - the same area Kuninobu attacked Kitano two years earlier) before detonating his collar while Shuya, his best friend, watches in horror. Each student is provided a bag of food and water, map of the island, compass, and one item containing either a lethal weapon (firearm, kama (sickle), knife, potassium cyanide) or an item apparently worthless toward survival (paper fan, binoculars, coat hanger, saucepan lid). The weapons are supposed to eliminate any natural advantage any one student might have over the others.The program's first six hours see twelve deaths, four of which are suicides. Brazen, mute "exchange student" Kazuo Kiriyama and quietly deranged classmate Mitsuko Souma soon become the most dangerous players in the game, while another exchange student, Shogo Kawada seems somewhat more merciful. Shuya promises to keep Noriko safe for Kuninobu because he was in love with her, but never told her. Other students have various goals in the game: Shinji Mimura and his friends plot to hack into the military's computer systems and destroy their base of operations; Hiroki Sugimura searches for his best friend Takako Chigusa and his love interest Kayoko Kotohiki. Chigusa runs into Kazushi Niida, who is sexually obsessed with her; Chigusa kills him after he attempts forcing himself on her, but is herself killed by Mitsuko. Kawada teams with Shuya and Noriko, and reveals that he won a previous Battle Royale at the cost of his girlfriend, Keiko; he now swears vengeance. The trio are forced to separate when Kiriyama attacks, and Sugimura rescues Shuya, assisted by his assigned "weapon,
                    " a GPS tracking device.Shuya awakens bandaged by Yukie Utsumi in the island's lighthouse, where she helps reorient him to the events of the past 14 hours; five other girls on the school's cheerleading squad have also been guarding and hiding out in the building, apparently since the beginning of the program. Utsumi gathers the girls around the dining table to weigh in on a possible method of escape from the island which Shuya has informed her of. Yuko Sakaki, thinking that Shuya murdered a friend of hers, attempts to poison Shuya's food, but it is inadvertently eaten by one of the girls, killing her and sparking a massive, fear-fueled gunfight resulting in all the girls' deaths -- except Yuko. She realises the enormity of her paranoia and commits suicide, jumping from the deck of the lighthouse.Shuya returns to Noriko and Kawada, and they set out to find Mimura's group. To a small warehouse, Sugimura tracks down Kotohiki, who panics and kills him shortly after; Sugimura professes his love before dying. Kotohiki cries in despair, and is found and killed by Mitsuko. Watching from the rafters, Kiriyama then guns down and kills Mitsuko after she sadly dispenses some fitting advice to her two (dead) classmates.Upon the rapidly-consecutive deaths of Sugimura, Kotohiki and Souma, all of the seven students remaining are either preparing or willing to completely subvert the operations of the "game" - save for the psychopathic Kazuo. "The Third Man", a hacker group consisting of Mimura, Iijima and Yutaka, successfully infiltrate the military's computer system and prepare to destroy the perimeter using a truck converted into a fire-bomb. However, at the last second they are found by Kiriyama, who kills them all, but one of them manages to detonate the truck, seriously injuring the killer. When Kawada, Noriko and Shuya arrive at the hackers' burning base, Kawada confronts and kills the shrapnel-blinded, Uzi-armed Kiriyama with his SPAS-12 shotgun.On the morning of the final day, Kawada, aware of the collars' internal microphones, takes Shuya and Noriko aside and fakes their deaths. Suspecting that Kawada has won through manipulation of the BR system, Kitano ends the game and dismisses the troops before establishing final protocol, intent on personally killing the young man. Kitano realizes that Kawada, and not Mimura, has hacked into the game's intranet system months beforehand, and has now disabled Shuya and Noriko's tracking devices. Kitano unveils a homemade painting of the dead students, with Noriko indicated as the winner. He reveals that he was unable to bear the mutual hatred between him and his students, having been rejected by his daughter, Shiori. He also confesses that he always thought of Noriko as a daughter. He asks the confused, reluctant Noriko to kill him, but is quickly shot by Shuya after he threatens her at gunpoint. As he falls, Kitano shoots, and it is shown that the weapon in his hand was a mere water-gun. Suddenly, his phone rings, and Kitano sits down to answer it, telling Shiori that "if you hate someone, you take the consequences" before finally dying. Shuya, Noriko and Kawada leave the island on a boat, but Kawada dies from injuries sustained in his gunfight with Kiriyama -- "glad" that in the end, he "found true friends."Shuya and Noriko are declared fugitive murderers, and last seen on the run in the direction of Tokyo's Shibuya train station. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMDc2MGYwYzAtNzE2Yi00YmU3LTkxMDUtODk2YjhiNDM5NDIyXkEyXkFqcGdeQXVyMTEwNDU1MzEy._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20048",
                "_score": 2.552989,
                "_source": {
                    "title": "China Strike Force",
                    "rating": 5.2,
                    "year": 2000,
                    "directors": [
                        "Stanley Tong"
                    ],
                    "writers": [
                        "Stanley Tong",
                        "Steven Whitney"
                    ],
                    "actors": [
                        "Aaron Kwok",
                        "Norika Fujiwara",
                        "Leehom Wang",
                        "Ruby Lin",
                        "Coolio",
                        "Mark Dacascos",
                        "Ken Lo",
                        "Paul Chun",
                        "Siu-Ming Lau",
                        "Jennifer Lin",
                        "Chun Lai",
                        "Jackson Lou",
                        "Li Hsueh Tung",
                        "Paul Cheng",
                        "Won Jin",
                        "Quan Lin",
                        "Kui Wong"
                    ],
                    "genres": [
                        "Action",
                        "Crime"
                    ],
                    "country": "Hong Kong",
                    "languages": [
                        "Mandarin",
                        "English"
                    ],
                    "runtime": 103,
                    "summary": [
                        "Assassination at a charity event in Shanghai has 2 cops follow and fighting the assassin or follow a cute, Japanese woman pick-pocketing the victim. Drugs are involved. Chases with motorcycles, race-cars and helicopter follow.",
                        "A young Chinese Security Officer, Darren, is called for Team 808, which fights against the smuggling of drugs and corruption. Noriko, a Japanese Interpol officer, collaborates with Darren for the destruction of a large international drug cartel. At the same time, a senior government officer's daughter is suspected of corruption. —Ninja01"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTM1MDYyMzEzMl5BMl5BanBnXkFtZTcwNDczNzQyMQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20051",
                "_score": 2.552989,
                "_source": {
                    "title": "Diablo",
                    "rating": 6,
                    "year": 2003,
                    "directors": [
                        "F. Gary Gray"
                    ],
                    "writers": [
                        "Christian Gudegast",
                        "Paul T. Scheuring"
                    ],
                    "actors": [
                        "Vin Diesel",
                        "Larenz Tate",
                        "Timothy Olyphant",
                        "Geno Silva",
                        "Jacqueline Obradors",
                        "Steve Eastin",
                        "Juan Fernández",
                        "Jeff Kober",
                        "Marco Rodríguez",
                        "Mike Moroff",
                        "Emilio Rivera",
                        "George Sharperson",
                        "Malieek Straughter",
                        "Alice Amter",
                        "Jim Boeke",
                        "Rubelio Bracamonte",
                        "Ben Hernandez Bray",
                        "Norm Compton",
                        "Atiana Coons-Parker",
                        "Esteban Cueto",
                        "Ken Davitian",
                        "April Flowers",
                        "Aleane Fitz-Carter",
                        "Robert Fraade",
                        "Zachary John Gonzales",
                        "Richard Gross",
                        "Richard Haje",
                        "Paula Harrison",
                        "Toby Holguin",
                        "Terri Hoyos",
                        "Thomas Kopache",
                        "Julia Lee",
                        "F. Valentino Morales",
                        "Scott Reitz",
                        "Joe Rodriguez",
                        "Mik Scriba",
                        "Karrine Steffans",
                        "Rachel Sterling",
                        "Lamont Tyler",
                        "Dawnn Alane",
                        "Roslyn Bezanilla",
                        "Charlie Curtis",
                        "Azalea Davila",
                        "Kristin Eckert",
                        "Sonia Enriquez",
                        "Cristina LaMonica",
                        "Laura Salem",
                        "Elizabeth Alvarez",
                        "Brooke Lewis Bellas",
                        "Maria Arcé",
                        "Alan Austin",
                        "Tim Babb",
                        "Ray Conchado",
                        "Delno Ebie",
                        "Julian Flynn",
                        "Janis Jones",
                        "Mel Mede",
                        "Johnny Michaels",
                        "Meriah Nelson",
                        "Michael Papajohn",
                        "Carmen Gloria Pérez",
                        "Javier Rivas",
                        "Anthony Rodriguez",
                        "Dean Rubin",
                        "Erica Taylor",
                        "Santiago Verdu"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Spanish"
                    ],
                    "runtime": 109,
                    "summary": [
                        "A man known as Diablo emerges to head a drug cartel after the previous leader is imprisoned.",
                        "Sean Vetter and Demetrius Hicks are members of the DEA who are fighting an ongoing drug war on the California/Mexico border, they are most successful at it because of their edge of growing up on the street and being thugs converted to cops. The DEA busts one of the major players by the name of "Memo" Lucero and imprison him in the United States but then a major player named Diablo then takes over the business and now he is now the major player targeted by Vetter and his team. But when Vetter's wife is killed in a botched hit organized by Diablo, he seeks revenge against those responsible and in the process has to seek help from the imprisoned Lucero in order to catch Diablo. But in the process, Vetter and Hicks have to fight their way up the chain to get to Diablo but it's easier said than done when all Vetter can focus on is revenge... —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk4NzEwNjk1N15BMl5BanBnXkFtZTYwNTEzNTk5._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20055",
                "_score": 2.552989,
                "_source": {
                    "title": "Kill Bill: Volumen 1",
                    "rating": 8.2,
                    "year": 2003,
                    "directors": [
                        "Quentin Tarantino"
                    ],
                    "writers": [
                        "Quentin Tarantino",
                        "Quentin Tarantino",
                        "Uma Thurman"
                    ],
                    "actors": [
                        "Uma Thurman",
                        "Lucy Liu",
                        "Vivica A. Fox",
                        "Daryl Hannah",
                        "David Carradine",
                        "Michael Madsen",
                        "Julie Dreyfus",
                        "Chiaki Kuriyama",
                        "Shin'ichi Chiba",
                        "Chia-Hui Liu",
                        "Michael Parks",
                        "Michael Bowen",
                        "Jun Kunimura",
                        "Kenji Ôba",
                        "Yuki Kazamatsuri",
                        "James Parks",
                        "Sakichi Sato",
                        "Jonathan Loughran",
                        "Yoshiyuki Morishita",
                        "Tetsurô Shimaguchi",
                        "Kazuki Kitamura",
                        "Yôji Tanaka",
                        "Issey Takahashi",
                        "So Yamanaka",
                        "Juri Manase",
                        "Akaji Maro",
                        "Goro Daimon",
                        "Shun Sugata",
                        "Jin Zhan Zhang",
                        "Xiaohui Hu",
                        "Ambrosia Kelley",
                        "Sachiko Fujii",
                        "Yoshiko Yamaguchi",
                        "Ronnie Yoshiko Fujiyama",
                        "Shu Lan Tuan",
                        "Ai Maeda",
                        "Naomi Kusumi",
                        "Hikaru Midorikawa",
                        "Michael Kuroiwa",
                        "Christopher Allen Nelson",
                        "Stevo Polyi"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Japanese",
                        "French"
                    ],
                    "runtime": 111,
                    "summary": " Before the credits we learn that the film is about the Deadly Viper Assassination Squad, which has five members. A quotation gives the flavour: "Revenge is a dish best served cold". In monochrome, a gasping, blood-covered bride (Uma Thurman) looks up from a chapel floor. A hand wipes her face using a handkerchief with the name Bill in the corner, while a male voice explains that what he is about to do is not a sadistic act, but a masochistic one. Just before he shoots her in the head, the Bride tells Bill (David Carradine) that the baby she carries is his. A gunshot is heard and the opening credits begin, backed by the song "Bang Bang".Chapter 1: #2. Pasadena.The Bride drives up in a yellow and red pickup truck, outside a suburban home and strolls to the front door. As she rings, a flashback shows the Bride crashing to the floor and looking up to see the face of one of her attackers, Vernita Green (Vivica A. Fox). As soon as the door is open, the Bride's fist crashes into Vernita's face. A savage fight follows, first with fists, then with knives. The fight pauses when a school bus draws up outside and a little girl walks through the door. The antagonists hide their knives and pretend nothing is amiss despite the wreckage around them. They both reassure the child, Nikki (Ambrosia Kelley). The Bride mentions that she used to have a child who would be the same age as Nikki (four). Vernita sends the girl to her room. At this point Vernita is introduced as a member of the Deadly Vipers, codename Copperhead. The Bride is also a member, codename Black Mamba. The Bride makes clear that she is here for revenge but promises not to kill Vernita in front of her child. They plan a fight later, but while Vernita is preparing cereal for her child she fires a concealed gun at the Bride. She misses and the Bride kills her with a thrown knife.The child walks in, a witness to her mother's death. The Bride apologises but explains that her mother had it coming to her. She tells Nikki that if, when she grows up, she can't get past the killing, she should come find the Bride. "I'll be waiting,
                    " the Bride promises. She returns to the pickup, which is emblazoned with the words Pussy Wagon, crosses Vernita's name from a list headed "Death List Five,
                    " and drives away.Chapter 2: The Blood Splattered BrideFour years earlier in an El Paso wedding chapel, police are investigating a mass murder. The sheriff (Michael Parks) drives up and is told that there has been an execution-style massacre leaving nine bodies, including the bride, the groom, the preacher and his wife, the guests, and even the piano player. The sheriff strolls around commenting on the massacre, stops near the bride, and remarks on how good-looking she was. He immediately recognizes the name she was using, Arlene Machiavelli, as an alias. As he kneels to look more closely at her, she suddenly (perhaps unintentionally) spits in his face. We see her rushed to a hospital, where she lies in a deep coma.A smartly dressed blonde woman walks through the hospital, whistling a tune. She finds a changing room and emerges dressed as a nurse with a red-cross patch over one eye and carrying a tray with a syringe. A title identifies her as Elle Driver (Daryl Hannah) of the Deadly Vipers, codename California Mountain Snake. She stands over the comatose Bride and says that her gift is to allow her to die in her sleep. As she prepares to inject the contents of the syringe into the Bride's IV line, her mobile phone rings. It is Bill, who orders her to abort the mission in view of the Bride's survival of their previous efforts to assassinate her, and because it would lower them. Elle is furious, but does as ordered and leaves.Four years later, the Bride is still lying in a coma. A mosquito bites her and she sits up with a shriek. In a flashback she sees a gun pointing at her and a bullet approaching in slow motion. She begins to feel her body, first noticing the metallic sound of her skull and then feeling the absence of the baby in her womb. She shrieks again and sobs pitifully. When she hears approaching footsteps, she lies back and pretends to be still in a coma. An orderly (Michael Bowen) enters, accompanied by a large trucker (Jonathan Loughran). The orderly explains that, for $75, this attractive woman is available for whatever the trucker wants. The man pays up and is told that he can do anything as long as he doesn't leave any marks. The orderly leaves and the man climbs on top of the Bride. As he starts to kiss her she bites down on his lower lip and severs it in a profusion of blood. He's left unconscious or dead.The Bride tries to get out of bed but collapses as her legs will not support her. When she hears the orderly returning she picks up a knife and crawls behind the door. He enters and stands aghast at the carnage and the empty bed. She slashes his heel and he falls to the floor. Then, slamming the door into his head, she demands to know where Bill is. She reads the name Buck on the orderly's name tag, which triggers memories of his earlier assaults on her. She gives him a couple more violent blows with the door, perhaps killing him, then searches him for his car keys. The key fob says "Pussy Wagon" in distinctive pink script. Propelling herself to the basement car park in a wheelchair, the Bride is able to identify Buck's yellow pickup because it says "Pussy Wagon" on the back. She hauls herself in and starts the long process of getting her legs moving again.A shot of the rest of the Deadly Vipers gang introduces O-Ren Ishii (Lucy Liu), codename Cottonmouth, now head of the Tokyo yakuza.Chapter 3: The Origins of O-Ren IshiiIn anime format, the film follows O-Ren's development from the age of nine, when she witnessed the murder of her parents. Her father, an American military officer, had tried to fight off several yakuza henchman, but was killed. The yakuza leader, a sleazy old man, Matsumoto, also brutally murders O-Ren's Japanese mother. The last of Matsumoto's men lights a fire in the room, letting the house burn to the ground. O-Ren survives and avenges the murders at age 11 in blood-spouting style, taking advantage of Matsumoto's pedophilia. She grows up to be a world-class assassin.Meanwhile 13 hours have passed and the Bride has regained use of her legs, so she sets out on her revenge trail. We see her flying to Okinawa.Chapter 4: The Man from OkinawaThe Bride enters a Japanese sushi bar and there is a longish scene with the jovial bar-keeper and some slapstick action with his assistant. Things get serious when she tells the bar-keeper that she is looking for him, Hattori Hanzo (Shin'ichi Chiba). She explains that she needs some "Japanese steel" to kill vermin. He shows her to his attic where he keeps an array of the katanas (swords) he has made. When she tries one out he says that they are not for sale and he has sworn not to make any more "instruments of death". She explains that her "vermin" is a former pupil of his and he correctly guesses that she means Bill. He agrees to make her a sword, which will take a month. He suggests the Bride spend that time training.A month later we see Hanzo examining the new sword, which he believes is his finest work. He hands it to her in a small and solemn ceremony where he admits he broke his personal pact not to make any more swords but has done so because he supports the Bride's mission.Chapter 5: Showdown at the House of Blue LeavesThe film returns to O-Ren and shows her as newly elected Head of the Council of all the yakuza bosses. When one objects to her election on the grounds of her mixed-race origin (she is Chinese/Japanese-American), she immediately beheads him and warns the others never to disparage her heritage in any way or they'll suffer the same fate. We are introduced to O-Ren's lieutenants: her French-Japanese lawyer Sofie Fatale (Julie Dreyfus), another of Bill's protégées; her teenage bodyguard Gogo Yubari (Chiaki Kuriyama), a vicious killer sporting a plaid-skirted school uniform; and Johnny Mo (Chia-Hui Liu, credited as Gordon Liu), the head of her strongarm men, the Crazy 88.The Bride flies into Tokyo and appears in yellow leathers and helmet riding a yellow motorbike while O-Ren and her motorcade are heading for a restaurant. The Bride spots Sofie in her car and there is a flashback to Sofie calmly taking a call on her mobile while the Bride and her party were being slaughtered. O-Ren and her immediate subordinates arrive at the restaurant and are ushered upstairs to a private dining room by the obsequious owners. At the bar, the Bride sits quietly and watches.O-Ren and her party are enjoying themselves when O-Ren senses something threatening. She throws a small dart with a red tassel through the paper wall to lodge in a beam in the hallway outside, startling the Bride, who is lurking near the private room. O-Ren sends Gogo to look around, but the Bride has braced herself against the ceiling and Gogo doesn't see her. The Bride enters the toilet and while stripping off her leathers, hears "Auld Lang Syne,
                    " the distinctive ring-tone of Sofie's mobile.With Sofie in tow, the Bride loudly announces her presence from the restaurant floor, which brings O-Ren and her party rushing out onto the balcony. While they watch she slashes off one of Sofie's arms and pandemonium ensues as the diners and staff flee.O-Ren sends her lieutenants down singly or in groups to kill the Bride, but all end up being cut apart. The final defender is Gogo, who opposes the Bride's sword with a ball and chain in a vicious fight, ending when the Bride kills Gogo by embedding a broken, nail-studded table leg in her temple. Before O-Ren and the Bride can engage, the roar of motorbikes is heard and the Crazy 88 pour in. The ensuing battle of one against many is long, balletic and bloody but finally only one of the 88 remains -- the youngest -- and the Bride sends him off with a spanking. She announces to the defeated Crazy 88 that they may leave, but they must leave behind their severed limbs, which belong to her now. She also orders Sofie to stay.Outside in the snow, the Bride and O-Ren fight it out in a long and evenly-matched sword-fight. At the start of the fight, O-Ren casts doubt on the provenance of the Bride's sword. The Bride wins by slicing off the top of O-Ren's head; before she dies, O-Ren apologizes for an earlier insult and remarks that the sword must really be a Hanzo. Later, the Bride crosses O-Ren's name from her list.The Bride loads Sofie into a car and drives to a point where she can roll her down a snowy slope to a hospital. The Bride has tortured Sofie, cutting off her other arm for information on the whereabouts of the other Vipers and Bill. As the Bride draws up her "Death List Five,
                    " we see Sofie, talking to someone whose face is not seen but who is clearly Bill. She tells Bill that under threat of having more limbs cut off, she has told the Bride everything she knows. She explains that the Bride kept her alive just so she could tell Bill in person all that happened and warn him that soon all of them would be dead. Bill's final words are "Is she aware that her daughter is still alive?"To be continued.... ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzM3NDFhYTAtYmU5Mi00NGRmLTljYjgtMDkyODQ4MjNkMGY2XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20057",
                "_score": 2.552989,
                "_source": {
                    "title": "El fantasma del megacine",
                    "rating": 6.3,
                    "year": 2000,
                    "directors": [
                        "Blair Treu"
                    ],
                    "writers": [
                        "Stu Krieger"
                    ],
                    "actors": [
                        "Taylor Handley",
                        "Corinne Bohrer",
                        "Caitlin Wachs",
                        "Jacob Smith",
                        "Rich Hutchman",
                        "John Novak",
                        "Colin Fox",
                        "Mickey Rooney",
                        "Ricky Mabe",
                        "Julia Chantrey",
                        "Joanne Boland",
                        "J.J. Stocker",
                        "Lisa Ng",
                        "Joe Pingue",
                        "Heather Bertram",
                        "Jennifer Bertram",
                        "Jeff Berg",
                        "Daniel DeSanto",
                        "Jeffrey Akomah",
                        "Nicole Hardy",
                        "Marcia Diamond",
                        "Ellen-Ray Hennessy",
                        "Carlo Rota",
                        "Eric Hempsall",
                        "Larissa Gomes",
                        "Edie Inksetter",
                        "David Johnston",
                        "Nora Lem",
                        "Lee Rumohr",
                        "Valeria Von Leczycki Goncharova Barrett",
                        "Whitney Zanette"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Family",
                        "Mystery"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 89,
                    "summary": " Pete Riley is the 17 year old Assistant Manager of the Megaplex in his town. He is the youngest assistant manager ever. His mother thinks he works too hard working and doesn't have enough fun. The movie starts with the day of the biggest opening premire the movie theater has ever seen Midnight Mayhem. Pete gives two tickets to the girl of his dreams and her best friend, in hopes of winning her heart. A few things are standing in his way. His little brother and sister insist on seeing a movie and Petes mom tells Pete to dive them home on his dinner break. When he reports to the movie theater, people have called in sick and they are incredibly short staffed which means Pete can't drive his sister and brother home. The rest of the night is riddled with chaos. "Movie Mason" a man who has been at the theater since the begining, believes in the magic of movies. He hold up a line trying to convince two men that the movie they are seeing is a crap film. The popcorn machine goes insane and makes way too much popcorn.Sean MacGibon, Petes boss is freaking out. Theater 23 is out of focus and flickering. Theater 21 is blacking out every few seconds. One theater has its own cyclone. The story of the Phantom of the Megaplex is circling fast. Sean keeps disapering and turning up tied to chairs and doors. The phantom is stricking again and again. Its up to Pete to save the day and win the girl. He slowly is relizing that his brother and sister have been right all along. He needs to have a life, to lighten up, but now is not the time to do it. He has to catch the Phantom before he ruins the premire. While up on the roof looking for a missing blow-up monster. Pete and his sibilings are tied up by the Phantom. While they are working their hardest to free themselves, the Phantom is trapping people in the theater with the blow-up monsters. Freed just in time, Pete goes in with King Arthur's sword and slices the monster open. He then sees the Phantom behind the curtain and goes after him. After a fight, Pete emerges the victor, he reveals the Phantoms face and its SEAN! The owner fires Sean and promotes Pete. Pete turns down the job offer because he relizes that he needs to chill and be a teenager. He wins the girl as does his mothers boyfriend. He proposes and they become a big happy family! ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjc3Yzk0YTgtNTMzMS00ZDg5LTk5NjEtMzg1YjgyODc5NjU0XkEyXkFqcGdeQXVyMTIwMjY0NjQz._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20058",
                "_score": 2.552989,
                "_source": {
                    "title": "Pokémon 3: El hechizo de los unown",
                    "rating": 5.8,
                    "year": 2000,
                    "directors": [
                        "Kunihiko Yuyama"
                    ],
                    "writers": [
                        "Marc M.",
                        "Takeshi Shudo",
                        "Hideki Sonoda"
                    ],
                    "actors": [
                        "Rica Matsumoto",
                        "Veronica Taylor",
                        "Rachael Lillis",
                        "Ikue Ôtani",
                        "Eric Stuart",
                        "Madeleine Blaustein",
                        "Amy Birnbaum",
                        "Dan Green",
                        "Stuart Zagnit",
                        "Lisa Ortiz",
                        "Kathy Pilon",
                        "Peter R. Bird",
                        "Kayzie Rogers",
                        "Ted Lewis",
                        "Rodger Parsons",
                        "Tara Sands",
                        "Lee Quick",
                        "Michael Haigney",
                        "Megumi Hayashibara",
                        "Inuko Inuyama",
                        "Unshô Ishizuka",
                        "Mayumi Izuka",
                        "Ai Katô",
                        "Satomi Kôrogi",
                        "Shin'ichirô Miki",
                        "Chinami Nishimura",
                        "Kôichi Sakaguchi",
                        "Tomokazu Seki",
                        "Yôko Sômi",
                        "Naoto Takenaka",
                        "Masami Toyoshima",
                        "Yûji Ueda",
                        "Akiko Yajima",
                        "Hirohide Yakumaru",
                        "Kôichi Yamadera"
                    ],
                    "genres": [
                        "Animation",
                        "Action",
                        "Adventure",
                        "Family",
                        "Fantasy",
                        "Sci-Fi"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese"
                    ],
                    "runtime": 93,
                    "summary": [
                        "In the town of Greenfield, a young, lonely girl's dreams and wishes are brought into reality by a collective of reality-warping Pokémon.",
                        "Professor Shuri is a scientist looking for rare Pocket Monsters. He reads a storybook to his daughter Mi about the powerful Pokemon Entei. Shuri is currently searching for the heiroglyph Pokemon "Unknown". While searching through some ancient artifacts, Shuri awakens Unknown and is sucked into it. Mi next awakens Unknown while looking for her father. Unknown bonds with her and turns her mansion into a Crystal Tower. The crystallization begins to spread. Unknown lives to serve Mi and creates an Entei with the personality of her father to make her happy. When Mi next desires a mother, Entei kidnaps Satoshi's mother Hanako to give to Mi. Satoshi, Kasumi, Takeshi, and of course Pikachu set out to get her back. —Rocket Dan",
                        "Molly Hale, a young girl living in the town of Greenfield, discovers her father, Professor Spencer Hale, has disappeared whilst investigating the mysterious Pokémon species, the Unown. Upon receiving his findings, Molly's tears summon the Unown, who transporter her father to another direction. They begin bringing her dreams and wishes to reality, summoning Entei, another mythical Pokémon, who takes on the role of Molly's protector and father figure. Her mansion transforms into a giant crystal palace and spreads across the town. Meanwhile, Ash Ketchum, Misty, and Brock arrive in town, joined by Professor Oak and Ash's mother Delia, who has a past with the Hale family. But, things take a personal turn when Entei kidnaps Delia to play the role of Molly's new mother, and Ash and friends must venture into the world of the Unown to save her and Molly. —mrusty5",
                        "When Molly Hale's father goes missing, the strange Pokemon that he was studying come to Molly by the power of the strange little blocks. The Pokemon, the Unown, create Entei to act as Molly's father, and, because of her wish to have a mother too, Entei only goes and kidnaps Delia Ketchum, who just happens to be Ash's mom. So Ash, Misty and Brock go to the Hale mansion to stop these strange events once and for all...before time runs out for life as we know it will. —Eji P. 2K6"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk0NzM3MDY1OV5BMl5BanBnXkFtZTYwNTkwODc5._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20061",
                "_score": 2.552989,
                "_source": {
                    "title": "Hora punta 2",
                    "rating": 6.6,
                    "year": 2001,
                    "directors": [
                        "Brett Ratner"
                    ],
                    "writers": [
                        "Ross LaManna",
                        "Jeff Nathanson"
                    ],
                    "actors": [
                        "Jackie Chan",
                        "Chris Tucker",
                        "John Lone",
                        "Ziyi Zhang",
                        "Roselyn Sanchez",
                        "Alan King",
                        "Harris Yulin",
                        "Kenneth Tsang",
                        "Lisa LoCicero",
                        "Mei Melançon",
                        "Maggie Q",
                        "Patricia Chan",
                        "Gelbert Coloma",
                        "Lucy Lin",
                        "Cindy Lu",
                        "Wing Sang Pang",
                        "Mei Ling Wong",
                        "William Wai-Lun Duen",
                        "Shawn Peretz",
                        "Audrey Quock",
                        "Ernie Reyes Jr.",
                        "Jeremy Piven",
                        "Verena Mei",
                        "Joel McKinnon Miller",
                        "Angela Little",
                        "Julia Schultz",
                        "Saul Rubinek",
                        "Gianni Russo",
                        "James J. Ghang",
                        "Michael Chow",
                        "Teresa Chao Yi Lin",
                        "Tanya Newbould",
                        "Matthew Barry",
                        "James C. Duke",
                        "Elizabeth Anweis",
                        "Jonathan Burleigh Barnthouse",
                        "Melissa Biggs",
                        "Tai Li Bond",
                        "Don Cheadle",
                        "Andy Cheng",
                        "Chucky Currie",
                        "Mitch Ehrecke",
                        "Tom Sean Foley",
                        "Joss Gomez",
                        "Constance Hsu",
                        "Rico Lee Junior",
                        "James Lew",
                        "Roger Lim",
                        "Mars",
                        "Kathryn Melton",
                        "Hyeon-jin Park",
                        "Cynthia Pinot",
                        "Simon Rhee",
                        "Nicholas Rich",
                        "Ivan Shaw",
                        "Lina So",
                        "Reggi Danielle Sweat",
                        "Felicia Tang",
                        "Michael A. Tessiero",
                        "Jodi Thomas",
                        "Juting Tsang",
                        "Natasha Yi"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "Hong Kong",
                    "languages": [
                        "English",
                        "Mandarin",
                        "Cantonese"
                    ],
                    "runtime": 90,
                    "summary": [
                        "Carter and Lee head to Hong Kong for a vacation, but become embroiled in a counterfeit money scam.",
                        "It's vacation time for Det. James Carter and he finds himself alongside Det. Lee in Hong Kong wishing for more excitement. While Carter wants to party and meet the ladies, Lee is out to track down a Triad gang lord who may be responsible for killing two men at the American Embassy. Things get complicated as the pair stumble onto a counterfeiting plot by L.A. crime boss Steven Reign and Triad Ricky Tan, an ex-cop who played a mysterious part in the death of Det. Lee's father. Throw in a power struggle between Tan and the gorgeous but dangerous Hu Li and the boys are soon up to their necks in fist fights and life-threatening situations. A trip back to the U.S. may provide the answers about the bombing, the counterfeiting, and the true allegiance of sexy customs agent Isabella. Then again, it may turn up more excitement than Carter was looking for during his vacation. —Lordship",
                        "Chief Inspector Lee and Detective James Carter are back! But this time they're now in Hong Kong on a vacation. However, soon after they arrive, a bomb explodes in the American Embassy. And Inspector Lee is assigned to the case, which becomes personal when it is discovered that the man behind it is Ricky Tan, Lee's father's former partner. Tan, who played an instrumental role in his father's death, who is now the leader of the Triads, the most deadly gang in all of China. The American and Hong Kong authorities soon get into a fight over the jurisdiction of the case. Lee learns that Ricky Tan will be attending a dinner party on his boat. When confronted, Tan claims that someone is trying to frame him. Tan's underling, Hu Li, appears and shoots Tan, and he falls off the boat. In the chaos, Hu Li escapes into a sewer come emerge in downtown Las Vegas, but Carter and Lee are forced to be sent back to Los Angeles. But later in Las Vegas, at the Red Dragon Casino, Lee has been framed when Ricky Tan faked his death and is now still alive but Hu Li places a small bomb in his mouth, and gags him. But will Carter save him while he's still makes a big commotion and distracts the security forces? —Anthony Pereyra <hypersonic91@yahoo.com>",
                        "In need of a vacation after nearly destroying Los Angeles in Rush Hour (1998), the mismatched duo of investigators--the ace Hong Kong Police Chief Inspector, Lee, and the LAPD Detective, Carter--find themselves neck-deep in trouble after an explosion in the American Embassy. Now, with the murderous Triads being behind it, Lee and Carter must track down the dangerous crime kingpin, Ricky Tan, as the string of clues lead them back to Las Vegas. Can the bulletproof detectives crack this difficult case? —Nick Riganas",
                        "Lee and Carter are back! This time they're in Hong Kong. Carter wants a relaxing vacation but Lee just wants to do police work. At a night club, Lee spots an evil agent named Ricky Tan, who runs an evil gang of counterfeiters, and his partner is a woman who delivers packages containing bombs. Lee and Carter follow these two aboard a boat where their attempted bust really busts, so Lee and Carter fly back to Los Angeles where they meet a woman in the Secret Service who helps them on their mission to find the counterfeiters. Lee and Carter are captured by the bad guys but soon escape into a sewer come emerge in downtown Las Vegas. —Dylan Self <robocoptng986127@aol.com>",
                        "Det. James Carter is on vacation in Hong Kong, but Inspector Lee is too busy doing police work. After an explosion at the American Embassy, Lee attempts to track down the man who may be responsible, Ricky Tan, a Triad gang leader and the former partner of Lee's father, who was also a cop. Obviously, Carter doesn't appreciate being dragged along like that, but what choice does he have? Lee discovers a power struggle among the Triads between Tan and Hu Li. They later find out it has something to do with the death of Lee's father, and a counterfeiting scheme. Lee and Carter go back to Cali, and later Las Vegas, where they discover that everything that's happened goes way beyond an explosion at the Embassy. —Roguemaster83"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BODhlNGJjMWQtZGMyYS00MzJhLWJhZGMtY2NlNDI5Nzg5NTU2XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20063",
                "_score": 2.552989,
                "_source": {
                    "title": "Spy game",
                    "rating": 7,
                    "year": 2001,
                    "directors": [
                        "Tony Scott"
                    ],
                    "writers": [
                        "Michael Frost Beckner",
                        "Michael Frost Beckner",
                        "David Arata"
                    ],
                    "actors": [
                        "Robert Redford",
                        "Brad Pitt",
                        "Catherine McCormack",
                        "Stephen Dillane",
                        "Larry Bryggman",
                        "Marianne Jean-Baptiste",
                        "Matthew Marsh",
                        "Todd Boyce",
                        "Michael Paul Chan",
                        "Garrick Hagon",
                        "Andrew Grainger",
                        "Bill Buell",
                        "Colin Stinton",
                        "Ted Maynard",
                        "Tom Hodgkins",
                        "Rufus Wright",
                        "Demetri Goritsas",
                        "Quinn Collins",
                        "Sam Scudder",
                        "Yann Johnson",
                        "Pat McGrath",
                        "Shane Rimmer",
                        "David Hemmings",
                        "James Aubrey",
                        "In-Sook Chappell",
                        "Benedict Wong",
                        "Ken Leung",
                        "Adrian Pang",
                        "Ho Yi",
                        "David Cheung",
                        "Tony Xu",
                        "Mark Sung",
                        "David Tse",
                        "Logan Wong",
                        "Hon Ping Tang",
                        "Daniel Tse",
                        "Vincent Wang",
                        "Stuart Milligan",
                        "Joseph Chanet",
                        "Eddie Yeoh",
                        "Freddie Joe Farnsworth",
                        "Joerg Stadler",
                        "Zsolt Zágoni",
                        "Balázs Tardy",
                        "Pál Oberfrank",
                        "Géza Schramek",
                        "Imre Csuja",
                        "Melinda Völgyi",
                        "Károly Rékasi",
                        "Kimberly Paige",
                        "Iain Smith",
                        "Gregory Groth",
                        "Peter Linka",
                        "Omid Djalili",
                        "Amidou",
                        "Nabil Massad",
                        "Mohamed Picasso",
                        "Aziz Ait Essahmi",
                        "Moustapha Moulay",
                        "Mohamed Quatib",
                        "Farid Regragui",
                        "Dale Dye",
                        "Tim Briggs",
                        "Frank Nall",
                        "Ian Porter",
                        "Charlotte Rampling",
                        "Ian Boo Khoo",
                        "Gary Bunn",
                        "Anita Deutsch",
                        "James Embree",
                        "Simon Faulkner",
                        "Philip Harvey",
                        "Anne Karam",
                        "Tibor Kenderesi",
                        "Tong Lung",
                        "Andrea Osvárt",
                        "Wil Röttgen",
                        "Alex Sabga-Brady",
                        "Scott Samain",
                        "Chuen Tsou",
                        "Matthew Walker",
                        "Terrance Ottis Williams"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "German",
                        "Arabic",
                        "French",
                        "Cantonese"
                    ],
                    "runtime": 126,
                    "summary": " Set in 1991, the film depicts the U.S. and Chinese Governments on the verge of a major trade agreement, with the American President due to pay a visit to China to seal the deal. The Central Intelligence Agency gets word that their Special Activities Division operative Tom Bishop (Brad Pitt) has been captured trying to free an Englishwoman, Elizabeth Hadley (Catherine McCormack), from a Chinese prison near Su Chou (Suzhou). Bishop is being questioned under torture and will be executed within twenty-four hours unless he is claimed by the U.S. Government, so they scramble to decide what to doif they claim Bishop as an agent, they risk destroying the trade agreement. Exacerbating the situation is the fact that Bishop was operating in a "rogue" capacity without permission from the Agency.In an attempt to quickly deal with the situation, CIA executives call in Nathan Muir (Robert Redford), an aging mid-level case officer on his last day before retirement, and the man who recruited Bishop. Although they tell Muir that they simply need him to act as a "stop gap" to fill in some holes in their background files, the officials are in reality hoping that what he gives them is the smoking gun they need to justify letting Bishop die. Realizing as much, Muir attempts to save Bishop by leaking the story to CNN through a contact in Hong Kong, believing that the CIA will rescue Tom once a public outcry puts pressure on them to do so. Unfortunately for Muir, the tactic only stalls them, as a phone call to the FCC from a high ranking executive results in CNN retracting the story.During the debriefing, referred to above, Muir describes how he recruited Bishop into the MACV-SOG while the latter was an Marine Corps sniper in Vietnam. Muir also discusses their tour of duty in Berlin in 1975. Both sub-plots are given extensive time in the film. Considerable time is also devoted to Muir and Bishop's spy work in Lebanon that culminated to a plot similar to that of the 1985 Beirut car bombing the aftermath of which led to the last time the two saw each other face to face.With his plan quashed, Muir resorts to far more dangerous tactics, secretly creating a forged urgent operational directive from the CIA Director to commence Operation Dinner Out: a daring rescue mission spearheaded by U.S. Navy SEALs which Bishop laid the groundwork for as a 'Plan B' to his own rescue attempt. Using US$282,000 of his life savings and a misappropriated file on Chinese coastline satellite imagery, Muir bribes a Chinese energy official to cut power to the prison for thirty minutes, during which time the SEAL rescue team retrieves Bishop and Hadley.Hadley, who fled the UK after carrying out a bombing of the Chinese Embassy, met Bishop in Lebanon. She was in the Chinese prison after being kidnapped and exchanged for an arrested US diplomat. It was in fact Muir himself who had arranged the kidnapping, believing she could possibly expose Bishop's true identity as a CIA paramilitary operative. After realizing that Hadley was the target of Bishop's daring rescue attempt, Muir finally learns that he greatly underestimated Bishop's feelings for her. It is this guilt which prompts him to part with his life savings in order to save her and Bishop, going against his warning to Bishop years previously in Berlin that he would not go after him if he went "off the reservation."Bishop, who is rescued at the end of the film nearly 15 minutes prior to his scheduled execution, realizes Muir was behind his rescue since the name of the plan to rescue him, "Operation Dinner Out,
                    " was a reference to a birthday gift that Bishop gave Muir while they were in Lebanon. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNjNhOGZkNzktMGU3NC00ODk2LWE4NjctZTliN2JjZTQxZmIxXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20065",
                "_score": 2.552989,
                "_source": {
                    "title": "Yamakasi",
                    "rating": 6.1,
                    "year": 2001,
                    "directors": [
                        "Ariel Zeitoun",
                        "Julien Seri"
                    ],
                    "writers": [
                        "Luc Besson",
                        "Philippe Lyon",
                        "Julien Seri",
                        "Charles Perrière",
                        "Luc Besson"
                    ],
                    "actors": [
                        "Châu Belle Dinh",
                        "Williams Belle",
                        "Malik Diouf",
                        "Yann Hnautra",
                        "Guylain N'Guba-Boyeke",
                        "Charles Perrière",
                        "Laurent Piemontesi",
                        "Maher Kamoun",
                        "Bruno Flender",
                        "Amel Djemel",
                        "Afida Tahri",
                        "Abdelkrim Bahloul",
                        "Nassim Faid",
                        "Pascal Léger",
                        "Frédéric Pellegeay",
                        "Gerald Morales",
                        "Jacques Hansen",
                        "Chloé Flipo",
                        "Perkins",
                        "Jean-Pierre Germain",
                        "David Tissot",
                        "Isabelle Moulin",
                        "Stéphane Boucher",
                        "Christian Dosogne",
                        "Vincent Haquin",
                        "Benoît Fouégué-Dongho",
                        "Nabil Debouze",
                        "Sophian Bouhenni",
                        "Julien Guedes",
                        "Rebecca Hampton",
                        "Liliane Cebrian",
                        "Thomas Jouannet",
                        "Tomasz Bialkowski",
                        "Lucien Theresin",
                        "Jo Prestia",
                        "Bertrand Farge",
                        "Alain Brochery",
                        "Pascal D'Amato",
                        "Yan Dron",
                        "Pierre Medalin",
                        "Laurence Merchet",
                        "Laurentine Milebo",
                        "Lydia Ewandé",
                        "Sophie Gourdin",
                        "Joseph Anticevic",
                        "Christophe Hatey",
                        "François Orsoni",
                        "Pascal Aubert",
                        "François Huin",
                        "Jean-Paul Audrain",
                        "François Breniaux",
                        "Laurence Guillet",
                        "Yannick Le Perff",
                        "Franck Petit",
                        "Denis Braccini",
                        "Franck Guérin",
                        "Jean-François Regazzi",
                        "Nicolas Scellier",
                        "Michel Lamprecht",
                        "Camille Cottin",
                        "Dominique Magloire",
                        "Micheline Dieye",
                        "Valantine Loubli",
                        "Raymonde Fichoux",
                        "Gwenaël Clause",
                        "Catherine Robert",
                        "Anthony Aouzerat",
                        "Raphaël Massart",
                        "Olivier Parthonnaud",
                        "Simran"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Crime"
                    ],
                    "country": "France",
                    "languages": [
                        "French",
                        "Arabic"
                    ],
                    "runtime": 90,
                    "summary": [
                        "7 guys from Paris' suburbs like challenges like climbing tall buildings and doing parkour - especially with cops/flics chasing them. When a kid fan urgently needs a heart the Yamakasis try to find a way.",
                        "Gravity or Police, these guys don't believe in any law. Idolised by the youth of Paris as much as they're hated by the police, they are the Yamakasis, modern samurais. With acrobatic skillfulness and adrenaline pumping belief in their own immortality, they throw themselves out from incredible heights, and jump from roof to roof. Locked doors and "No Trespassing"-signs become irresistible challenges. But one day, whilst mimicking one of the Yamakasi's more dangerous stunts, a young fan gets injured. Only one operation can save the boy, an operation that his family can't afford. —Torben Skov <bobcat3003@msn.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZThjZTFlMmQtOTg5Ni00Yjc3LWE2N2UtMDQ2YTA4MTQ1Y2I0XkEyXkFqcGdeQXVyMzI2ODkyNDg@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20070",
                "_score": 2.552989,
                "_source": {
                    "title": "Avalon",
                    "rating": 6.4,
                    "year": 2001,
                    "directors": [
                        "Mamoru Oshii"
                    ],
                    "writers": [
                        "Kazunori Itô"
                    ],
                    "actors": [
                        "Malgorzata Foremniak",
                        "Wladyslaw Kowalski",
                        "Jerzy Gudejko",
                        "Dariusz Biskupski",
                        "Bartlomiej Swiderski",
                        "Katarzyna Bargielowska",
                        "Alicja Sapryk",
                        "Michal Breitenwald",
                        "Zuzanna Kasz",
                        "Adam Szyszkowski",
                        "Krzysztof Plewako-Szczerbinski",
                        "Marek Stawinski",
                        "Jaroslaw Budnik",
                        "Andrzej Debski",
                        "Elzbieta Towarnicka",
                        "Zdzislaw Szymborski"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Fantasy",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Polish"
                    ],
                    "runtime": 107,
                    "summary": [
                        "In a dystopian world, a woman spends her time playing an illegal and dangerous game, hoping to find meaning in her world.",
                        "In a future world, young people are increasingly becoming addicted to an illegal (and potentially deadly) battle simulation game called Avalon. When Ash, a star player, hears of rumors that a more advanced level of the game exists somewhere, she gives up her loner ways and joins a gang of explorers. Even if she finds the gateway to the next level, will she ever be able to come back to reality? —Jean-Marc Rocher <rocher@fiberbit.net>",
                        "Gloomy portrayal of the near future in an imaginary town in Central Europe, shot in Poland (Polish is also spoken). The town is dirty and chaotic. Computer games have lost their innocence: they are addictive and large sums of money can be won. Ash lives alone. She doesn't have any contact with other people, only with her dog. Her only activities are cooking meals for the dog and playing games. She is a professional Avalon super warrior, a player on the top-level, that is only accessible under very specific conditions. Once a player is inside, they can only stop by winning the game. Otherwise the player can die. Ash ignores all warnings and decides to play anyway. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMmVhNDdkMjAtODMyMS00Y2JhLWJmZWYtZDZjYjY3N2NhODY1XkEyXkFqcGdeQXVyMzg2MzE2OTE@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20077",
                "_score": 2.552989,
                "_source": {
                    "title": "Jigar",
                    "rating": 5.1,
                    "year": 1992,
                    "directors": [
                        "Farogh Siddique"
                    ],
                    "writers": [
                        "Veeru Devgan",
                        "Tanveer Khan",
                        "Lalit Mahajan",
                        "Naeem-Ejaz",
                        "Farogh Siddique"
                    ],
                    "actors": [
                        "Ajay Devgn",
                        "Karisma Kapoor",
                        "Ajit Khan",
                        "Feroz Khan",
                        "Gulshan Grover",
                        "Aruna Irani",
                        "Paresh Rawal",
                        "Ishrat Ali",
                        "Vikas Anand",
                        "Salim Khan Ding-Dong",
                        "Jamuna",
                        "Goga Kapoor",
                        "Akram Khan",
                        "Hussain Khan",
                        "Shashi Kiran",
                        "Sukanya Kulkarni",
                        "Madhavi",
                        "Yunus Parvez",
                        "Asha Sharma",
                        "Cheetah Yajnesh Shetty",
                        "Gurbachan Singh",
                        "Sudhir",
                        "Brijesh Tiwari",
                        "Kedarnath Saigal"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Romance",
                        "Sport"
                    ],
                    "country": "India",
                    "languages": [
                        "Hindi"
                    ],
                    "runtime": 161,
                    "summary": [
                        "An engaging action-sport film, where a man avenges his sister's humiliation by participating in a deadly kung-fu tournament.",
                        "Simpleton Raj Verma alias Raju return home one day to find that his sister is publicly raped by gangster Beharry and one of his wrestlers also Raj's childhood friend Duryodhan. When Raj intervene he is beaten, publicly humiliated and left for dead, and then he is taken to the hospital and survive by a miracle. After recovery Raj swears to take revenge on Duryodhan and Beharry and is trained to become an expert wrestler by a man named Baba Thakur. But the question remains will Raj be able to cope with these trainings and if he does will he be able to take on Duryodhan who is already an expert in this field? —gavin (racktoo@hotmail.com)"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BN2E0NjBlZDYtM2Q4Ni00ZTM2LWFiZDMtMmNhOTM2NjdhNDk5XkEyXkFqcGdeQXVyNjUxNTE5OTY@._V1_SY150_CR24,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20080",
                "_score": 2.552989,
                "_source": {
                    "title": "Después del muro",
                    "rating": 5,
                    "year": 2001,
                    "directors": [
                        "Anthony Hickox"
                    ],
                    "writers": [
                        "Robert Syd Hopkins",
                        "Anthony Hickox"
                    ],
                    "actors": [
                        "Armand Assante",
                        "Corey Johnson",
                        "Barna Illyés",
                        "Anthony Hickox",
                        "Annabel Brooks",
                        "Viki Kiss",
                        "Edit Illés",
                        "Sándor Téri",
                        "Martin McDougall",
                        "Niki Barabás",
                        "Norman Austin",
                        "David Foxxe",
                        "Ralph Brown",
                        "Ornella Muti",
                        "Jürgen Prochnow",
                        "Aleksandra Vujcic",
                        "Dávid Vermes",
                        "Teri Tordai",
                        "Bernadett Tóth",
                        "Lukács Bicskey",
                        "Tamás Presits",
                        "Imre Kamondi",
                        "Levente Kárpáti",
                        "Lajos Szücs",
                        "Tamás Varga",
                        "Michael G. Wojciechowski",
                        "Annamária Gyimes",
                        "Marco Assante",
                        "Nikolett Barabas",
                        "Nino Neuboeck",
                        "Ken Shane"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 98,
                    "summary": [
                        "Frank Banner used to specialize in helping Soviet spies defect safely to the West. Banner's wife was shot to death aiding such an escape. Now, with the Cold War over, Banner is called upon to safely escort an ex-K.G.B. man who is wanted dead by both the CIA and the Russian Mafia. —Ken Miller <wkmiller704@yahoo.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGQ4MTIzMDktYjFiOS00MmY4LWI1MjQtYzMyN2Q4ZGJjMDA1XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20083",
                "_score": 2.552989,
                "_source": {
                    "title": "El único",
                    "rating": 5.9,
                    "year": 2001,
                    "directors": [
                        "James Wong"
                    ],
                    "writers": [
                        "Glen Morgan",
                        "James Wong"
                    ],
                    "actors": [
                        "Jet Li",
                        "Carla Gugino",
                        "Delroy Lindo",
                        "Jason Statham",
                        "James Morrison",
                        "Dylan Bruno",
                        "Richard Steinmetz",
                        "Steve Rankin",
                        "Tucker Smallwood",
                        "Harriet Sansom Harris",
                        "David Keats",
                        "Dean Norris",
                        "Ron Zimmerman",
                        "Darin Morgan",
                        "Mark Borchardt",
                        "Joel Stoffer",
                        "Ashlyn Gere",
                        "Denney Pierce",
                        "Boots Southerland",
                        "Archie Kao",
                        "Ken Kerman",
                        "Kevin Indio Copeland",
                        "Marco Verdier",
                        "Teddy Lane Jr.",
                        "Narinder Samra",
                        "Clement Blake",
                        "Bill Dunnam",
                        "Edward James Gage",
                        "B.T. Taylor",
                        "Thanh T. Tran",
                        "Peter McKernan",
                        "Alan D. Purwin",
                        "Matt Birman",
                        "Greg Bronson",
                        "George W. Bush",
                        "Ronald Gamble",
                        "Darrell Geer",
                        "Al Gore",
                        "Ramsey Luke",
                        "Karl J. Martin",
                        "Cynthia Pinot",
                        "Doug Savant",
                        "Scott L. Schwartz",
                        "Michael Sercerchi"
                    ],
                    "genres": [
                        "Action",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 87,
                    "summary": [
                        "A rogue Multiverse agent goes on a manhunt for alternate versions of himself, getting stronger with each kill. Only the last version of himself, an LASD cop, can stop his crusade before he becomes "The One".",
                        "There is not one universe, but there are many, which is a multiverse. Supposing you are just one person, there are many other versions of you in the other universes, there are ways to travel, but only a police agency, MVA, can travel only for police procedures. Gabriel Yulaw is a former MVA agent, who killed another version of himself in self-defense. It made the other versions of him stronger. When Yulaw found out about this, he became power-hungry killing the 122 other versions for two years. After killing Lawless and getting captured by his former partner Roedecker and a new MVA agent Funsch, Yulaw managed to escape the prison and is trying to kill his last target, Gabe Law who is a police officer. He is also at Yulaw's strength. Roedecker and Funsch now have to arrest Yulaw before he can kill Gabe. There is a possibility that the universe could die or make Yulaw invincible. After encountering Yulaw for the first time, Gabe thought that it was his split personality, but it wasn't. Will Gabe be able to confront Yulaw before or after Yulaw ruins his life? —Zero 88",
                        "In a dual role, Jet Li portrays Gabriel Yulaw, a police officer confronted with a sinister form of himself escaped from an advanced, parallel universe and intent on killing Gabriel. His alter ego's hunt culminates in a fateful battle between good and evil that changes Gabriel's perception of reality and forces him to examine the evil hidden within himself.",
                        "What if there is more than one universe and that all of these universes are held together by one single stream of energy. That energy is equally distributed to every living being in each universe and if one of these beings die, that energy is reallocated equally to each other surviving member. With each allocation, a person becomes stronger. Now one universe has mastered the ability of crossing into another universe and a man named Yulaw who believes that, if he can kill all of his counterparts, he will become invincible. But there are those who believe that it might have detrimental effects, so begins the manhunt for the most dangerous villain in the multiverse. Unfortunately, he just has one more person to kill, Gabe Law. Otherworldly police officers follow Yulaw but the madman has committed some unthinkable crimes, leaving Gabe accused and wanted. But Gabe discovers that he has changed, only wanting to kill Yulaw; unaware of what could happen. —rcs0411@yahoo.com"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzY4YmUzMDAtMDYyZS00MTBmLWEzZDAtOGY3MDE2YjJkMGUxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20096",
                "_score": 2.552989,
                "_source": {
                    "title": "Jimmy Neutron: El niño inventor",
                    "rating": 6,
                    "year": 2001,
                    "directors": [
                        "John A. Davis"
                    ],
                    "writers": [
                        "John A. Davis",
                        "David N. Weiss",
                        "J. David Stem",
                        "Steve Oedekerk",
                        "John A. Davis",
                        "Steve Oedekerk",
                        "John A. Davis",
                        "Danelle Hand"
                    ],
                    "actors": [
                        "Megan Cavanagh",
                        "Mark DeCarlo",
                        "Debi Derryberry",
                        "Jeffrey Garcia",
                        "Bob Goen",
                        "Mary Hart",
                        "Carolyn Lawrence",
                        "Andrea Martin",
                        "Candi Milo",
                        "Rob Paulsen",
                        "Crystal Scales",
                        "Martin Short",
                        "Patrick Stewart",
                        "Jim Cummings",
                        "David L. Lander",
                        "Kimberly Brooks",
                        "Paul Greenberg",
                        "Laraine Newman",
                        "Jeannie Elias",
                        "Michael Hagiwara",
                        "John A. Davis",
                        "Keith Alcorn",
                        "Richard Allen",
                        "Brian Capshaw",
                        "Cheryl Ray",
                        "Mark Menza",
                        "Frank Welker",
                        "Billy West",
                        "Matthew Russell",
                        "Carlos Alazraqui",
                        "Dee Bradley Baker",
                        "Jack Angel",
                        "Mary Kay Bergman",
                        "Rodger Bumpass",
                        "Toran Caudell",
                        "Greg Eagles",
                        "Bill Farmer",
                        "Peggy Flood",
                        "Mona Marshall",
                        "Mickie McGowan",
                        "Phil Proctor",
                        "Bill Striglos",
                        "Hynden Walch"
                    ],
                    "genres": [
                        "Animation",
                        "Action",
                        "Adventure",
                        "Comedy",
                        "Family",
                        "Sci-Fi"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 82,
                    "summary": " James Isaac "Jim" Neutron is a young 10-year-old sixth grade schoolboy inventor who has super boy-genius intelligent powers, he has a pet homemade cyber-dog, lives in the Texas town of Retroville and loves making homemade inventions, robots, gadgets, science tech and rube-Goldberg machines and wishes he never had parents. Jimmy's best friends are overweight clumsy Carlton Ulysses "Carl" Wheezer and Mexican superhero-obsessed Ramon Guevera "Sheen" Estevez. Jimmy also has a rivalry with his intelligent classmate Cyndthia Aura "Cindy" Vortex, who teases, insults, hates and picks on him for his short stature. The film starts off with a rocket carrying two boys and a robotic dog: Jimmy Neutron, Carl Wheezer and Goddard The Dog. Jimmy is attempting to launch a homemade communications satellite made out of a kitchen toaster, hoping to communicate with an alien species he believes exists somewhere out in the universe after getting a message from space. despite his parents, Mr Hugh Beaumont Neutron and Mrs Judith "Judy" Neutron's protest in talking to strangers and playing with rockets. Unknown to anyone, the satellite is picked up and intercepted near the Planet Yolkus, home to an alien race of dark evil alien egg-like slime monsters from outer space called the Yolkian Eggpire. the Yolkian king leader, King Goobot V, and his Yolkian younger brother, assistant helper, trusty sidekick and butler minion, Ooblar, watch a pre-recorded message from Jimmy, featuring him introducing himself and explaining about life on Earth.Jimmy, Carl, and their friend Sheen spot a poster for a the opening night party of a futuristic sci-fi-styled amusement park funfair called "Retroland Theme Park." However, Jimmy's parents refuse to let him go that night because it is a school night, and as a result, Jimmy is grounded and forced to go his room to think about what he has done wrong after accidentally causing a fire on a curtain with one of his his homemade jet-pack inventions. Jimmy, Carl and Sheen subsequently choose to sneak out and visit the park advised by Nicholas "Nick" Dean, a cool and charmingly handsome popular kid. they all have a their time of their lives and a huge night of fun.As the three are at the park, the Yolkian Eggpire set a course for Planet Earth, where all arrive, they kidnap and abduct all the adults in the city, leaving fake notes on the refrigerators to tell the kids that they have gone to Florida for an "extended vacation". Coincidentally, Carl spots a shooting star (actually a Yolkian ship that they mistaken for a star), so he, Jimmy and Sheen wish for no more parents so they can have fun all the time. The next morning, the kids discover that the parents have all disappeared. they all have a day of running around doing wrong things and have a huge party celebration. but the next day they feel sick, sad and lonely, and realise they need their parents and that things aren't so great without them. After hearing a message from his parents that Goddard had recorded while posing as Jimmy last night, Jimmy becomes suspicious of the fact that his parents said that they would see him in the morning despite not being there. He soon discovers what has really happened.Jimmy organizes the other children in town to build homemade spaceship rockets from the Retroland rides that they tear apart to travel to Yolkus and get their families back. after narrowly surviving a giant meteorite shower and camping on an asteroid, eventually they reach Yolkus and are captured by Goobot, who tells them that the parents are possessed and hypnotised by hypno-mind-control devices on their heads and are to be sacrificed to their Yolkian Goddess of Wrath and the biggest and most deadly creature in the galaxy, Lord Poultra. He shows the kids Jimmy's video, thanking him for helping him find suitable species for their ritual, before having the children locked up in their prison dungeon cells.With Jimmy feeling guilty over the fact that his actions led to the Yolkans abducting the parents in the first place, his rival/love interest Cindy Vortex convinces him to stand up and think of an escape plan by confessing that they really need him. Jimmy manages to contact Goddard using a cellphone belonging to Cindy's best friend Libby Folfax. After breaking out with the help of Goddard, the children find their parents in a huge Colosseum where a giant egg is hatched, releasing Poultra, revealed to be a giant alien chicken monster. Jimmy and the kids (with the exception of Nick, as he turns out not so brave), in accordance with Jimmy's plan, manage to stop the parents from being sacrificed to Poultra and foil the Yolkians' plan by battling the Yolkian guard army and stealing the hypno-remote control.Everyone escapes aboard a Yolkian escape vessel that Sheen steals from the Yolkians and knocks Poultra out cold, but Goobot follows them in his ship at the head of the giant Yolkian fleet army. With the exception of Goobot's ship, all of the Yolkian ships are destroyed when Jimmy baits them into flying too close to Yolkus' sun. Jimmy and Goddard then use an experimental homemade shrink ray gun to grow to the size of a giant planet, and blow Goobot's ship into an asteroid: Goobot and Ooblar survive the explosion, but Goobot declares that they have not seen the last of him and vows revenge. Jimmy reconciles with his parents for not understanding strangers, as all the other kids reunite with theirs, and they make it on their way back home. and Jimmy admits that despite his intelligence, he still depends on them. Cindy and Jimmy decide that Cindy should continue to insult him, Jimmy decides never to say to anyone that Cindy was nice to him and Cindy decides not to call him "short". the Neutrons get home in time for dinner.In a final scene of the film, Jimmy and Carl have breakfast at a sleepover, during which Jimmy's parents drink one of his homemade burp soda formula experiments (that causes significant belching), thinking it is real soda and they all laugh out loud and keep burping 'til the credits roll. In the post credits scene, Miss Winfred Fowl, the schoolteacher, is shown taming a worm when having been shrunk by Jimmy's shrink ray prior to the film and the film ends. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzczYzM4MmMtMTEyYi00ZGRmLWE2OTMtZmNhYTdiYjQ4NDUxXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20102",
                "_score": 2.552989,
                "_source": {
                    "title": "La máquina del tiempo",
                    "rating": 5.9,
                    "year": 2002,
                    "directors": [
                        "Simon Wells"
                    ],
                    "writers": [
                        "H.G. Wells",
                        "David Duncan",
                        "John Logan"
                    ],
                    "actors": [
                        "Guy Pearce",
                        "Mark Addy",
                        "Phyllida Law",
                        "Sienna Guillory",
                        "Laura Kirk",
                        "Josh Stamberg",
                        "John W. Momrow",
                        "Max Baker",
                        "Jeffrey M. Meyer",
                        "Jeremy Irons",
                        "Alan Young",
                        "Myndy Crist",
                        "Connie Ray",
                        "Orlando Jones",
                        "Lennie Loftin",
                        "Thomas Corey Robinson",
                        "Samantha Mumba",
                        "Omero Mumba",
                        "Yancey Arias",
                        "Richard Cetrone",
                        "Edward Conna",
                        "Chris Sayour",
                        "Jeremy Fitzgerald",
                        "Darrell Davis",
                        "Grady Holder",
                        "Bryan Friday",
                        "Clint Lilley",
                        "Mark Kubr",
                        "Jeff Podgurski",
                        "Dan McCann",
                        "Bryon Weiss",
                        "Steve Upton",
                        "Doug Jones",
                        "Joey Anaya",
                        "Jacob Chambers",
                        "Dorian Kingi",
                        "Kevin McTurk",
                        "Michael Chaturantabut",
                        "Jonathan Eusebio",
                        "Roel Failma",
                        "Yoshio Iizuka",
                        "Diana Lee Inosanto",
                        "Chona Jason",
                        "Hiro Koda",
                        "John Koyama",
                        "Alex Madison",
                        "R.C. Ormond",
                        "Bro Richmond",
                        "Petra Sprecher",
                        "Gary Toy",
                        "Jon Valera",
                        "Brian Dongelewic",
                        "Jane Bordeaux",
                        "Katrin Butt",
                        "April Crisafulli",
                        "Bill Di Paolo",
                        "Orlando Estrada",
                        "Aaron Patrick Freeman",
                        "Cheyenne Haynes",
                        "Andy Maycock",
                        "Caleb Mayo",
                        "David O'Leary",
                        "Paul Oliver",
                        "Efia Pearson",
                        "Roman Phillips",
                        "Dana Schick",
                        "Danny Swerdlow",
                        "Vanessa Viola",
                        "Meredith Wells",
                        "James Henry Williams Jr."
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Sci-Fi"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 96,
                    "summary": " Alex Hartdegen is a scientist living at 1899 in New York City. Obsessed with the idea of time travel, he teaches at Columbia University as a professor of "Applied Mechanics and Engineering" and gets into trouble for his radical theories. He is a pen pal of Albert Einstein. As he goes to the park to meet his girlfriend Emma, he becomes distracted by an early motor car beside the park gates. He puts himself in immediate good graces with the driver who, while refueling, forgot to activate the parking brake something Alexander does quickly when it threatens get out of control.Forgetting the flowers, he meets Emma at the skating rink; they walk through the park where Alexander proposes to Emma. However, the romantic moment is short-lived: a robber emerges from nearby bushes and holds a gun on them. As the thug attempts to take Emma's engagement ring, Alexander tries to intervene; during the struggle, the gun goes off and Emma is fatally wounded, dying in Alexander's arms. For the next four years, Alexander spends every waking hour in his laboratory working on his time travel calculations. Eventually, he succeeds in building a working time machine.His self-imposed exile has led to him being ostracized from his oldest friend David Philby, who eventually arrives at the lab to confront Alexander who in turn flies into a rage. Philby invites Alexander to dinner in the hope it would cause him to leave the lab and eventually return to a normal life, but Alexander postpones the dinner until the following week; after Philby has left Alexander remarks that in a week they "wouldn't have had this conversation".With the time machine finished, he travels back to that night four years ago and intercepts Emma before she was destined to meet his 1899 counterpart. Escorting her away from the park, they walk back to her apartment where he leaves her out in the street to purchase some flowers. However, despite Alexander having removed her from the danger of the robber, Emma is knocked down and trampled by a horse and carriage outside. The horses were spooked by the early motor car.Alexander realizes bitterly that if he prevents one means of Emma's death, another will take its place. Disenchanted with the prospect, he decides to go forward in time to find out if there are any answers in the future.[edit] The time travel Alexander stops in 2030 and learns that the Moon is being prepared for colonization. He visits the New York Public Library where he talks with Vox 114, the library's holographic, artificially intelligent librarian. He is given information on H. G. Wells, Isaac Asimov, Harlan Ellison and even one of his own papers, but the library does not have any information on time travel theory; Vox states that such a thing is impossible.Frustrated, Alexander asks about the time machine itself and is given information on H.G. Wells' novel. Finding nothing of use, Alexander moves on to the future, until he hits a 'bump' seven years later in 2037, where he finds that the Moon mining operation has disrupted the lunar orbit. As a result, the Moon is breaking apart and showering Earth with massive chunks of rock. His presence outside of a shelter leads to an attempt by two military personnel to arrest him, but he escapes. He makes it into the machine just as the city is being destroyed, but is knocked unconscious and fails to witness the destruction of civilization. Alexander and his time machine speed through hundreds of millennia.Regaining consciousness, Alexander brings the machine to a halt in 802,701 AD, and finds that civilization has devolved to a hunter-gatherer lifestyle. Calling themselves the Eloi, these survivors have built their homes into the side of a cliff on what resembles Manhattan. Alexander begins to develop a relationship with a woman named Mara, a teacher, and one of few who recall some of the Time Traveler's now obsolete language. He also realizes the Moon is now broken in pieces.As Alexander is introduced to Eloi society, he is shown a collection of stone fragments and signs from what was once New York, including a sign from Tiffany and Co, the Empire State Building and a section of tiled panels from Brooklyn Bridge-City Hall Subway Station.While Alex is inspecting the machine after seeing an Eloi memorial for their parents, Mara tells him to go back to his own time and take her younger brother Kalen with him. Suddenly, the Eloi are attacked by Morlocks, monstrous, pale, ape-like creatures that hunt the Eloi for food. The Morlocks capture Mara and carry her off. Trying to find out where she has been taken, Alexander is told that "the Ghost" might know. As it turns out, the Eloi are speaking about Vox 114, the holographic librarian that Alexander had talked to before the destruction of the Moon, who is still functioning after all these years.With Vox 114's help, Alexander finds a way into the underground realm of the Morlocks, but is captured and taken to an underground chamber where Mara is kept in a cage, and where the Morlocks' leader, the Über-Morlock (played by Jeremy Irons), is waiting. The Über-Morlock reveals that they have a caste-like society, with each caste (nearly a different species in itself) fulfilling a different role in Morlock society. The ruling caste of this society are super-intelligent telepaths, while the hunters that Alex has encountered so far were bred to be predators. Attempting to explain his actions, the Über-Morlock reasons that he and his people are not evil. He asks "Who are you to question eight hundred thousand years... of evolution?" He also indicates that there are other clans similar to him.The Über-Morlock then reveals the reason why Alexander cannot alter Emma's fate: he is caught in a temporal paradox. Since Emma's death was the prime factor that drove him to build the time machine, he cannot use the machine without her death being incorporated into the timeline, as otherwise he would have had no reason to build the machine in the first place. The Über-Morlock also states that the Morlocks would not exist without those like Alexander in their quest for science and technology.Alexander learns that the Morlocks were people who chose to stay underground after the Moon collapsed and the Eloi were those who chose to brave the fallout. His time machine has been found by the Morlocks and taken underground. To escape, Alexander jumps into the machine and sends it hurtling forward in time, taking the Über-Morlock with him. The two of them fight until Alexander pushes him outside of the time sphere. He watches as the Über-Morlock ages and dies outside of the time bubble.Alexander slows the machine as the sky appears overhead. He has traveled to the year 635,427,810 AD, and the landscape is now a desolate wasteland, completely dominated by the Morlocks.Finally accepting that he can never save Emma, Alexander travels back in time to rescue the trapped Mara. After setting her free and before escaping, he sets the time machine to travel to the future and uses his pocket watch to jam the controls, causing it to malfunction and explode, creating a time distortion stream. Alexander and Mara escape just as the explosion kills off the Morlocks.Trapped in the future, Alexander resolves to build a new life for himself with Mara. He begins to rebuild civilization, Vox telling the Eloi the stories in his memory. This closing scene is shown side by side with a sequence in the year 1903, where David Philby chats with Alexander's elderly housekeeper, Mrs. Watchit, before leaving and throwing away his bowler hat on the street. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTM4YTViNGMtYTYyOS00MTViLWEyYTgtNGM0OTIwMWRmYzdhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20108",
                "_score": 2.552989,
                "_source": {
                    "title": "Las lágrimas del tigre negro",
                    "rating": 6.9,
                    "year": 2000,
                    "directors": [
                        "Wisit Sasanatieng"
                    ],
                    "writers": [
                        "Wisit Sasanatieng"
                    ],
                    "actors": [
                        "Chartchai Ngamsan",
                        "Suwinit Panjamawat",
                        "Stella Malucchi",
                        "Supakorn Kitsuwon",
                        "Arawat Ruangvuth",
                        "Sombat Metanee",
                        "Pairoj Jaisingha",
                        "Naiyana Shewanan",
                        "Kanchit Kwanpracha",
                        "Chamloen Sridang",
                        "Nicole Dionne",
                        "Philip Hersh",
                        "Ray Quiroga"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Romance",
                        "Western"
                    ],
                    "country": "Thailand",
                    "languages": [
                        "Thai"
                    ],
                    "runtime": 110,
                    "summary": " During World War 2 a boy from the poor side of town, Seua Dum (Chartchai Ngamsan) and young rich girl Rumpoey (Stella Malucchi) fall in love but because of their family class differences can never truly bond. After ten years pass and the fire of affection kept aglow in each of the lovers hearts they meet again and discover that their love has grown and they decide to marry. However their happiness is doomed due to the disapproval of their parents and the additional terror that the local Bandit Mahesuan (Supakorn Kitsuwon) and his band of criminal followers present. In the ten years since he was a young boy Dum has developed his reputation as a hard-nosed gunslinger known as Black Tiger and is feared by many all for his fast draw. When Rumpoeys father promises his daughters hand in marriage to his star soldier Kumjorn (Arawat Ruangvuth), the arranged wedding takes on a heavy significance for the solemn Rumpoey. Dum and Kumjorn, enemies due to their class positions, both realize that they are in love with Rumpoey, and the confrontation between the two men ends in a fiery emotion-filled battle. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMjIzNzU3NF5BMl5BanBnXkFtZTcwOTQxNDMzMQ@@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20112",
                "_score": 2.552989,
                "_source": {
                    "title": "The Hunted",
                    "rating": 6,
                    "year": 2003,
                    "directors": [
                        "William Friedkin"
                    ],
                    "writers": [
                        "David Griffiths",
                        "Peter Griffiths",
                        "Art Monterastelli"
                    ],
                    "actors": [
                        "Tommy Lee Jones",
                        "Benicio Del Toro",
                        "Connie Nielsen",
                        "Leslie Stefanson",
                        "John Finn",
                        "José Zúñiga",
                        "Ron Canada",
                        "Mark Pellegrino",
                        "Jenna Boyd",
                        "Aaron DeCone",
                        "Carrick O'Quinn",
                        "Lonny Chapman",
                        "Rex Linn",
                        "Eddie Velez",
                        "Alexander MacKenzie",
                        "Hank Cartwright",
                        "Gary Taylor",
                        "Michael Williamson",
                        "Alisha Garric",
                        "Robert Thomas Preston",
                        "Nathan Sabatka",
                        "Jeff Gianola",
                        "Brent Braun",
                        "Steve Enfield",
                        "Mike White",
                        "Mio R. Jakula",
                        "Neno Pervan",
                        "Zoran Radanovich",
                        "Caitlin Marie Clements",
                        "Ayanna Berkshire",
                        "Robert Blanche",
                        "Johnny Cash",
                        "William Joseph Elk III",
                        "Den Erickson",
                        "Anjenique Hughes",
                        "John Keyser",
                        "Michelle Kinne",
                        "Christopher Mead",
                        "Erin Michael",
                        "Zamin Mirza",
                        "Katie O'Grady",
                        "Peter Simpson",
                        "Devon Walker",
                        "Tara Walker",
                        "Evis Xheneti"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Serbo-Croatian"
                    ],
                    "runtime": 94,
                    "summary": " In 1999, in Kosovo, all hell is breaking loose, and brutal Serbian soldiers are in the process of destroying an Albanian village. Sergeant 1st Class Aaron Hallam (Benicio Del Toro) is a very skilled soldier/government operative who sneaks into an enemy building, and kills a Serbian commander (Mio Drag Jakula).Now, a few years later, in snowy British Columbia, a province in Canada, L. T. Bonham (Tommy Lee Jones) is working for the World Wildlife Fund. Bonham treats a wolf that was injured by a trap, and then he finds the man (David S. Case) who set the trap, and he slams the guy's face into a table.In the woods of Silver Falls, Oregon, two hunters with high-tech scope rifles are wandering through the forest, hunting deer. Hallam is hunting the two men.Basically, he's first playing with them (talking to them, taunting them, with them having no clue where he is), then he slowly kills them, and dismembers them.Government officials urge Bonham to come to Oregon and use his expert tracking skills to help them find Hallam, who has PTSD from his service in Kosovo. Reluctantly, Bonham accepts. In Silver Falls, Bonham meets FBI agent Abby Durrell (Connie Nielsen), who is one of the investigators.Bonham goes into the forest, and finds Hallam. The two fight, and seem to be of equal skill, but Abby and the other agents, who secretly followed Bonham, tranquilize Hallam. While Hallam is in custody in Portland, Oregon, Bonham tells Abby who Hallam is.Dale Hewitt (Mark Pellegrino) and his partner Stokes (Aaron Brounstein), two men who work for the Department of Defense, show up with a letter saying that Hallam is to be handed over to the Department of Defense, and Dale and Stokes are not giving out much information to the police.It's explained that Hallam is a highly-trained assassin whose PTSD from Kosovo has turned him into a killing machine who enjoys killing people, no matter whether his superiors consider them "good" or "bad."Hallam and Bonham also know each other -- while Bonham, unlike Hallam, has never been in the military, Bonham was employed by the Army to train people how to kill, and he trained Hallam quite well.Bonham, however, left that life behind and went to British Columbia to work for the World Wildlife Fund. All the letters to Tommy, where Hallam mourned the loss of his sanity, went unanswered. Hallam felt that Bonham was almost like a father to him.Dale and Stokes load Hallam into an Army transporter, and drive him away. On the road, they more or less explain to Hallam that they're going to kill him.Hallam expresses discontent with that plan, and kills Dale and Stokes, and also the driver, who -- because he was shot in the head -- crashes the transporter.Hallam escapes. Hallam pays a visit to his ex-girlfriend Irene Kravitz (Leslie Stefanson), who never really understood what exactly he was doing. Hallam gives Irene tons of money, tells Irene that she and her 7-year-old daughter Loretta (Jenna Boyd) are in danger, and urges them to leave the house.Bonham, who was on his way back to British Columbia, believing that his mission was done, hears about Hallam's escape and heads back to Portland, Oregon. Abby tells Bonham about Irene, and they go to Irene's house. They find Hallam there, but he escapes by jumping out of a window and then driving away with Irene's car.A few minutes and many car crashes later, Hallam escapes on foot at a construction site, with Bonham, Abby, and the police on his trail.They chase Hallam into the sewers, where, one by one, Hallam starts killing cops and FBI agents. Bonham chases Hallam up to the street, and runs after Hallam.The chase includes a bike, and the metro express. Hallam climbs onto the top of a high bridge pillar, and jumps down into the river. No one spots him as he swims with the current.Bonham uses his tracking skills along the river as he tries to find Hallam. Along the way, Bonham creates a sharp knife out of a rock. At the same time, Hallam -- hiding somewhere near the river -- makes a cozy bonfire and forges a knife out of some stray metal that someone left behind.Bonham finds Hallam. They fight with their knives, and they cut each other up. Hallam cuts Bonham up numerous times. Bonham manages to stab Hallam in the chest, just as Abby and her agents arrive. Hallam collapses, and passes away.Later, back in British Columbia, Bonham is in his cabin, burning all the letters that Hallam wrote to him. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTI0MjI4ODg2NV5BMl5BanBnXkFtZTcwMzI0NjgyMQ@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20137",
                "_score": 2.552989,
                "_source": {
                    "title": "Cyber Wars",
                    "rating": 4.4,
                    "year": 2004,
                    "directors": [
                        "Jian Hong Kuo"
                    ],
                    "writers": [
                        "Christopher Hatton"
                    ],
                    "actors": [
                        "Genevieve O'Reilly",
                        "Luoyong Wang",
                        "Kay Siu Lim",
                        "David Warner",
                        "Joan Chen",
                        "Michael De Mesa",
                        "Henry O",
                        "Remesh Panicker",
                        "William Sanderson",
                        "T. Sasitharan",
                        "Kumar",
                        "Ferdaus Bin Ahmad",
                        "Lennard Chan",
                        "Gerald Chew",
                        "Hwee Chin Chiam",
                        "Richard Chua",
                        "Robin Atkin Downes",
                        "Lay Kuan Goh",
                        "Pierre Goh",
                        "Adam Golomb",
                        "Marjorie Ho",
                        "Jerry Hoh",
                        "Sharon Ismail",
                        "Ray Lee",
                        "Casey Lim",
                        "Lydia Look",
                        "Seng Onn Loong",
                        "Kee Hong Low",
                        "Richard Low",
                        "Bonnie Sta Maria",
                        "Marcus Mok",
                        "Kevin Murphy",
                        "Swee Lin Neo",
                        "Wei Min Ng",
                        "Abdul Rahman",
                        "Rajan Ramchandani",
                        "Lyle Schwarz",
                        "Dwayne Tan",
                        "William Tan",
                        "Fu Kuen Tang",
                        "Kate Wilson",
                        "Allan Wong",
                        "Claire Wong",
                        "Godfrey Yeo"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "Singapore",
                    "languages": [
                        "English"
                    ],
                    "runtime": 103,
                    "summary": [
                        "In a future Singapore, CyberLink is used for communication (sometimes virtual reality), monetary transaction and records of all citizens. Headhunter Dash is commissioned to find Edward Chan. Why are so many interested in him?",
                        "In the near future in the Asian city-state Sintawan, everyone's identity is recorded in the vast CyberLink. The only way around this is using illegal simulated identity implants (sims). A young bounty hunter who makes her living tracking sims, finds herself the unlikely ally of a police detective who suspects the CyberLink is being perverted for an insidious and deadly purpose. —Jon Reeves <jreeves@imdb.com> from press release",
                        "In the early 21st Century, society is connected through the Cyberlink. All communication and monetary transactions occur within its sphere. The Cyberlink records the identities of all legalized citizens. Simplants provide criminal with alternative identities. Ident police and private headhunters track them down. In Entropolis, the efficient bounty hunter Dash MacKenzie is hired by the big corporation boss Joseph Lau and his henchman Davinder Sandhu to hunt down his former employee Edward Chan. Edward has vanished after submitting to the state-of-art procedure neuromorphing. While seeking Edward out, Dash stumbles with Ident Detective Victor Huang and he warns her that someone might want to kill Edward, but she does not pay attention to him. Dash finds Edward but he is assassinated before telling her why he is hunted down. However his mistress Sylvia escapes from the killer. Soon Dash finds a clip and her biotech guru Julius Kui stumbles with the truth and finds why Edward was murdered. Dash brings Victor to meet Julius and he shows Megacorp transactions in Sintawan to them. He explains that these five companies make up the total infrastructure and have total control over Cyberlink. They form a powerful consortium and play a game based on the ancient Chinese game Wei Chi. Sintawan is the playing field where they wage corporate war in accordance with the strategies of the five companies, manipulating the course of the society and everyone living here. Therefore the place is an illusion and nothing is what it seems and there is no distinction between the game and reality. Then Dash finds that they are all avatars. What will they do? —Claudio Carvalho, Rio de Janeiro, Brazil"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzU2M2E1YmEtYjk4Yi00NTNiLWE0YTItNjA1MGNmNGI3MjcxXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20139",
                "_score": 2.552989,
                "_source": {
                    "title": "Karate Dog",
                    "rating": 2.7,
                    "year": 2005,
                    "directors": [
                        "Bob Clark"
                    ],
                    "writers": [
                        "Gregory Poppen",
                        "Steven Paul"
                    ],
                    "actors": [
                        "Jon Voight",
                        "Simon Rex",
                        "Jaime Pressly",
                        "Pat Morita",
                        "Thomas Kretschmann",
                        "Ron Lester",
                        "Bonnie Paul",
                        "Nicollette Sheridan",
                        "Lori Petty",
                        "Garry Chalk",
                        "Diego Wallraff",
                        "Bill Croft",
                        "Ed Anders",
                        "Candus Churchill",
                        "Dagmar Midcap",
                        "Linda Porter",
                        "Lauren K. Robek",
                        "Brian Tonomura",
                        "Phil Chiu",
                        "Don Lew",
                        "Mike Crestejo",
                        "Mitchell Allen Snary",
                        "Bruce Tartaglia",
                        "Michael Patterson",
                        "Kevin Carney",
                        "Albert Mason",
                        "Chevy Chase",
                        "Deren Abram",
                        "Janyse Jaud",
                        "Primo"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Family",
                        "Sci-Fi"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 84,
                    "summary": [
                        "When LAPD computer expert Peter Fowler investigates the killing of an old man in Chinatown, he finds the only witness is his dog, Cho Cho. But Fowler soon discovers Cho Cho is the only dog in the world who can speak to humans... not only that, Cho Cho is an expert in martial arts. When they join forces to track down the mastermind behind the death of Cho Cho's master, it leads these unusual partners into uncovering a dangerous conspiracy which puts both of their lives in danger. —Anonymous",
                        "Chin Li works for Hamilton Cage, who runs a track where greyhounds are raced. Cage also has big plans, as an illegal drug shows great promise for improving the quality of life of people. But apparently Chin Li stood in the way of this, as a masked assassin kills him in front of his dog Cho Cho. Of the cops investigating the case, only Peter Fowler, a computer geek who has developed COLAR (sort of like Siri), appears likely to be headed in the right direction. Chin Li has advised Cho Cho to talk only to those who seek truth, so Cho Cho opens up to Fowler. Fowler thinks it's some kind of trick, but he eventually believes Cho Cho is really talking. But he can't convince anyone else: the same thing happens to him that happened to that construction worker who found Michigan J. Frog. No matter: Fowler can pursue the case on his own. And he has help from the pretty Ashley, a cop who wants to be a detective like her father, her grandfather, her great-grandfather. Southern Beauty, one of the greyhounds, is really good. Too good. The truth eventually comes out, but this means potential danger for the heroes. The Cage children seem more ambitious than their father. Could they be the killers? Or does the father know everything? Or is someone else involved?"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTczNjI2NTU5NV5BMl5BanBnXkFtZTgwNDcwNjgwMzE@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20142",
                "_score": 2.552989,
                "_source": {
                    "title": "Escaflowne",
                    "rating": 6.6,
                    "year": 2000,
                    "directors": [
                        "Kazuki Akane",
                        "Yoshiyuki Takei"
                    ],
                    "writers": [
                        "Ryôta Yamaguchi",
                        "Kazuki Sekine"
                    ],
                    "actors": [
                        "Maaya Sakamoto",
                        "Tomokazu Seki",
                        "Jôji Nakata",
                        "Mayumi Izuka",
                        "Minami Takayama",
                        "Kôji Tsujitani",
                        "Shin'ichirô Miki",
                        "Ikue Ôtani",
                        "Nobuyuki Hiyama",
                        "Hisako Kyôda",
                        "Kappei Yamaguchi",
                        "Caitlin Glass",
                        "Aaron Dismuke",
                        "Vic Mignogna",
                        "Jad Saxton",
                        "Joel McDonald",
                        "Chuck Huber",
                        "Sonny Strait",
                        "Alexis Tipton",
                        "Chris Cason",
                        "Kelly Sheridan",
                        "Kirby Morrow",
                        "Paul Dobson",
                        "Willow Johnson",
                        "Andrew Francis",
                        "Scott McNeil",
                        "Brian Drummond",
                        "Jocelyne Loewen",
                        "Trevor Devall",
                        "Felecia Angelle",
                        "Tia Lynn Ballard",
                        "Christopher Bevins",
                        "Ben Bryant",
                        "Charles C. Campbell",
                        "Clifford Chapin",
                        "Colleen Clinkenbeard",
                        "Kul Das",
                        "Brian Dobson",
                        "Michael Dobson",
                        "Ricco Fajardo",
                        "Cris George",
                        "Jarrod Greene",
                        "Josh Grelle",
                        "Chris Guerrero",
                        "Janyse Jaud",
                        "Jerry Jewell",
                        "Yoshiko Kamei",
                        "Terry Klassen",
                        "Nick Landis",
                        "Linda Leonard",
                        "Mike McFarland",
                        "Kristen McGuire",
                        "Richard Newman",
                        "Justin Pate",
                        "Ward Perry",
                        "Ben Phillips",
                        "Kyle Phillips",
                        "Chris Rager",
                        "Tyson Rinehart",
                        "Whitney Rodgers",
                        "Michelle Rojas",
                        "Ian Sinclair",
                        "Micah Solusod",
                        "Marcus D. Stimac",
                        "Venus Terzo",
                        "Eric Vale",
                        "Tyler Walker",
                        "Maxey Whitehead",
                        "Kent Williams",
                        "Sylvia Zaradic"
                    ],
                    "genres": [
                        "Adventure",
                        "Animation",
                        "Drama",
                        "Fantasy",
                        "Romance",
                        "Action",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese"
                    ],
                    "runtime": 98,
                    "summary": [
                        "A grim retelling of the television series "The Vision of Escaflowne".",
                        "High school student Hitomi Kanzaki, depressed and despondent, wishes to disappear from her world. Her wishes are heard in the alternate world of Gaea where a battle for absolute control is raging! Magically, Hitomi is suddenly transported to this other world and is bestowed with the power to decide its ultimate fate! —Mike Eisenberg <evaunit6@yahoo.com>",
                        "Hitome, a school-girl, wishes she could fade away from the world. Her wish comes true as she is transported to a different world where she is a goddess. She is befriended by a a rag-tag clan of militants opposing the military might of Lord Vulcan; including his brother Van. She must call forth the dragon armor in time to defeat the minions of Lord Vulcan, but will her earthly wish to fade away, also cause the destruction of her new world, Gaea? —FMJ_Joker"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BN2I4YzBhZmYtN2FkZC00MWZhLTkzYzEtZjAwYzI1ZDk1MmI1XkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20145",
                "_score": 2.552989,
                "_source": {
                    "title": "Ikíngut",
                    "rating": 6.3,
                    "year": 2000,
                    "directors": [
                        "Gísli Snær Erlingsson"
                    ],
                    "writers": [
                        "Jon Steinar Ragnarsson"
                    ],
                    "actors": [
                        "Hjalti Rúnar Jónsson",
                        "Hans Tittus Nakinge",
                        "Pálmi Gestsson",
                        "Elva Ósk Ólafsdóttir",
                        "Magnús Ragnarsson",
                        "Freydís Kristófersdóttir",
                        "Finnur Guðmundsson",
                        "Pétur Einarsson",
                        "Sigurveig Jónsdóttir",
                        "Gunnar Hansson",
                        "Atli Rafn Sigurðsson",
                        "Edda Björg Eyjólfsdóttir",
                        "Theodór Júlíusson",
                        "Ragnar Unnarsson",
                        "Björn Jörundur Friðbjörnsson",
                        "Hjalti Rögnvaldsson",
                        "Þórhallur Sigurðsson",
                        "Hjálmar Hjálmarsson",
                        "Orto Ignatiussen",
                        "Bjørn Floberg",
                        "Benedikt Clausen",
                        "Steinunn Ólína Þorsteinsdóttir",
                        "Sindri Páll Kjartansson",
                        "Jón Stefán Kristjánsson",
                        "Birgir Sigurðsson",
                        "Friðrik Kingo Andersen",
                        "Felix Eyjólfsson",
                        "Harald Kulp",
                        "Valdimar Jóhannsson",
                        "Egill Hilmar Jónsson",
                        "Halldór Guðmundsson",
                        "Bjarni Grímsson",
                        "Einar Örn Einarsson",
                        "Kristbjörn Helgason",
                        "Ólöf Katrín Ellingsen",
                        "Valdimar Jóhannsson",
                        "Ingvar Þórðarson",
                        "Sigurjón Kjartansson"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Drama",
                        "Family"
                    ],
                    "country": "Iceland",
                    "languages": [
                        "Icelandic",
                        "Kalaallisut"
                    ],
                    "runtime": 90,
                    "summary": [
                        "In the middle ages a small Greenlandic boy comes drifting with an Iceberg to a remote and superstitious settlement in Iceland and is believed to be an evil spirit by his looks. He saves a young boy from an avalanche and they become friends. The young Icelandic boy has to fight for his friends existence against the ignorant villagers, who want him imprisoned or even killed. —Jon Steinar Ragnarsson",
                        "Essentially this film is an essay about prejudice and fear of the unknown, and the enlightenment that can come through friendship and understanding of others. A little boy from a small Icelandic community sees a figure out on the Ice Floe, but too far away for him to judge whether man or beast. His wild imagination, together with the uneducated fears of some of the adults lead to alarm about the creature, and a hunting party goes looking, which is not what the boy wants. With the village divided, there is further difficulty resulting from an avalanche caused by a shot fired by one of the hunting party. What happens next leads the whole village to re-examine its outlook. —pipnuts"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzYwY2ZmMGMtNmY0OS00NGE4LTg2OTgtMjIxOGQ1MjkxZmI0XkEyXkFqcGdeQXVyNjM3NjU0OTU@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20147",
                "_score": 2.552989,
                "_source": {
                    "title": "El beso del dragón",
                    "rating": 6.6,
                    "year": 2001,
                    "directors": [
                        "Chris Nahon"
                    ],
                    "writers": [
                        "Jet Li",
                        "Luc Besson",
                        "Robert Mark Kamen"
                    ],
                    "actors": [
                        "Jet Li",
                        "Bridget Fonda",
                        "Tchéky Karyo",
                        "Ric Young",
                        "Burt Kwouk",
                        "Laurence Ashley",
                        "Cyril Raffaelli",
                        "Didier Azoulay",
                        "John Forgeham",
                        "Paul Barrett",
                        "Max Ryan",
                        "Colin Prince",
                        "Vincent Glo",
                        "Vincent Wong",
                        "Kentaro",
                        "Stéphane Jacquot",
                        "Stefan Nelet",
                        "Peter Sakon Lee",
                        "Isabelle Duhauvelle",
                        "Yannick Derrien",
                        "Francesca Disca",
                        "Taïra",
                        "David Gabison",
                        "Bertrand Waintrop",
                        "Alain Zef",
                        "Nicolas Herault",
                        "Jean-Marc Huber",
                        "Franck Tiozzo",
                        "John Maczko",
                        "Claude Brécourt",
                        "Jean-Georges Vongerichten",
                        "François Nguyen",
                        "Jocelyne Isaac",
                        "Raymond Khamvene",
                        "Urfé Koupaki",
                        "Grégory Galin",
                        "Alexander Koumpan",
                        "Daniel Milgram",
                        "Bernard Flavien",
                        "Eric Averlant",
                        "Marc Ligaudan",
                        "Frédéric Moulin",
                        "Alain de Catuelan",
                        "Ludovic Berthillot",
                        "Guillaume Lamant",
                        "Lina Chen",
                        "Barbara Bernard",
                        "Pat Tourne",
                        "Crystalle Seeram",
                        "Karen Drotard",
                        "Sabine Ben Rhadi",
                        "Saadi Spera",
                        "Stéphanie Martin",
                        "Stéphanie Durand",
                        "Carmelle Edma",
                        "Schana Réaux",
                        "Affif Ben Badra"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "France",
                    "languages": [
                        "English",
                        "French",
                        "Mandarin"
                    ],
                    "runtime": 98,
                    "summary": " Liu Siu-jian (Jet Li), a Chinese intelligence agent, is sent to Paris to help apprehend Chinese mob boss Mr. Big (Ric Young), who is involved in heroin smuggling. He meets Inspector Jean-Pierre Richard (Tchéky Karyo), a corrupt and violent French police detective, at a hotel. Richard tricks Liu into believing he is simply providing reconnaissance of a meet involving Mr. Big. The plans are changed when Mr. Big is introduced to two prostitutes, one being Jessica Kamen (Bridget Fonda), an American woman, who takes him to his room to service him. While Liu and the rest were watching through the surveillance camera, Mr. Big kicks everyone out except for the two prostitutes. While a prostitute is on top of Mr. Big, she attempts to murder him. Witnessing the events from a surveillance room, Liu rushes to stop the prostitutes. Richard enters shortly later, only to shoot Mr. Big and the prostitute with Liu's police-issue handgun, framing Liu for the murders.Realizing he has been set up, Liu manages to escape from the hotel with a surveillance tape showing Richard shooting Mr. Big. Chinese liaisons are sent to France after the events to investigate the matter, as Richard makes Liu the primary suspect. However, the liaisons do not believe the story Richard provides. Liu manages to contact one of the liaisons, in an attempt to pass on the tape to reveal the truth. Due to French police surveillance, the meet between the liaison and Liu is spotted, and the liaison is assassinated. During Liu's escape, he loses the tape in the chaos, and is forced to maintain a low profile.As he considers his situation, he meets Jessica, whose daughter was kidnapped by Richard to force her into prostitution. Liu discovers Jessica was the second prostitute at the hotel during the night of Mr. Big's murder. He realizes she can prove his innocence, but she refuses to go without her retrieving her daughter, Isabel. Liu decides the tape would provide the best evidence, and sends Jessica to Richard's office to steal the tape. Jessica manages to get the tape, so Liu and Jessica head to an orphanage where Isabel is kept. However, Richard anticipates this move after discovering Jessica has stolen the tape, and ambushes the couple at the orphanage. During their escape, Jessica is shot in the chest. Liu manages to get her to the hospital in time, and becomes driven to retrieve her daughter. Liu arrives at the police station where Richard is holding Isabel hostage, and fights his way through Richard's henchmen to his office. Once at the office, Liu rescues Isabel, getting shot by Richard in the process. To save Isabel, Liu kills Richard by sticking an acupuncture needle into the back of his neck in a forbidden location known as the "kiss of the dragon,
                    " which stimulates all the body's blood to travel to the brain to cause a painful death via a brain aneurysm. Liu survives the gunshot wound, and returns Jessica's daughter back to her mother. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzM0ZDIxNDYtZDJjMy00NTc5LWIyMTgtMzBhNGRiZTU0ZmRjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20152",
                "_score": 2.552989,
                "_source": {
                    "title": "Trama mortal",
                    "rating": 4.3,
                    "year": 2001,
                    "directors": [
                        "Laurence Malkin"
                    ],
                    "writers": [
                        "Chad Thumann",
                        "Laurence Malkin"
                    ],
                    "actors": [
                        "Skeet Ulrich",
                        "Kristy Swanson",
                        "Derek de Lint",
                        "Rena Owen",
                        "Antonie Kamerling",
                        "Serge-Henri Valcke",
                        "Nicholas Irons",
                        "Thom Hoffman",
                        "Katherine Lang",
                        "André Arend van de Noord",
                        "Yorick van Wageningen",
                        "Jaap Postma",
                        "Georgina Verbaan",
                        "Jeroen Willems",
                        "Monic Hendrickx",
                        "Lioba Visser",
                        "Tygo Gernandt",
                        "Delilah van Eijck",
                        "Yacha Musatov",
                        "Froukje de Both",
                        "Ruurt de Maesschalck",
                        "Joe Montana",
                        "Jeroen Veldhuizen",
                        "René Jonker",
                        "Horace Cohen",
                        "Ruben van der Meer",
                        "Gert Jan Louwe",
                        "Rolf Leenders",
                        "Yoeri van Dreumel",
                        "Saskia van der Brink",
                        "Linda Franken",
                        "Nienke Disco",
                        "Frans de Wit",
                        "Annemarie Stroo",
                        "Yvonne van Loon",
                        "Patricia Verbruggen"
                    ],
                    "genres": [
                        "Crime",
                        "Thriller",
                        "Action"
                    ],
                    "country": "Netherlands",
                    "languages": [
                        "English"
                    ],
                    "runtime": 96,
                    "summary": [
                        "Kevin Burke a young executive for a multinational investment bank, is a rising star in the Rotterdam office. Rewarded for his perceptive eye and mastery of foreign languages, Kevin receives the promotion he has been working for - a coveted spot on the company's internal security team. Trained by the enigmatic Mr. Ficks to protect the firm's employees in volatile, third world markets, Kevin thinks he has a shield for every arrow. And this makes him feel safe, or at least "safer" than he's felt since his father's mysterious death. Karl Jorgensen, the Managing Director of the bank, is Kevin's boss and surrogate father. He has mentored Kevin over the years, which makes his biological son, Karl Jorgensen Junior, visibly jealous. Jorgensen brushes off the "sibling rivalry", but clearly favors Kevin, molding him into a confident, young man. It is this confidence that gives Kevin the courage he needs to propose to the woman he loves. One smile from Rosalind Bremmond and it is easy to understand the attraction. A "rain making" broker in the bank's commodities division, Rosalind is concerned about the dangers of Kevin's new job. Kevin silences her with a kiss and prepares to propose but before he can give her the ring, an assassin's bullet shatters Rosalind's heart and crushes Kevin's soul. Having lost all hope for the future, Kevin is driven to seek revenge. His fury might well be directed at Tessa Jansen, a strong beauty who tracks Kevin from afar, lurking in the shadows of the crime scene. But first, he must find the truth. Kevin thought he knew his girlfriend, but who was she really, and why did someone want her dead? Frustrated by the local police and Willem van der Zee, an agent from Interpol, Kevin turns to Jorgensen, who places the full resources of the Security Division at Kevin's disposal. As Kevin investigates Rosalind's death, he uncovers her secret life as a money launderer and is slowly indoctrinated into a web of corporate espionage and assassination. His efforts quickly make him a target for Rosalind's enemies, agents from Interpol, and the Dutch authorities, all of whom assume Kevin's involvement predated her death. In this time of chaos, who can he trust? Karina, the bank's office manager and Kevin's surrogate mother? Thorsten, a local Coffee Shop owner and Kevin's loyal hacker buddy? Think again. Amidst the hailstorm of bullets and ever-shifting sands, Kevin must carry on his quest a quest to learn the true identity of the killer, while trying to reconcile the real Rosalind with the woman he loved. Who wanted her dead? Who crushed Kevin's soul and molded him into a vengeful gunman? Who is the soul assassin? —Parabolic Pictures, Inc.",
                        "The future seems bright for Kevin Burke, a security expert for the large multi-national company Jorgensen Financial. He's just been promoted and is about to propose marriage to his girlfriend Rosalind. But that all changes when Rosalind is murdered before his eyes by a professional hitman. While tracking down her killers Kevin finds himself chased by mob hit-woman Tessa, his co-workers Junior and Mr Ficks and the police. Burke's mentor and employer Karl Jorgensen, enigmatic though supportive, seems to hold the key to the mystery. —Fu Works press release"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjE2NTc3OTQ5Ml5BMl5BanBnXkFtZTcwMzI4NTQyMQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20160",
                "_score": 2.552989,
                "_source": {
                    "title": "Arac Attack",
                    "rating": 5.5,
                    "year": 2002,
                    "directors": [
                        "Ellory Elkayem"
                    ],
                    "writers": [
                        "Ellory Elkayem",
                        "Randy Kornfield",
                        "Jesse Alexander",
                        "Ellory Elkayem"
                    ],
                    "actors": [
                        "David Arquette",
                        "Kari Wuhrer",
                        "Scott Terra",
                        "Scarlett Johansson",
                        "Doug E. Doug",
                        "Rick Overton",
                        "Leon Rippy",
                        "Matt Czuchry",
                        "Jay Arlen Jones",
                        "Eileen Ryan",
                        "Riley Smith",
                        "Matt Holwick",
                        "Jane Edith Wilson",
                        "Jack Moore",
                        "Roy Gaintner",
                        "Don Champlin",
                        "John Storey",
                        "David Earl Waterman",
                        "Randi Klein",
                        "Terey Summers",
                        "John Ennis",
                        "Ryan C. Benson",
                        "Bruiser",
                        "Tom Noonan",
                        "Debbie Overbey"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Comedy",
                        "Horror",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 99,
                    "summary": " In the quiet mining town of Prosperity, Arizona, an accident involving a rabbit causes a barrel of toxic waste to land in a reservoir. An exotic spider farmer named Joshua (Tom Noonan) has been making regular visits to the site, where he collects crickets for his spiders. Although the spiders have ingested the toxins, he is oblivious since the arachnids seem unaffected. Joshua shows Mike (Scott Terra), a local boy, his collection, which include Jumping spiders, Trapdoor spiders, Tarantulas, and orb-weavers, including a female orb-weaver named Consuela. After Mike leaves, Joshua is bitten by an escaped tarantula and accidentally knocks down the spider cages. He is killed by the spiders and, after devouring him, the spiders grow to even huger proportions.On his way home, Mike is accosted by his mother, Sheriff Samantha 'Sam' Parker (Kari Wührer) and Deputy Pete pulling the toxic barrel out of the pond. Wade, the Mayor of Prosperity, is holding a town meeting in the mall about whether they should sell the mines and relocate. Chris McCormick (David Arquette), whose father owned the mines before he died ten years ago, shows up and stands against Wade's proposition. Chris also sparks a romance with Sam.Meanwhile, Harlan Griffiths (Doug E. Doug), the local radio DJ and an eccentric extraterrestrial enthusiast, is broadcasting his theory that various missing pets around town have been abducted by extraterrestrials. Inevitably his theory is dismissed as the product of a deranged imagination. Mike sneaks out on foot to find Joshua but finds the spiders missing, the farm covered in webbing, and the dead body of Joshua. Although he sees an enormous spider shadow in the mines and tells Chris that the spiders have grown to enormous sizes, based on a giant spider leg he found at the mine entrance, Chris disbelieves his story. Meanwhile, the mines have reopened with the miners searching for a famous gold lode.One miner is eaten by a gigantic spider, whose clan have made the mines their home. Seeing as the entire town is connected in some way to the mines, spiders show up in many different places. Deputy Pete Williams (Rick Overton) cat has a fight with one of the spiders in the air vents before being eaten, and some of the ostriches on Wade's farm are devoured by Trap Door Spiders, Ashley breaks up with her boyfriend Bret, and he and his motorcyclist friends are chased by jumping spiders, with him being the only survivor, accidentally cutting off the telephone line and being stuck in the mine. Chris finds out that his Aunt Gladys and her dog are abducted by a male orb weaver in their basement. Sam is convinced Chris and Mike are delusional. However, her skepticism fades and she realizes that Chris and Mike were right all along when she witnesses a giant male orb-weaver attempting to abduct Ashley (Scarlett Johansson), Sam's rebellious teenage daughter and Chris; Sam saves them both. Meanwhile Bret, still wandering the mines, gets a good peek at the giant Consuela during her feeding.Sam contacts Pete and tells him to bring all guns in the police station's possession and they escape to Harlan's trailer, knowing he has a radio station that he operates from within his trailer. As Sam broadcasts the threat over the radio, a giant tarantula, the "tank" of the horde, assaults the trailer but they manage to escape. As the town is besieged by vicious spider hordes, many people are killed and eaten, Chris tries to convince Harlan that the spiders are "from Earth" but ends up convincing him that they are "Spiders from Mars" to make him happy, Sam tells everybody to evacuate to the mall. Chris, Sam, Mike, Ashley, Harlan, Wade and many other townspeople all escape and barricade themselves in the mall (but the cowardly Wade flees into the mines and locks the gate before the attack) and defend themselves from the spiders. Meanwhile, Harlan and Chris climb onto the roof and ascend the radio mast and try to get a signal to call the US army as they are being attacked by the spiders, but are believed to be pranksters. Harlan jumps from the roof, after the tarantula breaks open the gates and lets the spiders enter the mall, and lands in some bushes, where he meets up with Pete. The two run from spiders as Chris meets up with the remaining townsfolk and goes down to the basement. Meanwhile, Bret, still wandering the mines, encounters the cowardly Wade before his abduction.While the townsfolk are in the basement, Bret arrives on a forklift that brings down the locked gate, and they all head to through the mines straight to the front entrance, discovering the methane-filled tunnels. After losing Norman and freeing Wade, Chris goes to look for his Aunt Gladys in the mines and finds her - and the gold his father was searching for, but is confronted by the gigantic Consuela. He uses perfume to distract the spider and then escapes using Bret's motorcycle. Chris then blows up the spiders and the mines utilizing Gladys's smoking addiction and the high concentrations of methane gas. The police finally arrive. They had not believed the reports of the spiders but believed Harlarn's theory that the assailants were extraterrestrial in nature, until Pete tells them that the assailants were "just spiders, that had ingested extremely high levels of toxic waste." He attempts to prove this by removing his hat, showing us that he is bald. He runs his hand back and forth over his head saying; "All new growth, just look at this, all new growth!"In the final scene, Harlan is heard making a radio report about the spiders. He concludes that the town has decided to cover up the whole incident, but have let Harlan continue broadcasting the incident, knowing nobody will believe him. He also mentions Chris reopening the gold mines and putting everyone back to work, but tells us "that is another story altogether." As the camera zooms in close on his mouth, it is clear that he now has three gold teeth. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzMzODg5MDk4OV5BMl5BanBnXkFtZTYwNTM0Nzc3._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20162",
                "_score": 2.552989,
                "_source": {
                    "title": "Crystania no densetsu",
                    "rating": 5.8,
                    "year": 1995,
                    "directors": [
                        "Ryûtarô Nakamura"
                    ],
                    "writers": [
                        "Akinori Endô",
                        "Ryo Mizuno",
                        "Ryo Mizuno"
                    ],
                    "actors": [
                        "Hikaru Midorikawa",
                        "Mitsuki Yayoi",
                        "Sakiko Tamagawa",
                        "Kiyoshi Kobayashi",
                        "Toshihiko Seki",
                        "Fumihiko Tachiki",
                        "Chinami Nishimura",
                        "Kazuki Yao",
                        "Yumi Tôma",
                        "Megumi Ogata",
                        "Yasunori Matsumoto",
                        "Masaharu Satô",
                        "Hirohiko Kakegawa",
                        "Hisao Egawa",
                        "Banjô Ginga",
                        "Akira Kamiya",
                        "Robin Balkwill",
                        "Lowell Bartholomee",
                        "Tom Bartling",
                        "Amy Bizjak",
                        "Tom Byrne",
                        "Charles C. Campbell",
                        "Cody Chappel",
                        "Susan Cotton",
                        "Denise Dee",
                        "Eric DeValpine",
                        "Adam Dudley",
                        "Dale Dudley",
                        "Sharon Elmore",
                        "Lainie Frasier",
                        "Larry Goode",
                        "Gray G. Haddock",
                        "Joe Hamilton",
                        "Snowden Harry",
                        "Boni Hester",
                        "John Hoff",
                        "Samantha Inoue Harte",
                        "David Jones",
                        "Alfred L. Kinsey",
                        "Gary Lipkowitz",
                        "Aimee McCormick",
                        "Edi Patterson",
                        "Patricia Pearcy",
                        "Diane Perella",
                        "Lou Perryman",
                        "Jason Phelps",
                        "Barry Pineo",
                        "Amber Quinn",
                        "Lauri Raymond",
                        "Kevin Remington",
                        "Robert Rudie",
                        "Steve Sanders",
                        "Jessica Schwartz",
                        "Jay Sefton",
                        "Christopher Shea",
                        "John Paul Shepard",
                        "Victor Steele",
                        "Michael Stuart",
                        "Bill Sutherland",
                        "Chiyomi Takahashi",
                        "Georgeanna Valdez",
                        "Ken Webster",
                        "Bill Wise"
                    ],
                    "genres": [
                        "Animation",
                        "Action",
                        "Adventure",
                        "Fantasy"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese",
                        "English"
                    ],
                    "runtime": 85,
                    "summary": [
                        "Dreams begin to haunt Lady Sheru -- dreams of her past life as Pirotesse. Her love, Ashram, is being tormented at the hands of the soul of Barbas posing as their former king, Beld of Marmo."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTIyOTcwMDg3NF5BMl5BanBnXkFtZTYwNDExODI5._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20165",
                "_score": 2.552989,
                "_source": {
                    "title": "Agenda oculta",
                    "rating": 4.5,
                    "year": 2001,
                    "directors": [
                        "Marc S. Grenier"
                    ],
                    "writers": [
                        "Les Weldon"
                    ],
                    "actors": [
                        "Dolph Lundgren",
                        "Maxim Roy",
                        "Brigitte Paquette",
                        "Ted Whittall",
                        "Serge Houde",
                        "Alan Fawcett",
                        "Francis X. McCarthy",
                        "Harry Standjofski",
                        "Christian Paul",
                        "Andreas Apergis",
                        "Jeff Hall",
                        "Cas Anvar",
                        "Lynne Adams",
                        "Alan Legros",
                        "Jay Levalley",
                        "Michael Scherer",
                        "Jere Gillis",
                        "Gilbert Larose Jr.",
                        "Jason Cavalier",
                        "Stéphane Lefebvre",
                        "François Gauthier",
                        "Alexandre Cadieux",
                        "Yves Langlois",
                        "Jean-Marc Bisson",
                        "Johnny Goar",
                        "Nick Skokos",
                        "Jean Frenette",
                        "André Laperrière",
                        "David McKeown",
                        "Norman Roy",
                        "Marlyne Barrett",
                        "Barry Blake",
                        "John Sanford Moore",
                        "Kevin Woodhouse",
                        "Brian D. Wright",
                        "Marie-Josée Colburn",
                        "Danny Blanco Hall",
                        "Patrick Kerton"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English"
                    ],
                    "runtime": 95,
                    "summary": [
                        "When the FBI can't protect a witness, it's up to ex-agent Price and his own protection program to take them under.",
                        "Former government Jason Price (Dolph Lundgren) makes people disappear for a living. But when a top lieutenant for a crime syndicate asks Price to help him drop out of sight, things take a grisly, unexpected turn. A mysterious hit man known as The Cleaner has infiltrated Price's tightly-controlled system, leaving a bloody trail behind. With the help of an enigmatic seductress posing as the mobster's chief assistant, Price methodically works through his network of associates to find out what went wrong, and is plunged headlong into a spiraling gauntlet of half-truths and full-blown lies where nobody is who they appear to be, and everyone has a deadly, hidden agenda... —Anonymous",
                        "Former government Jason Price makes people disappear for a living. But when a top lieutenant for a crime syndicate asks Price to help him drop out of sight, things take a grisly, unexpected turn. A mysterious hit man known as The Cleaner has infiltrated Price's tightly-controlled system, leaving a bloody trail behind. With the help of an enigmatic seductress posing as the mobster's chief assistant, Price methodically works through his network of associates to find out what went wrong, and is plunged headlong into a spiraling gauntlet of half-truths and full-blown lies where nobody is who they appear to be, and everyone has a deadly, hidden agenda... —anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BN2NjOWE0NjQtM2MxOC00Yzg0LTlkZmEtY2EyNWUxYjc2YWJiXkEyXkFqcGdeQXVyMDI4NjM1MQ@@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20168",
                "_score": 2.552989,
                "_source": {
                    "title": "Seguridad nacional",
                    "rating": 5.6,
                    "year": 2003,
                    "directors": [
                        "Dennis Dugan"
                    ],
                    "writers": [
                        "Jay Scherick",
                        "David Ronn"
                    ],
                    "actors": [
                        "Martin Lawrence",
                        "Steve Zahn",
                        "Colm Feore",
                        "Bill Duke",
                        "Eric Roberts",
                        "Timothy Busfield",
                        "Robinne Lee",
                        "Matt McCoy",
                        "Brett Cullen",
                        "Cleo King",
                        "Gerry Del Sol",
                        "Ken Lerner",
                        "Mari Morrow",
                        "Stephen Tobolowsky",
                        "Joe Flaherty",
                        "Keith Cooke",
                        "Mike Brady",
                        "Troy Gilbert",
                        "Anthony G. Schmidt",
                        "Joe Bucaro III",
                        "Carl Ciarfalio",
                        "Bobby McLaughlin",
                        "Robert Harvey",
                        "John Henry Binder",
                        "Margaret Travolta",
                        "Wayne Morse",
                        "Terry Logan",
                        "Mark Lonow",
                        "Jeffrey Ross",
                        "Jocko Marcellino",
                        "Jonathan Loughran",
                        "Noel Gugliemi",
                        "Hiep Thi Le",
                        "Leslie Jones",
                        "Dawn Lewis",
                        "Jackie Flynn",
                        "Hal Fishman",
                        "Andy Dugan",
                        "Mickey Gilbert",
                        "Richardson Morse",
                        "Ben Hernandez Bray",
                        "Tom Forrest",
                        "Amy Aquino",
                        "Amanda Van Roberts",
                        "Michael Grasso",
                        "Bruce Franklin",
                        "Daniel Sudick",
                        "Maia Danziger",
                        "Greg Serano",
                        "DeAnna Kane",
                        "Kevin Beard",
                        "Michael Beardsley",
                        "Frank Carlopio",
                        "Joseph J. Dawson",
                        "Mike Hawks",
                        "Ray Huffman",
                        "Martin Klebba",
                        "Errol Sack"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 88,
                    "summary": [
                        "Two mismatched security guards are thrown together to bust a smuggling operation.",
                        "Earl and Hank have only one thing in common: they're both L.A.P.D. rejects. One just got kicked out, the other can't even get in. After confronting each other on opposite sides of the law during a traffic stop that escalates out of control, these two luckless individuals end up partnered as lowly security guards. Despite being damned to the lowest rung of the law enforcement ladder, Earl and Hank uncover a sophisticated smuggling operation led by Nash and his band of thugs. When Earl and Hank get their hands on some hot property, they go on the run from, first the bad guys, then the L.A.P.D.--led by Lt. Washington and Detective McDuff. What these two unlikely partners do to law enforcement is a crime, but they just might save the day. That is, if they don't kill each other first. —Sujit R. Varma"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTgzZDQzNTQtY2NmMC00YTM1LWEwYmEtZGIwNmJmOTdiOTZlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20169",
                "_score": 2.552989,
                "_source": {
                    "title": "The Pretender 2001",
                    "rating": 7.5,
                    "year": 2001,
                    "directors": [
                        "Frederick King Keller"
                    ],
                    "writers": [
                        "Steven Long Mitchell",
                        "Craig W. Van Sickle"
                    ],
                    "actors": [
                        "Michael T. Weiss",
                        "Andrea Parker",
                        "Patrick Bauchau",
                        "Jon Gries",
                        "Harve Presnell",
                        "Richard Marcus",
                        "James Denton",
                        "Tyler Christopher",
                        "Peter Outerbridge",
                        "Cynthia Dale",
                        "Derwin Jordan",
                        "Yannick Bisson",
                        "May Charters",
                        "Paul Dillon",
                        "Chris Khalil",
                        "Mike Massa",
                        "Anthony Poser",
                        "Louis A. Rivera",
                        "Stone Van Gorder",
                        "Frank Morehead"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 96,
                    "summary": [
                        "Jarod reunites with two old friends and unleashes some powerful Centre revelations. Also Jarod and Miss Parker learn more about their pasts."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTI5ODUxMDA4OF5BMl5BanBnXkFtZTcwMTkxNDg0MQ@@._V1_SY150_CR4,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20173",
                "_score": 2.552989,
                "_source": {
                    "title": "Espía por accidente",
                    "rating": 5.8,
                    "year": 2001,
                    "directors": [
                        "Teddy Chan"
                    ],
                    "writers": [
                        "Rod Dean",
                        "Ivy Ho"
                    ],
                    "actors": [
                        "Jackie Chan",
                        "Eric Tsang",
                        "Vivian Hsu",
                        "Min Kim",
                        "Hsing-Kuo Wu",
                        "Murat Yilmaz",
                        "Alfred Cheung",
                        "Lillian Ho",
                        "Tat-Ming Cheung",
                        "Vincent Kok",
                        "Hang-Sang Poon",
                        "Paulyn Sun",
                        "Ping Ha",
                        "Ken Chang",
                        "Glory Simon",
                        "Vahdet Çakar",
                        "Ahmet T. Uygun",
                        "Rakela Kunyo",
                        "Cheung Tat Chuen",
                        "Erdem Kaya",
                        "Emre Tannverdi",
                        "Abrim Gurgen",
                        "Faith Koroglu",
                        "Wai Hung Chan",
                        "Eric Lee",
                        "Bradley James Allan",
                        "Paul Andreovski",
                        "Anthony Carpio",
                        "Gordon Milne",
                        "Siros Niaros",
                        "Scott Adkins",
                        "Raven Choi",
                        "Taner Barlas",
                        "Ramazan Akboga",
                        "Rezzak Aklar",
                        "Karen Apostolina",
                        "Steve Apostolina",
                        "Kirk Baily",
                        "Sirma Bradley",
                        "Steve Bulen",
                        "Richard Cansino",
                        "Man-Ching Chan",
                        "Sai-Tang Chan",
                        "Wilgun Cinal",
                        "Robert Clotworthy",
                        "David Cowgill",
                        "Wendy Culter",
                        "Burak Damah",
                        "Chiu-Yau Dang",
                        "Ipek Deger",
                        "Hervé Décalion",
                        "Richard Epcar",
                        "Said Faraj",
                        "Eddie Frierson",
                        "Elisa Gabrielli",
                        "Nicholas Guest",
                        "Orhan Güner",
                        "Fatih Haciosmanoglu",
                        "Serah Henesey",
                        "James Hills",
                        "Bridget Hoffman",
                        "Rif Hutton",
                        "Aziz D. Jamily",
                        "Anthony Rene Jones",
                        "Choo Gyne Jung",
                        "Selim Kocak",
                        "Steve Kramer",
                        "Joh Young Kwan",
                        "Yung Kwan",
                        "Kennedy Lau",
                        "Sun-Him Lee",
                        "Lemon Liu",
                        "Edie Mirman",
                        "Gracie Moore",
                        "Sirri Murad",
                        "Jonathan Nichols",
                        "Erdinç Olgaçli",
                        "Ray Pang",
                        "Paul Pape",
                        "Bob Papenbrook",
                        "Steve Pinto",
                        "Tony Pope",
                        "Stuart Robinson",
                        "Lia Sargent",
                        "Figen Amber Senbas",
                        "Michael Sorich",
                        "Pamela Spencer",
                        "Alay Stailmis",
                        "Doug Stone",
                        "Mark Sussman",
                        "Hamit Suzen",
                        "Dave Thomas",
                        "Paxton Winters",
                        "Man-Chun Wong",
                        "Ming-Sing Wong",
                        "Stephanie Wong",
                        "Kin-Wai Yan",
                        "Yildirim Öcek",
                        "Gordon Alexander",
                        "Piggy Chan",
                        "Teddy Chan",
                        "Athena Chu",
                        "Yusuf Piskin",
                        "Mustafa Presheva"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "Hong Kong",
                    "languages": [
                        "Cantonese",
                        "Mandarin",
                        "English",
                        "Korean",
                        "French",
                        "Turkish"
                    ],
                    "runtime": 108,
                    "summary": " The movie begins to film begins with this opening film of 'The Accidential Spy' opens a news reporting team cover a story in an Anatolian village where many people have seemingly died from pneumonia while a team of scientists try to find a cure. A terrorist group disguised as farmers attack and kill shoot gunfire pistol screen fades to white. Screen fades from white to some days later, a former North Korean spy shows up at the Embassy of the Republic of Korea in Istanbul screen cuts to black movie opens to film opens with title as THE ACCIDENTIAL SPY (opening sequence).Two months later in Hong Kong, Buck Yuen, an exercise equipment salesman, inadvertently foils a bank robbery and becomes a media celebrity. Later that night, a stranger called Manny Liu approaches Yuen and says that he is looking for men of Yuen's age and description on behalf of a terminally ill Korean man, Park Won-jung, who wants to pass his fortune to his long-lost son.Yuen agrees and follows Liu's associate to South Korea to meet Park in a military hospital. Later, Yuen is approached by Carmen, a reporter, who asks him questions about Park. When Yuen returns to the hospital, he saves Park from a group of thugs and accepts Park's offer to play a "game" - if Yuen wins, he gets everything Park leaves behind for his biological son; if Yuen loses, he will still have fun. Park also gives Yuen a shiny crucifix similar to the one Yuen sees his parents holding in his dreams. After Park's death, Yuen scatters his ashes at his wife's grave and finds a message ("wait for me") engraved on the tombstone. After leaving the cemetery, Yuen and Carmen narrowly evade attacks from thugs. Yuen later realises that "wait for me" corresponds to a phone number of a bank in Istanbul.In Istanbul, Yuen uses the crucifix, which turns out to be a stamp, to retrieve the contents of Park's safety deposit box. Shortly after leaving the bank, he encounters several robbers trying to steal his briefcase full of money. He holds off the robbers until the police show up and the robbers flee. While touring Istanbul, Yuen meets a mysterious Chinese woman, Yong, who has "wait for me" embroidered on her scarf. When Yuen asks her where she got her scarf, she arranges to meet him at a later date and time.When Yuen is at a Turkish bath, he gets accosted by a group of thugs demanding that he hands over "the thing". After a long chase through the streets, Yuen finally escapes from them but shows up late for his meeting with Yong. Just then, Carmen and her colleague, Philip, approach Yuen and reveal to him that they are actually CIA agents. The "thing" that everyone is after is a biological weapon, Anthrax II, a more powerful version of anthrax. The weapon had already killed many people in Anatolia, which was chosen as a testing ground. Park developed brain cancer as a result of his involvement in the case. Yuen also learns that Zen, a crime lord, wants to buy the Anthrax II and had sent Yong to get close to Yuen to gather information.Yuen meets up with Yong, who confirms she is working for Zen. Moments later, they are captured by a group of thugs and brought back to the Anatolian village. As the thugs are beating up Yuen to force him to tell them where the Anthrax II is, mercenaries attack the village and gun down all the thugs. In the ensuing chaos, Yuen escapes with Yong on a makeshift raft. They are picked up by Zen, who reveals that he sent the mercenaries to save them. Yuen also learns that Yong is a drug addict enslaved by Zen. Zen offers Yuen a new deal: more money and Yong's freedom in exchange for the Anthrax II. Although Yuen refuses, Zen still gives him time to find the Anthrax II.Yuen recalls that there was a Bible in the safety deposit box so he makes his way to a nearby church and meets a priest who knows Park. The priest leads Yuen to the basement where Park temporarily stayed; Yuen finds two vials of Anthrax II there and a note saying "game over". Yuen then reluctantly hands over the Anthrax II to Zen in exchange for Yong. It turns out later that Zen had double-crossed Yuen by giving Yong a fatal dose of drugs. After Yong dies at the train station, Yuen gets arrested and thrown into prison but Carmen and Ashley bail him out. Carmen, feeling sorry for Yong's death, secretly reveals to Yuen that the CIA is meeting Zen the next day to discuss buying the Anthrax II from him.Yuen takes matters into his own hands and tries to stop Zen at the airport. While Zen and his henchmen flee in a car, Yuen chases them, fights them and manages to get back the Anthrax II. However, the car gets stuck to the rear of a tanker, which soon catches fire. The tanker has to keep moving at a certain speed or else it will explode. After Yuen manages to save the driver and his son, the tanker is heading straight towards the edge of a disused bridge. Just then, Manny Liu appears in a helicopter and tries to pull Yuen out but fails. Yuen leaps from the tanker and grabs hold of the plastic bridge barrier as he swings down. He rolls down a slope, sustains severe injuries from the fall, and becomes unconscious. Liu searches Yuen for the Anthrax II, finds it and leaves.When Yuen regains consciousness in hospital later, he learns from Liu that his entire adventure was actually a CIA mission arranged to be performed by him as an informal, non-official agent (an "accidental spy"). He was chosen because of his background as an orphan, his sharp intuition and excellent fighting skills. The dream of his parents is actually an illusion created by Liu, who added drugs into Yuen's drink to put him into a hypnotic state.In a post-credits scene, Yuen, now officially a spy, delivers a briefcase to a drug dealer in Italy and tips off the police to arrest him. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzZlYjI2YTAtMWE1MS00MDJjLWJkZTUtZjRmYTNiNDE1MTRlXkEyXkFqcGdeQXVyNDQ0MTYzMDA@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20176",
                "_score": 2.552989,
                "_source": {
                    "title": "La última fortaleza",
                    "rating": 6.9,
                    "year": 2001,
                    "directors": [
                        "Rod Lurie"
                    ],
                    "writers": [
                        "David Scarpa",
                        "David Scarpa",
                        "Graham Yost"
                    ],
                    "actors": [
                        "Robert Redford",
                        "James Gandolfini",
                        "Mark Ruffalo",
                        "Steve Burton",
                        "Delroy Lindo",
                        "Paul Calderon",
                        "Sam Ball",
                        "Jeremy Childs",
                        "Clifton Collins Jr.",
                        "George W. Scott",
                        "Brian Goodman",
                        "Michael Irby",
                        "Frank Military",
                        "Maurice Bullard",
                        "Nick Kokich",
                        "David Alford",
                        "Dean Hall",
                        "Peg Allen",
                        "Rick Vito",
                        "Forrest D. Bradford",
                        "Scott Michael",
                        "Dean Miller",
                        "Kristen Shaw",
                        "Michael Q. Davis",
                        "Joe Keenan",
                        "David Chattam",
                        "Dan Cole",
                        "Hans Mooy",
                        "James-Justone-Thomas",
                        "Steve Sandfort",
                        "Jamie Roberto Mantecon",
                        "Jeffery G. Fagan",
                        "Lyon Fleming",
                        "Darius Willis",
                        "Rico Moody",
                        "Rocky Abou-Sakher",
                        "Sean Cameron",
                        "Mary Jean Bentley",
                        "Kathryn Morris",
                        "Ray Beasley",
                        "Heath Bertam",
                        "Matt Blake",
                        "Matthew Blake",
                        "Scott Brantley",
                        "Josh Croft",
                        "Michael Dinwiddie",
                        "Johnny Dowers",
                        "Jason Drago",
                        "Jamie Dundee",
                        "Karen Espenant",
                        "Frank Fox",
                        "John Hanlin",
                        "Kevin Kinzer",
                        "Robert Malone",
                        "Matt Mangum",
                        "Ron Pecorella",
                        "David Powledge",
                        "Brett Quinn",
                        "Claudio Marcio Rojas",
                        "Todd Rossbach",
                        "Austin Sanders",
                        "Jill Senter",
                        "Dusty Shaffer",
                        "Toni Tardino",
                        "Phillip Trammel",
                        "Michelle Way",
                        "Gary Willis",
                        "Steven Woodring",
                        "Robin Wright"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 131,
                    "summary": [
                        "A court-martialed General rallies together twelve hundred inmates to rise against a corrupt and sadistic warden.",
                        "Robert Redford stars in this action drama as General Irwin, a respected three-star tactician whose career ends in disgrace when he's court-martialed and sent to The Castle, a maximum security military prison. Irwin quickly butts heads with the facility's autocratic warden, Colonel Winter (James Gandolfini), who runs his command with an iron fist, even killing prisoners when he deems it necessary. Irwin rallies his fellow convicts into a rag-tag army and leads them in a revolt against Winter, an action that the warden is ready to repel by violent means.",
                        "After one devastating decision, the war-hardened Lieutenant General and former Vietnam POW, Eugene Irwin, finds himself sentenced to sadistic Colonel Winter's impregnable military prison. A leader by nature, it won't be long until the charismatic tactician locks horns with the despotic warden, who rules his fortress with an iron fist, unbeknownst to him, however, that an uprising is brewing. But, in this pit of criminals, all it takes is one true commander to organise the prisoners into an invincible army to rise against oppressive Winter. Can Irwin seize the last castle? —Nick Riganas",
                        "When three star General Irwin is transferred to a maximum security military prison, its warden, Colonel Winter, can't hide his admiration towards the highly decorated and experienced soldier. Irwin has been stripped of his rank for disobedience in a mission, but not of fame. Colonel Winter, who runs the prison with an iron fist, deeply admires the General, but works with completely different methods in order to keep up discipline. After a short while, Irwin can feel Winter's unjust treatment of the inmates. He decides to teach Winter a lesson by taking over command of the facility and thus depriving him of his smug attitude. When Winter decides to participate in what he still thinks of as a game, it may already be too late to win. —Julian Reischl <julianreischl@mac.com>",
                        "Three-star General Irwin, a renowned military tactician, has been court-martialed and sentenced to a maximum security military prison run with an iron fist by its warden, Colonel Winter. Winter can't help but respect the once-legendary general, but that respect turns to hostility as Irwin defiantly confronts the warden on his methods. Their confrontation escalates into war when the general organizes his fellow inmates into an army to take over the prison. —<movies1981@msn.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzZlMTllYjMtZmQ0NS00ZGJkLTg1ODItODM2MmViYjlmNzcyXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20191",
                "_score": 2.552989,
                "_source": {
                    "title": "Su mejor amigo",
                    "rating": 6.2,
                    "year": 2001,
                    "directors": [
                        "Shawn Levy"
                    ],
                    "writers": [
                        "Bruce Kalish"
                    ],
                    "actors": [
                        "Lee Thompson Young",
                        "Lindy Booth",
                        "Nigel Shawn Williams",
                        "Ryan Sommers Baum",
                        "Kerry Duff",
                        "Montrose Hagins",
                        "Gordon Greene",
                        "Melanie Nicholls-King",
                        "Michael Ironside",
                        "Jeff Douglas",
                        "Robert Bockstael",
                        "Tony Munch",
                        "Andrew Tarbet",
                        "Vince Corazza",
                        "Dan Petronijevic",
                        "John Ford",
                        "Derwin Jordan",
                        "Julie Holdsworth",
                        "Jeffrey Knight",
                        "George Kash",
                        "Marie V. Cruz",
                        "Joe Bostwick",
                        "Tim Progosh"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Comedy",
                        "Family",
                        "Sci-Fi"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English"
                    ],
                    "runtime": 100,
                    "summary": [
                        "Jett decides to quit Silverstone and lead a normal life. On the day of his last episode he is hit on the head with a prop and in his dream he is Silverstone. He is the only one who realizes that this is a dream.",
                        "Jett Jackson, who is the star of Silverstone, is considering quitting Silverstone when it is given a three year extension. During the filming of the last episode, Jett is accidently sucked into Silverstone's world when a prop malfunctions. Silverstone is zapped into Jett's world as well. In Silverstone's world, Jett has to save the world from Dr. Kragg's evil plans. —David Klug",
                        "Lee Thompson Young stars as 16-year-old Jett Jackson, whose role as the action hero Silverstone in his hit TV series has catapulted him to mega-stardom. But Jett's finding it increasingly difficult to juggle the demands of show biz with school, family, and friends. Then, a freak accident on the set causes Jett and his on-screen character, Silverstone, to trade places. Now, Jett must save the world from the clutches of the evil Dr. Kragg, while Silverstone faces his own challenge in Jett's world -- teenage life! With no script to follow, can Jett and Silverstone safely find their way back to the realities they knew? —van_whistler@hotmail.co.uk",
                        "Jett Jackson feels like people only know him as Silverstone and decides to quit the show. Meanwhile, the real Silverstone is feeling like he doesn't belong at Mission Omega Matrix anymore. When an accident of the space time continuum makes the two switch lives each must pick up the pieces. —luvsbordercollie"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTU5ODIyODcwOV5BMl5BanBnXkFtZTcwODQ0MDUyMQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20207",
                "_score": 2.552989,
                "_source": {
                    "title": "Aashiq",
                    "rating": 4,
                    "year": 2001,
                    "directors": [
                        "Indra Kumar"
                    ],
                    "writers": [
                        "Rajeev Kaul"
                    ],
                    "actors": [
                        "Bobby Deol",
                        "Karisma Kapoor",
                        "Rahul Dev",
                        "Dinesh Hingoo",
                        "Vrajesh Hirjee",
                        "Smita Jaykar",
                        "Nasir Khan",
                        "Anupam Kher",
                        "Shobha Khote",
                        "Mrinal Kulkarni",
                        "Johny Lever",
                        "Manmauji",
                        "Dina Pathak",
                        "Mukesh Rishi",
                        "Ashok Saraf",
                        "Kashmira Shah",
                        "Anjan Srivastav",
                        "Anandee Tripathi"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Romance"
                    ],
                    "country": "India",
                    "languages": [
                        "Hindi"
                    ],
                    "runtime": 160,
                    "summary": [
                        "Pooja and Chander connect over the telephone and fall in love when they finally meet. However, since Pooja's alcoholic father would never approve, she decides to run away from her house.",
                        "Pooja and Chander Kapoor have a heart-to-heart conversation on the telephone. When they finally meet and all is reveal they both fell in love with each other; Chander lives with his advocate dad Dilip Dev Kapoor while Pooja lives a wealthy but stressful family life with her alcoholic dad, her Dai Maa and a self-senile mother. Unfortunately for them Pooja's parents would like her to marry a person of their choice; this pits Chander against them. Then one day Pooja goes missing and the police headed by a rowdy inspector Mathur arrests Chander for abducting her much to his shock. Then Chander escapes from police custody and begins a man-hunt for Pooja. —gavin (racktoo@hotmail.com)",
                        "Friendly, brave, outgoing, yet shy of the opposite sex, Chander Kapoor, lives an exciting life. To add to this excitement, he helps his friend, Jay, elope with Neena, the daughter of a suspended and rogue police inspector. Neena's friend, Pooja has a crush on Chander, and phones him on the sly, teasing him. When Chander finds out it is Pooja, he too falls in love with her. Pooja family life is stressful, an alcoholic dad, and a spiteful mom. Pooja decides from run away from this atmosphere, and ends up abducted in a brothel. Neena's dad wants to avenge his humiliation, and will go to any length, even kill Chander. With Chander on the defensive with Neena's dad, what will be the outcome of Pooja? —rAjOo (gunwanti@hotmail.com)"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOGNiOWZlODItNTNmYy00NjhiLWE4MjAtODIzNjMzYWFlNmU0XkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_SY150_CR8,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20217",
                "_score": 2.552989,
                "_source": {
                    "title": "Riesgo Xtremo",
                    "rating": 6.5,
                    "year": 2001,
                    "directors": [
                        "Steve Boyum"
                    ],
                    "writers": [
                        "Ann Austen",
                        "Douglas Sloan"
                    ],
                    "actors": [
                        "Alana Austin",
                        "Riley Smith",
                        "Mary-Margaret Humes",
                        "Trever O'Brien",
                        "Timothy Carhart",
                        "Scott Terra",
                        "Michael Cunio",
                        "Mark Curry",
                        "Katherine Ellis",
                        "A.J. Buckley",
                        "Jeremy McGrath",
                        "Travis Pastrana",
                        "Steve Lamson",
                        "Sean Collier",
                        "Ryan Phan",
                        "Christopher Glenn",
                        "Ryan Hansen",
                        "Chad Sakamoto",
                        "Cindy Hogan",
                        "Ashley Nolan",
                        "Angelique De Luca",
                        "Dwight Ketchum",
                        "Larry Naston",
                        "Neil Leestma",
                        "Keith Alan",
                        "Will Roberts",
                        "Aloma Wright",
                        "Jim Berthiaume",
                        "Celestine",
                        "Simon Shelton",
                        "Brystal Geu"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Family",
                        "Sport"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 110,
                    "summary": [
                        "A young girl secretly poses as her twin brother to win the big motocross race for him after he breaks his leg.",
                        "Andrea Carson loves motocross, despite the fact that her father finds her unsuited for the sport, being "just a girl." Her twin brother Andrew breaks his leg just before a big race, and while their father heads to Europe to find a replacement rider, Andrea secretly races in Andrew's place with her mother's help. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZGFhZDhhNWUtNjM1Ny00YWU1LWI1OWMtNzRiNWM2ZTU2ZDRkXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20220",
                "_score": 2.552989,
                "_source": {
                    "title": "Tentáculos asesinos",
                    "rating": 3,
                    "year": 2001,
                    "directors": [
                        "Yossi Wein"
                    ],
                    "writers": [
                        "Boaz Davidson",
                        "Danny Lerner",
                        "Michael D. Weiss"
                    ],
                    "actors": [
                        "Michael Reilly Burke",
                        "Meredith Morton",
                        "Fredric Lehne",
                        "John Thaddeus",
                        "Chris Williams",
                        "Stoyan Angelov",
                        "Paul Vincent O'Connor",
                        "Clement Blake",
                        "Duncan Fraser",
                        "Violeta Markovska",
                        "Mariya Mihailova",
                        "Alexander Kalinov",
                        "Kalin Kalinov",
                        "Bogomil Kalinov",
                        "Mila Atanasova",
                        "Andreya Popdimitrova",
                        "Peter Vasilev",
                        "Miriam Klatman",
                        "Naum Shopov",
                        "Yoana Pendachanska",
                        "Ivaylo Nalbantov",
                        "Shane Edelman",
                        "Harry Anichkin",
                        "Maria Slavcheva",
                        "Peter Kostov",
                        "Velizar Binev",
                        "Nikola Dodov",
                        "Mariana Stansheva",
                        "Anastasiya Ingelizova",
                        "Scott Coulter",
                        "Liat Bein",
                        "Dimiter Kuzov",
                        "Miroslava Bancheva",
                        "Franklin A. Vallette",
                        "Konstantin Rafailov",
                        "Rositza Chorbadjiska",
                        "Georgi Gatzov",
                        "Katerina Goranova",
                        "Malina Germanova"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Horror",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 91,
                    "summary": [
                        "A giant, man-eating octopus suddenly appears in the Hudson River during the Fourth of July weekend and begins to leave a trail of dead bodies behind it.",
                        "Dead bodies are being found in the New York harbor. The police have no clues nor suspects until Nick and his colleague realize the killer is a giant octopus. Everybody, especially the police captain, refuses to believe Nick's story, and soon the harbor will be filled with boats for the 4th of July celebrations... —Calle"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTY4NjQyNDMyNl5BMl5BanBnXkFtZTcwNTE3NjgxMQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20227",
                "_score": 2.552989,
                "_source": {
                    "title": "Johnny English",
                    "rating": 6.2,
                    "year": 2003,
                    "directors": [
                        "Peter Howitt"
                    ],
                    "writers": [
                        "Neal Purvis",
                        "Robert Wade",
                        "Will Davies",
                        "Peter Howitt"
                    ],
                    "actors": [
                        "Rowan Atkinson",
                        "Tasha de Vasconcelos",
                        "Ben Miller",
                        "Greg Wise",
                        "Douglas McFerran",
                        "Steve Nicolson",
                        "Terence Harvey",
                        "Kevin McNally",
                        "Tim Pigott-Smith",
                        "Nina Young",
                        "Rowland Davies",
                        "Natalie Imbruglia",
                        "Philippa Fordham",
                        "John Malkovich",
                        "Tim Berrington",
                        "Simon Bernstein",
                        "Martin Lawton",
                        "Neville Phillips",
                        "Oliver Ford Davies",
                        "Takuya Matsumoto",
                        "Peter Tenn",
                        "Sam Beazley",
                        "Kevin Moore",
                        "Faruk Pruti",
                        "Marc Danbury",
                        "Jack Raymond",
                        "Jenny Galloway",
                        "Haylie Ecker",
                        "Tania Davis",
                        "Eos Chater",
                        "Gay-Yee Westerhoff",
                        "Chris Tarrant",
                        "James Greene",
                        "Clive Graham",
                        "Trevor McDonald",
                        "Clare Beckwith",
                        "James Embree",
                        "Irene Hamilton",
                        "Philip Harvey",
                        "Peter Howitt",
                        "Serena Lorien",
                        "Norman Campbell Rees",
                        "Laurence Richardson",
                        "Scott Samain",
                        "Prunella Scales",
                        "Leonard Silver",
                        "Tina Simmons",
                        "Glenn Webster",
                        "Yana Yanezic"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Comedy"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English",
                        "French",
                        "Japanese"
                    ],
                    "runtime": 89,
                    "summary": " Johnny English is a kindhearted and well-intentioned but clumsy MI7 employee, working a desk job while dreaming of being their most trusted agent. After Agent One dies in a submarine accident unknowingly caused by English, the remaining agents are killed by a bombing at Agent One's funeral, again due to English's incompetence, leaving English as the lone surviving agent capable of finishing Agent One's mission.Assigned to thwart a plot to steal the newly restored Crown Jewels, English meets the mysterious Lorna Campbell at the jewels' unveiling at the Tower of London. During a sudden blackout, the jewels are stolen. In the chaotic aftermath, English accidentally knocks out the deputy head of security and pretends to fight an imaginary "assailant" to cover his mistakes; he makes up a false description of the suspect to MI7 head Pegasus.English and his assistant Angus Bough discover the jewels were removed via a hole dug beneath their display case. Following the tunnel, they confront the German thieves Dieter Klein and Klaus Vendetta, who escape in a hearse. After pursuing the wrong hearse, English gatecrashes a funeral. Bough comes to his rescue, pretending English is an escaped mental patient and posing as a doctor from the "Lunatic Response Unit".English connects the thieves to Pascal Sauvage, a French prison entrepreneur who helped restore the jewels. Pegasus finds English's claims absurd and warns English not to involve Sauvage, as he is his personal friend. In the car park, English and Bough are attacked by Vendetta but are unharmed. English again encounters Campbell in a YO! Sushi restaurant, recognising her pink motorcycle. Having seen her at two crime scenes, English's suspicions deepen when her records cannot be found on any government computer.English and Bough parachute into Sauvage's headquarters, but English mistakenly lands on an identical tower, the City Hospital. Reaching the correct building, the two learn that Sauvage, a descendant of Charles Edward Stuart, plans to make himself King, using an impostor to impersonate the Archbishop of Canterbury. Campbell arrives, revealed to be an Interpol agent tracking Sauvage. With evidence of Sauvage's involvement, English crashes a reception hosted by Sauvage but is suspended by Pegasus for his clumsy actions.Sauvage scraps his plan to use the fake Archbishop and instead sends his minions to force Queen Elizabeth II to abdicate by threatening her corgis, causing the entire line of succession to be swept clean for Sauvage to become King. Campbell, now placed in charge of the assignment by Pegasus, visits the depressed English and convinces him to travel with her to Sauvage's French château to investigate. Eavesdropping on Sauvage's meeting with internationally renowned criminals, English and Campbell learn he plans to transform all of England into the world's biggest prison. The agents are exposed when English accidentally activates a microphone, and they are taken prisoner.Bough rescues English and Campbell and they race to stop Sauvage's coronation. English crashes the coronation and discovers the Archbishop in attendance is genuine. Undeterred, English orders Bough to play the incriminating DVD, only to find it is footage of himself lip-syncing to ABBA's "Does Your Mother Know" in his underclothes; Sauvage had bugged English's flat. Sneaking away, English swings in to steal St. Edward's Crown from the Archbishop. Sauvage attempts to kill English, who drops the crown. However, English falls from the wire, lands on the throne, and is crowned instead. In his singular act as King, English has Sauvage arrested by MI7. Upon her return to the throne, the Queen, at English's request, confers a knighthood on him as a reward for his services, and Sauvage is placed in custody awaiting trial for high treason; because this crime carries the death penalty, he requests that his brain be donated to science for research on hyper-maniac schizophrenia if he is found guilty.English and Campbell drive to southern France for a romantic holiday, only for English to accidentally eject her out of his car while leaning in to kiss her. In a mid-credits scene, Campbell lands in a hotel swimming pool, where Bough is vacationing alongside a man identical to the fictitious assailant English described to Pegasus. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDkxODhlNmItYjhiMC00ZjNmLWE2YmMtOTQ3NmQxM2YzOGFiXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20240",
                "_score": 2.552989,
                "_source": {
                    "title": "The Pretender: Island of the Haunted",
                    "rating": 7.2,
                    "year": 2001,
                    "directors": [
                        "Frederick King Keller"
                    ],
                    "writers": [
                        "Steven Long Mitchell",
                        "Craig W. Van Sickle"
                    ],
                    "actors": [
                        "Michael T. Weiss",
                        "Andrea Parker",
                        "Patrick Bauchau",
                        "Jon Gries",
                        "Harve Presnell",
                        "Richard Marcus",
                        "James Denton",
                        "Paul Dillon",
                        "Diana Leblanc",
                        "John Bourgeois",
                        "Jack Langedijk",
                        "Julian Richings",
                        "Conrad Coates",
                        "Dean McKenzie",
                        "Chloe Randle-Reis",
                        "Sam Ayers",
                        "Glenn Bang",
                        "Neil Crone",
                        "Dennis Cruzado",
                        "Frank McAnulty",
                        "Kim Myers"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 91,
                    "summary": [
                        "Through a series of bizarre circumstances, Jarod and Miss Parker find themselves trapped together on a strange island in a life and death situation, out of which come some of the most important revelations about their pasts."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTI5ODUxMDA4OF5BMl5BanBnXkFtZTcwMTkxNDg0MQ@@._V1_SY150_CR4,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20245",
                "_score": 2.552989,
                "_source": {
                    "title": "Atrapados en el espacio",
                    "rating": 3.1,
                    "year": 2002,
                    "directors": [
                        "Fred Olen Ray"
                    ],
                    "writers": [
                        "Steve Latshaw"
                    ],
                    "actors": [
                        "Michael Dudikoff",
                        "Ice-T",
                        "Hannes Jaenicke",
                        "Yvette Nipar",
                        "Chick Vennera",
                        "WC",
                        "Larry Poindexter",
                        "Michael Cavanaugh",
                        "Art Hindle",
                        "Kelly Haren",
                        "Alex Veadov",
                        "Andrew Stevens",
                        "Lada Boder",
                        "Robert Donavan",
                        "Richard Gabai",
                        "Marc Vahanian",
                        "Jim Valdez",
                        "Neil Daly"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Drama",
                        "Fantasy",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 92,
                    "summary": [
                        "Americans and Russians are stranded aboard a damaged space station. A rescue crew is sent from earth, including Carpenter (Michael Dudikoff) and Jack McKendrick (Hannes Jaenicke). When attempting to return to earth, the astronauts find that the reentry codes have been changed. While the astronauts are helpless and stranded, Jeffries (Ice-T) pursues a Russian man who knows the new codes. —Ken Miller <wkmiller704@yahoo.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTI0NjcwMTE3NV5BMl5BanBnXkFtZTcwMTU0MTUyMQ@@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20247",
                "_score": 2.552989,
                "_source": {
                    "title": "Veneno mortal",
                    "rating": 3.9,
                    "year": 2001,
                    "directors": [
                        "Fred Olen Ray"
                    ],
                    "writers": [
                        "Dan Golden",
                        "Sean McGinly"
                    ],
                    "actors": [
                        "Treat Williams",
                        "Mary Page Keller",
                        "Hannes Jaenicke",
                        "Catherine Dent",
                        "Tony Denison",
                        "Geoff Pierson",
                        "Brian Poth",
                        "Nicole Nieth",
                        "Christal Chacon",
                        "Jim Storm",
                        "Rick Hurst",
                        "Melissa Hayden",
                        "Marc McClure",
                        "Andrew Stevens",
                        "Chas. Allan",
                        "Anthony Azizi",
                        "Larry Carroll",
                        "Greg Collins",
                        "Lee de Broux",
                        "Helen Duffy",
                        "J.B. Gaynor",
                        "Ron Harper",
                        "Jesse Lenat",
                        "Ted Monte",
                        "Meilani Paul",
                        "Kimberly A. Ray",
                        "Max Olen Ray",
                        "Marc Vahanian",
                        "Neal Hickerson",
                        "Hilary Adahms",
                        "Greg Stanina"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Horror",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 97,
                    "summary": [
                        "Mutant snakes survived a terrorist attack on a government laboratory, and they now threaten the town of Santa Mira Springs, California. Seismic activity has brought snakes to the surface, where residents are being bitten. Victims can transmit the virus to healthy persons. The military puts the town under quarantine. Local physicians try to control the epidemic, while the military is primarily concerned with keeping the virus a secret. —wkmiller704@yahoo.com"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTIyMDQyNTA2Nl5BMl5BanBnXkFtZTcwMDExNDEyMQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20249",
                "_score": 2.552989,
                "_source": {
                    "title": "Musa",
                    "rating": 7.2,
                    "year": 2001,
                    "directors": [
                        "Sung-su Kim"
                    ],
                    "writers": [
                        "Sung-su Kim"
                    ],
                    "actors": [
                        "Jung Woo-sung",
                        "Sung-Ki Ahn",
                        "Ju Jin-Mo",
                        "Ziyi Zhang",
                        "Yong-woo Park",
                        "Jeong-hak Park",
                        "Hae-Jin Yoo",
                        "Jung Suk-yong",
                        "Du-il Lee",
                        "Yeong-mok Han",
                        "Gi-ho Heo",
                        "Er Cha Huo",
                        "Byeong-guk Hwang",
                        "Mi-nam Jeong",
                        "Hong-Pyo Lee",
                        "Jae-ho Song",
                        "Ha-jin Yu",
                        "Rongguang Yu",
                        "Nick Gray"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "South Korea",
                    "languages": [
                        "Korean",
                        "Mandarin"
                    ],
                    "runtime": 158,
                    "summary": " In 1375, a small political envoy travels to China to meet the Ming Emperor. Mistaken for spies, the envoy is arrested. Their prisoner transport is attacked by Mongol marauders, who kill the Chinese guards and allow the Koreans to live. All the Korean ambassadors have died, leaving the inexperienced general to take charge. The soldiers arm themselves and quickly discover that the Mongols have kidnapped the Ming Emperor's daughter. They ambush the Mongols and rescue the princess. Yeo-sol, the former slave of an ambassador, defeats the injured Mongolian general Rambulwha in single combat, but allows him to live and escape.The Koreans flee with the Princess, determined to return her safely to the Ming Emperor to atone for their diplomatic failure. The Mongols pursue, hoping to recover the Princess and marry her to the Yuan Emperor so that he may legitimize his claim over all China. Koreans head for a seaside fortress that the Princess tells them about, where they expect to find safe haven. Along the way, the Koreans pick up a group of Chinese peasants who are also fleeing from the Mongols.Fighting their way through Mongol search parties, the group experiences many internal conflicts stemming from social class, love, and honor. The lower-class soldiers chafe under their poor treatment in comparison to the soldiers of the upper-class. They have little confidence in their young general, and prefer taking orders from their veteran sergeant, Dae-Jung. The Princess has difficulty adjusting to the rough necessities of her position on the run. The General and Yeo-sol become nemeses, competing for the affections of the Princess and exchanging blows on several occasions.The group reaches the fortress, only to find it an abandoned ruin. As the group prepare to mount a last stand, the Princess attempts to give herself up to the Mongols. Yeo-sol and the General recover her, and Yeo-sol is captured. Rambulwha offers a place in his army for Yeo-sol, but as the Mongols mount an offensive, Yeo-sol returns to the Koreans. In the final battle, the Koreans' gunpowder defenses backfire. Yeo-sol sacrifices his life to save the Princess, while the General dies fighting the Mongol general, who is also killed. All the Mongols perish, while all the Koreans are killed except Dae-Jung. The Princess stays with the peasants at the fortress and promises to tell her father of the Koreans' sacrifice. Dae-Jung builds a boat and sails back to Korea. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BZWU5YWEwYzUtM2FjMC00YWMzLThjNWYtY2MyZDNkNmZjMTk1XkEyXkFqcGdeQXVyNjk5NzY4OTk@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20253",
                "_score": 2.552989,
                "_source": {
                    "title": "Blood: El último vampiro",
                    "rating": 6.6,
                    "year": 2000,
                    "directors": [
                        "Hiroyuki Kitakubo"
                    ],
                    "writers": [
                        "Kenji Kamiyama",
                        "Katsuya Terada"
                    ],
                    "actors": [
                        "Yûki Kudô",
                        "Saemi Nakamura",
                        "Joe Romersa",
                        "Stuart Robinson",
                        "Rebecca Forstadt",
                        "Akira Koieyama",
                        "Tom Fahn",
                        "Fitz Houston",
                        "Steve Blum",
                        "Mitsuo Senda",
                        "Paul Carr",
                        "Fumiko Ôsaka",
                        "Kaori Koyama",
                        "Chuck Campbell",
                        "Sen Hoshino",
                        "Hiroaki Hirata",
                        "Katsuhiro Kitagawa",
                        "Dave Mallow",
                        "Kenichi Ono"
                    ],
                    "genres": [
                        "Animation",
                        "Action",
                        "Horror"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese",
                        "English"
                    ],
                    "runtime": 48,
                    "summary": " The year is 1966. Saya is the only remaining original vampire, and she hunts Chiropterrans--demons who live off human blood. Saya's a testy and demanding little bitch but apparently very valuable to "the top." Her next assignment, as her boss David explains it to her, is to infiltrate the U.S. Yokota Air Base's High School, which has been the scene of several deaths in the past and is thought to be harboring at least two Chiropterrans. Saya's cover is that of a student who will be participating in classes for a few days.Saya's first day at Yokota High is pretty uneventful. After classes are over and everyone has cleared out, Saya snoops around the school and learns that blood has been spilled on the floor in the infirmary. She suspects that the infirmary is the Chiropterrans' feeding room. The next day is the school's Halloween party. After school lets out, the students change into their costumes and head for the dance...all except for Sharon and Linda, that is. Linda isn't feeling well, and Sharon thinks it's a flare-up of Linda's anemia, so she's going to walk Linda over to the infirmary and they will attend the party later. Saya enters the infirmary just as Sharon and Linda are about to feed on nurse Makiho Amano. Linda changes her form into Chiropterran, and Saya slays her with her sword. Saya turns on Sharon and wounds her, but Sharon gets away, spilling blood as she flees. The astonished nurse follows the trail, which leads to the dance hall where she finds Sharon in Chiropterran form hiding under a blanket. While Saya battles the creature, Makiho runs for help.Meanwhile, at a nearby bar, the mama-san sets the bar on fire, takes Chiropterran form, and heads for the army base. She kills the military guard who is escorting the Makiho back to the dance. Saya saves the terrified nurse, and they take refuge in a military garage, but the demon finds them. Saya, without her sword, battles the creature with a shovel while Makiho hops in a jeep and rams through the door. David, who has been looking for Saya and was standing outside the garage, tosses a sword to Saya, and she chops the demon (Sharon) in half. As Saya and David take Makiho from the jeep and lay her unconscious form gently in the grass, they see the mama-san in demon form on the roof, preparing to fly away. David and Saya follow in the jeep. The Chiropterran tries to escape by landing on the wing of a military jet tooling down the runway. The jeep gives chase, and Saya slays the monster. As the Chiropterran lies dying on the runway, Saya feeds it with a few drops of her own blood.Epilogue: Makiho attempts to describe what she saw to the military brass, but she has little proof of anything. When she returned to the infirmary, Linda's body was no longer there and the bloody mess had been cleaned up. The military brass deny knowing anything about David, but they do show Makiho a photo taken in 1892 that clearly shows Saya and has the word "Vampire" written on it. Makiho returns to her office, wondering to herself whether Saya is still around and still fighting demons, "just as we humans continue to kill each other." At that moment, an announcement comes over the radio that the Liberation Front has attacked the American Blake base and that Yokota base personnel have been ordered to fly to Don Hoi in North Vietnam. As the credits roll, the background shows some very blurry photos of what looks like American forces in Vietnam. [Original Synopsis by bj_kuehl] [Edited by m-lissa1] ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BN2I0ZWIwZjktZThjOS00YTI3LTlhOGQtMzNmOTQxYmUyZjM0XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20255",
                "_score": 2.552989,
                "_source": {
                    "title": "Cowboy Bebop: La película",
                    "rating": 7.8,
                    "year": 2001,
                    "directors": [
                        "Shin'ichirô Watanabe",
                        "Tensai Okamura",
                        "Hiroyuki Okiura"
                    ],
                    "writers": [
                        "Keiko Nobumoto",
                        "Hajime Yatate"
                    ],
                    "actors": [
                        "Kôichi Yamadera",
                        "Unshô Ishizuka",
                        "Megumi Hayashibara",
                        "Aoi Tada",
                        "Yûsaku Yara",
                        "Kazuhiko Inoue",
                        "Jûrôta Kosugi",
                        "Kinryû Arimoto",
                        "Hidekatsu Shibata",
                        "Yûji Ueda",
                        "Nobuo Tobita",
                        "Rikiya Koyama",
                        "Ai Kobayashi",
                        "Jin Hirao",
                        "Toshihiko Nakajima",
                        "Hiroshi Naka",
                        "Tsutomu Tareki",
                        "Miki Nagasawa",
                        "Renji Ishibashi",
                        "Yôsuke Akimoto",
                        "Kazuya Ichijô",
                        "Eisuke Yoda",
                        "Takashi Nagasako",
                        "Mickey Curtis",
                        "Takehiro Koyama",
                        "Yutaka Nakano",
                        "Houko Kuwashima",
                        "Masuo Amada",
                        "Junichi Sugawara",
                        "Isshin Chiba",
                        "Katsuyuki Konishi",
                        "Kujira",
                        "Kazusa Murai",
                        "Tsutomu Isobe",
                        "Steve Blum",
                        "Beau Billingslea",
                        "Wendee Lee",
                        "Melissa Fahn",
                        "Daran Norris",
                        "Jennifer Hale",
                        "Nicholas Guest",
                        "Dave Wittenberg",
                        "Tom Wyner",
                        "J. Grant Albrecht",
                        "Jerry Gelb",
                        "Michael Reisz",
                        "Mike Reynolds",
                        "Mirron E. Willis",
                        "Kirk Thornton",
                        "Michael Gregory",
                        "John Snyder",
                        "Paul St. Peter",
                        "Lia Sargent",
                        "Mary Elizabeth McGlynn",
                        "Doug Stone",
                        "Murphy Dunne",
                        "Michael Forest",
                        "Michelle Ruff",
                        "William Frederick Knight",
                        "Steve Kramer",
                        "Crispin Freeman",
                        "Kirk Baily",
                        "Jamieson Price",
                        "Barbara Goodson",
                        "Ron Roggé",
                        "Bob Papenbrook",
                        "Peter Spellos",
                        "Michael Lindsay",
                        "Fred Toma",
                        "Said Faraj",
                        "Hani Al Naimi",
                        "Ewan Chung",
                        "Dorothy Elias-Fahn",
                        "Lex Lang",
                        "Peter Lurie",
                        "Jad Mager",
                        "Joe Ochman",
                        "Brianne Brozey",
                        "Carol Stanzione",
                        "Lynsey McLeod",
                        "Leslie Hicks",
                        "Peggy O'Neal",
                        "Frank Catalano",
                        "Kevin Seymour"
                    ],
                    "genres": [
                        "Animation",
                        "Action",
                        "Crime",
                        "Drama",
                        "Sci-Fi"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese",
                        "English"
                    ],
                    "runtime": 115,
                    "summary": [
                        "A terrorist explosion releases a deadly virus on the masses, and it's up to the bounty-hunting Bebop crew to catch the cold-blooded culprit.",
                        "The year is 2071. Following a terrorist bombing, a deadly virus is released on the populace of Mars and the government has issued a 300 million woo-long reward, the largest bounty in history, for the capture of whoever is behind it. The bounty hunter crew of the spaceship Bebop; Spike, Faye, Jet and Ed, take the case with hopes of cashing in the bounty. However, the mystery surrounding the man responsible, Vincent, goes deeper than they ever imagined, and they aren't the only ones hunting him. The original creators of the virus have dispatched Electra to deal with Vincent and take out anyone who may stumble on the truth behind him. As the hunt for the man with no past and no future continues to escalate, they begin to question what about the world is reality and what is a dream as the line between sanity and insanity becomes more apparent. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDUxNDM4ODAtNmFkMC00NTg3LTkwNTItYTVkOWFjYmExOGVjXkEyXkFqcGdeQXVyODY5Njk4Njc@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20265",
                "_score": 2.552989,
                "_source": {
                    "title": "Snipes",
                    "rating": 5.5,
                    "year": 2001,
                    "directors": [
                        "Rich Murray"
                    ],
                    "writers": [
                        "Rob Wiser",
                        "Rich Murray"
                    ],
                    "actors": [
                        "Sam Jones III",
                        "Nelly",
                        "Zoe Saldana",
                        "Dean Winters",
                        "Rashaan Nall",
                        "Schooly-D",
                        "Joel Marsh Garland",
                        "J.D. Williams",
                        "Mpho Koaho",
                        "Victor Togunde",
                        "Carlo Alban",
                        "Rich Heidelberg",
                        "Charli Baltimore",
                        "Frank Vincent",
                        "Johnnie Hobbs Jr.",
                        "Ophelia M. Turner",
                        "Jessica Maria Rodriguez",
                        "Heather Hunter",
                        "Larry Mendte",
                        "Kevin Anthony",
                        "Andy Ranley",
                        "Brandon E. Brooks",
                        "Fannie Chan",
                        "Sal Darigo",
                        "Jessica Leccia",
                        "Dante Suarez",
                        "Bolden Abrams Jr.",
                        "Antonio Costa",
                        "Tim Crum",
                        "Paul Manion"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Music",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 113,
                    "summary": [
                        "Erik is an ambitious teenager who spends more time posting fliers for his favorite rapper, Prolifik, than sitting in the classroom. When he and his best friend stumble across a dead body one night, they trigger a series of tragic events."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTYwMjM5NzczMl5BMl5BanBnXkFtZTcwMTc2ODMyMQ@@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20268",
                "_score": 2.552989,
                "_source": {
                    "title": "Versus",
                    "rating": 6.3,
                    "year": 2000,
                    "directors": [
                        "Ryûhei Kitamura"
                    ],
                    "writers": [
                        "Ryûhei Kitamura",
                        "Yûdai Yamaguchi"
                    ],
                    "actors": [
                        "Tak Sakaguchi",
                        "Hideo Sakaki",
                        "Chieko Misaka",
                        "Kenji Matsuda",
                        "Yuichiro Arai",
                        "Minoru Matsumoto",
                        "Kazuhito Ohba",
                        "Takehiro Katayama",
                        "Ayumi Yoshihara",
                        "Shôichirô Masumoto",
                        "Toshiro Kamiaka",
                        "Yukihito Tanikado",
                        "Hoshimi Asai",
                        "Ryosuke Watabe",
                        "Motonari Komiya",
                        "Reika Kirishima",
                        "Hideo Kojima"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "Fantasy",
                        "Horror",
                        "Thriller"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese",
                        "English"
                    ],
                    "runtime": 119,
                    "summary": [
                        "There are 666 portals that connect this world to the other side. These are concealed from all human beings. Somewhere in Japan exists the 444th portal.... The forest of resurrection.",
                        "Set in the present where a group of ruthless gangsters, an unknown woman and an escaped convict have met, unwittingly, in The Forest of Resurrection, the 444th portal to the other side. Their troubles start when those once killed and buried in the forest come back from the dead, with the assistance of the evil Sprit that has also come back, come back from ages past, to claim his prize. The final standoff between Light and Dark has never been so cunning, so brutal and so deadly. This is where old Japanese Samurai mysticism meets the new world of the gangster and the gun. Gruesome, bloody and positively bold. —Cinema_Fan",
                        "A pair of escaped convicts meet up with a group of gangsters by a remote forest road. After an arguement over a girl the mobsters have kidnapped, shots are fired and one of the gangsters is killed. The standoff is cut short, however, when the dead man suddenly springs to life and starts trying to kill his former friends. The zombie eventually goes down in a hail bullets, but their problems aren't over. It seems the gangsters have been using this forest to dispose of of their victims, all of whom are now looking to settle some old scores. Even if they get through this mess, there is still the question of why they've arranged to meet the convicts out here, and why they've brought along the girl. How are they connected to the dead bodies coming back to life? —Jean-Marc Rocher <rocher@fiberbit.net>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGJkM2M2MmYtOTgzZi00MTkwLTgwN2UtZGYzMDdmYWEzMGE0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20271",
                "_score": 2.552989,
                "_source": {
                    "title": "El protector",
                    "rating": 5.1,
                    "year": 2002,
                    "directors": [
                        "Martyn Burke"
                    ],
                    "writers": [
                        "William Porter",
                        "William Porter",
                        "Steve Mackall"
                    ],
                    "actors": [
                        "Sylvester Stallone",
                        "Madeleine Stowe",
                        "Anthony Quinn",
                        "Raoul Bova",
                        "Harry Van Gorkum",
                        "Billy Gardell",
                        "George Touliatos",
                        "Angelo Celeste",
                        "Ezra Perlman",
                        "Carin Moffat",
                        "John Gilbert",
                        "Dawn Greenhalgh",
                        "Angelo Tsarouchas",
                        "Nancy Beatty",
                        "Lori Alter",
                        "Kristina Nicoll",
                        "Gino Marrocco",
                        "Francesco Zimone",
                        "Brandon Carrera",
                        "Sandra Biondi",
                        "Gema Zamprogna",
                        "Olivia Jones",
                        "Katie Evans",
                        "Julie Jones",
                        "Curtis Sullivan",
                        "Laird Mackintosh",
                        "Luciana Calvet",
                        "Kevin Law",
                        "Jeremy Nasmith",
                        "Luke Scheuer",
                        "Barbara Szablowski",
                        "Jeannette Zingg",
                        "Ola Sturik",
                        "Boyd Banks",
                        "Sharon Heldt",
                        "Joan Giammarco",
                        "Lynn MacKenzie",
                        "Ben E. Nason",
                        "Elisa Tibollo",
                        "Franco Vella",
                        "Chris Astoyan",
                        "John MacDonald",
                        "Polli Magaro",
                        "Michael Sercerchi"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Romance"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 97,
                    "summary": [
                        "A woman who has just discovered she is the daughter of a murdered Mafia chieftain seeks revenge, with the aide of her father's faithful bodyguard.",
                        "A woman who has recently discovered that she is the daughter of Angelo, a major mafia boss, decides to wreak vengeance when he is killed by a hitman. She's aided by his faithful bodyguard, with whom she soon falls in love. —Jason"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzFmZDM0NDctNTk2Ny00ZjVmLTkwODItMWUxYzIwMGIzYzEzXkEyXkFqcGdeQXVyMjMwNDgzNjc@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20289",
                "_score": 2.552989,
                "_source": {
                    "title": "Below",
                    "rating": 6.1,
                    "year": 2002,
                    "directors": [
                        "David Twohy"
                    ],
                    "writers": [
                        "Lucas Sussman",
                        "Darren Aronofsky",
                        "David Twohy"
                    ],
                    "actors": [
                        "Matthew Davis",
                        "Bruce Greenwood",
                        "Holt McCallany",
                        "Dexter Fletcher",
                        "Nick Chinlund",
                        "Olivia Williams",
                        "Scott Foley",
                        "Andrew Howard",
                        "Christopher Fairbank",
                        "Chuck Ellsworth",
                        "Crispin Layfield",
                        "Jonathan Hartman",
                        "Sebastian Knapp",
                        "Max Casali",
                        "Alexis Conran",
                        "Jason Flemyng",
                        "Matthew Leitch",
                        "Gary Broadway",
                        "Tim Plester",
                        "Craig Blake",
                        "Zach Galifianakis",
                        "Mitchell Barnett",
                        "David Crow",
                        "Nick Hobbs",
                        "Chris Bridgeman",
                        "David Twohy",
                        "Paul Bayfield",
                        "Gary Bunn",
                        "John Colton",
                        "David Gries",
                        "DJ Perry"
                    ],
                    "genres": [
                        "Action",
                        "Horror",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 105,
                    "summary": [
                        "Strange happenings occur on a WW II submarine.",
                        "In the dark silence of the sea during World War II, the submarine U.S.S. Tiger Shark prowls on what should be a routine rescue mission. But, for the shell-shocked crew, trapped together in the sub's narrow corridors and constricted spaces, this is about to become a journey into the sensory delusions, mental deceptions and runaway fear that lurk just below the surface of the ocean and deep inside the human psyche. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTUxOGY0MTMtOWNkZS00NThlLWIzZDktMWJmMjQ4N2IyNWY4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20298",
                "_score": 2.552989,
                "_source": {
                    "title": "Electric Dragon 80.000 V",
                    "rating": 6.8,
                    "year": 2001,
                    "directors": [
                        "Gakuryû Ishii"
                    ],
                    "writers": [
                        "Gakuryû Ishii"
                    ],
                    "actors": [
                        "Yoshiki Arizono",
                        "Tadanobu Asano",
                        "Masakatsu Funaki",
                        "Masatoshi Nagase"
                    ],
                    "genres": [
                        "Action",
                        "Fantasy",
                        "Sci-Fi",
                        "Thriller"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese"
                    ],
                    "runtime": 55,
                    "summary": [
                        "A violent, guitar-playing, electrically charged boxer faces off against an electronic wizard half-merged with a metallic Buddha.",
                        "A young boy gets jolted with electricity as he's climbing a tall cable pylon. As he gets older, he experiences intense fits of violence in which bolts of electricity burt from his fists. Elsewhere in Tokyo, there is an electronics wizard who also happens to be a vigilante with a taste for electric weapons. When the pair catch each other's attention, the result is a battle that will light up the city. —Jean-Marc Rocher <rocher@fiberbit.net>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzdlZWU0YjUtZWZmZi00ODQ3LTg3ZjctZjFlZjNhYTFhZDQ2XkEyXkFqcGdeQXVyOTIxNDQ1MTQ@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20304",
                "_score": 2.552989,
                "_source": {
                    "title": "The Scorpion King",
                    "rating": 5.5,
                    "year": 2002,
                    "directors": [
                        "Chuck Russell"
                    ],
                    "writers": [
                        "Stephen Sommers",
                        "Jonathan Hales",
                        "Stephen Sommers",
                        "William Osborne",
                        "David Hayter",
                        "Stephen Sommers"
                    ],
                    "actors": [
                        "Dwayne Johnson",
                        "Steven Brand",
                        "Michael Clarke Duncan",
                        "Kelly Hu",
                        "Bernard Hill",
                        "Grant Heslov",
                        "Peter Facinelli",
                        "Ralf Moeller",
                        "Branscombe Richmond",
                        "Roger Rees",
                        "Sherri Howard",
                        "Conrad Roberts",
                        "Joseph Ruskin",
                        "Esteban Cueto",
                        "Nils Allen Stewart",
                        "Scott L. Schwartz",
                        "Andre Henschel",
                        "Michael Hilow",
                        "Nick Hermz",
                        "Wesley John",
                        "Michelle Baney",
                        "Barry Kramer",
                        "Marissa McMahon",
                        "Tim Iannello",
                        "K.D. Aubert",
                        "Sonia Vera",
                        "Angelica Castro",
                        "Tutu Sweeney",
                        "Yuki Tokuhiro",
                        "Te'Amir Sweeney",
                        "Al Leong",
                        "Woon Young Park",
                        "Marcus Young",
                        "Paul Sloan",
                        "Talani Rabb",
                        "Sole Alberti",
                        "Cristina Rodríguez",
                        "Pennelope Jimenez",
                        "Sean Michael Afable",
                        "Adoni Maropis",
                        "Bernard White",
                        "Amy Hunter",
                        "Diana R. Lupo",
                        "Heather Burton",
                        "Nikki Flux",
                        "Rachel Moore",
                        "Summer Altice",
                        "Brandon Gonzalez",
                        "Peter Quartaroli",
                        "Peter Navy Tuiasosopo",
                        "Amanda Bentley",
                        "Claudi E. Orellana",
                        "Jim Maniaci",
                        "Shant Demirjian",
                        "Gus Rethwisch",
                        "Richard Cetrone",
                        "Job Alonso",
                        "Kitana Baker",
                        "Jennifer Bobiwash",
                        "Christie Campagna",
                        "Tracy Dali",
                        "Rose Davidson",
                        "Skye Dennis",
                        "Wayne Eric",
                        "Amy Fadhli",
                        "Joss Gomez",
                        "Tony Gracia",
                        "Zuhair Haddad",
                        "Jamie Hagan",
                        "Prince Thompson Iyamu",
                        "Tyler Mane",
                        "Julie Michaels",
                        "George D. Miklos",
                        "Radhaa Nilia",
                        "Somaya Reece",
                        "Mailon Rivera",
                        "Rachelle Roderick",
                        "Marcio Rosario",
                        "Terence J. Rotolo",
                        "Bobby Silva",
                        "Andrei Sterling",
                        "Joseph Steven",
                        "Tai",
                        "Ed Verreaux",
                        "Mark Winn"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Fantasy"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 92,
                    "summary": " "Before the time of the pyramids,
                    " a horde from the East invades the ancient world, led by the ruthless Memnon, who by their law, is king for being their greatest warrior. His many victories come from the help of a sorcerer who predicts the outcomes of battles, leaving only a few free tribes to oppose him.Mathayus, his half-brother Jesup, and friend Rama, the only three true remaining Akkadians, are hired by King Pheron of the last free tribes to kill Memnon's sorcerer for twenty blood rubies, upsetting Pheron's son Takmet, as it is the last of their treasury, and Nubian King Balthazar, who dislikes the Akkadians. The Akkadians manage to sneak into Memnon's camp, but are ambushed by Memnon's guards, having been tipped off by Takmet who killed his own father and defected to Memnon's side. Jesup and Rama are hit by arrows, but Mathayus manages to sneak into the sorcerer's tent, where he sees that the sorcerer is actually a sorceress named Cassandra. Mathayus is then captured and meets Memnon himself, who brutally executes Jesup in front of him, and is about to kill Mathayus too. Cassandra, however, tells Memnon that the gods wish Mathayus to survive the night, and to defy them would incur their wrath and cost him his victories. Memnon has Mathayus buried to his neck in the desert to be devoured by fire ants at dawn, but manages to escape with help from a horse thief, Arpid.Deciding to finish his mission and avenge his brother, Mathayus sneaks into Memnon's stronghold, Gomorrah, and manages to enter Memnon's palace with help from a street urchin. He briefly meets Memnon's court magician, Philos, who hides him and then directs him to the courtyard where Memnon is training. Mathayus tries to shoot Memnon from the watchtower, but is forced to save the street urchin from having his hand amputated for his theft by shooting the axe out of Takmet's hand, alerting the guards to his presence. Mathayus only barely manages to escape Gomorrah, abducting Cassandra along the way, knowing that Memnon will come for her.Cassandra tries to escape from Mathayus and even tells him that she has been Memnon's prisoner since she was a child. Sympathetic, Mathayus allows her the choice of leaving, but warns her of worse dangers and that she is likely safer with him. However, Memnon sends his right-hand man Thorak and a group of guards to kill Mathayus and retrieve Cassandra, but Mathayus manages to slay them all under the cover of a sandstorm, while dueling and fatally stabbing Thorak in the abdomen. With his dying breaths, Thorak manages to stab Mathayus in the leg with a scorpion blood-laced arrow. Cassandra, however, uses her magic to save Mathayus's life. As an insult and a warning, Mathayus sends Thorak's blood-stained pendant to Memnon.Mathayus, Arpid and Cassandra then run into Philos, who earlier fled Memnon's palace and has perfected an explosive powder he was working on. However, they are ambushed by the rebels, now under the rule of Balthazar. Though Mathayus defeats Balthazar in a fight and earns his grudging respect and sanctuary, Cassandra has a vision of Memnon and his army slaughtering the entire rebel camp. She informs Mathayus and then prophesies that when the moonlight reaches the Memnon's palace, the King on High will become the invincible Scorpion King, and Memnon believes himself to be the one destined to become the Scorpion King. Furthermore, she informs Mathayus that if he faces Memnon, he will most likely die. She tells Mathayus that she foresees him being shot, but Mathayus assures her that he will make his own destiny and they make love.The next morning, however, Cassandra returns to Memnon in order to stall him and possibly kill him. Mathayus, with help from Balthazar, Arpid, Philos and the army of rebels, launches an all-out assault on Memnon's stronghold, facing Memnon personally before he can kill Cassandra, while Balthazar confronts and kills Takmet, avenging Takmet's father, Peron, and takes on the full force of Memnon's forces alone. The battle rages on until Mathayus is shot by a guard as in Cassandra's vision. As Memnon takes his place in the House of Scorpio to become the Scorpion King, Cassandra kills the guard while Mathayus retrieves his bow, pulls the arrow out of his shoulder and uses it to shoot the exhausted Memnon, sending him off the edge of the roof just as Philos and Arpid use the explosive powder to destroy the palace's foundation stone, bringing down the bulk of Memnon's forces. Memnon is consumed by the flames as he falls to his death. With the battle over, the remnants of Memnon's army bow before Mathayus, who, per the laws of the Horde stating that the king is the best warrior, is now the Scorpion King.In the aftermath, Mathayus and Balthazar share a good-natured farewell as the latter returns to his own kingdom. Cassandra tells Mathayus that she sees a brief period of peace and prosperity coming, but warns him that it will not last forever. Undeterred, Mathayus decides that they will make their own destiny. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjkxNTAwNTQ0M15BMl5BanBnXkFtZTYwMTQwMjM3._V1_SX101_CR0,0,101,150_.jpg"
                }
            }
        ]
    },
    "aggregations": {
        "directors_with_most_action_films": {
            "doc_count_error_upper_bound": 0,
            "sum_other_doc_count": 5703,
            "buckets": [
                {
                    "key": "Ishirô Honda",
                    "doc_count": 22
                },
                {
                    "key": "Sammo Kam-Bo Hung",
                    "doc_count": 21
                },
                {
                    "key": "Albert Pyun",
                    "doc_count": 20
                },
                {
                    "key": "Hark Tsui",
                    "doc_count": 18
                },
                {
                    "key": "John Woo",
                    "doc_count": 18
                },
                {
                    "key": "Kunihiko Yuyama",
                    "doc_count": 17
                },
                {
                    "key": "Takashi Miike",
                    "doc_count": 17
                },
                {
                    "key": "Uwe Boll",
                    "doc_count": 17
                },
                {
                    "key": "Cheh Chang",
                    "doc_count": 16
                },
                {
                    "key": "Chia-Liang Liu",
                    "doc_count": 16
                },
                {
                    "key": "Johnnie To",
                    "doc_count": 15
                },
                {
                    "key": "Robert Rodriguez",
                    "doc_count": 15
                },
                {
                    "key": "Steven Spielberg",
                    "doc_count": 15
                },
                {
                    "key": "Clint Eastwood",
                    "doc_count": 14
                },
                {
                    "key": "Corey Yuen",
                    "doc_count": 14
                },
                {
                    "key": "J. Lee Thompson",
                    "doc_count": 14
                },
                {
                    "key": "Jackie Chan",
                    "doc_count": 14
                },
                {
                    "key": "Kenji Misumi",
                    "doc_count": 14
                },
                {
                    "key": "Roel Reiné",
                    "doc_count": 14
                },
                {
                    "key": "Tony Scott",
                    "doc_count": 14
                },
                {
                    "key": "Renny Harlin",
                    "doc_count": 13
                },
                {
                    "key": "Roland Emmerich",
                    "doc_count": 13
                },
                {
                    "key": "Walter Hill",
                    "doc_count": 13
                },
                {
                    "key": "Enzo G. Castellari",
                    "doc_count": 12
                },
                {
                    "key": "Kinji Fukasaku",
                    "doc_count": 12
                },
                {
                    "key": "Mark Atkins",
                    "doc_count": 12
                },
                {
                    "key": "Michael Bay",
                    "doc_count": 12
                },
                {
                    "key": "Russell Mulcahy",
                    "doc_count": 12
                },
                {
                    "key": "Siu-Tung Ching",
                    "doc_count": 12
                },
                {
                    "key": "Woo-Ping Yuen",
                    "doc_count": 12
                },
                {
                    "key": "Antoine Fuqua",
                    "doc_count": 11
                },
                {
                    "key": "Jim Wynorski",
                    "doc_count": 11
                },
                {
                    "key": "Jing Wong",
                    "doc_count": 11
                },
                {
                    "key": "John Frankenheimer",
                    "doc_count": 11
                },
                {
                    "key": "Peter Hyams",
                    "doc_count": 11
                },
                {
                    "key": "Richard Donner",
                    "doc_count": 11
                },
                {
                    "key": "Richard Fleischer",
                    "doc_count": 11
                },
                {
                    "key": "Sam Liu",
                    "doc_count": 11
                },
                {
                    "key": "Seijun Suzuki",
                    "doc_count": 11
                },
                {
                    "key": "Sidney J. Furie",
                    "doc_count": 11
                },
                {
                    "key": "Benny Chan",
                    "doc_count": 10
                },
                {
                    "key": "Gordon Chan",
                    "doc_count": 10
                },
                {
                    "key": "Isaac Florentine",
                    "doc_count": 10
                },
                {
                    "key": "Jay Oliva",
                    "doc_count": 10
                },
                {
                    "key": "Mark L. Lester",
                    "doc_count": 10
                },
                {
                    "key": "Paul W.S. Anderson",
                    "doc_count": 10
                },
                {
                    "key": "Tom Clegg",
                    "doc_count": 10
                },
                {
                    "key": "Andrew V. McLaglen",
                    "doc_count": 9
                },
                {
                    "key": "Brian Trenchard-Smith",
                    "doc_count": 9
                },
                {
                    "key": "Daisuke Nishio",
                    "doc_count": 9
                }
            ]
        }
    }
}