{
    "took": 5,
    "timed_out": false,
    "_shards": {
        "total": 1,
        "successful": 1,
        "skipped": 0,
        "failed": 0
    },
    "hits": {
        "total": {
            "value": 206,
            "relation": "eq"
        },
        "max_score": 26.059008,
        "hits": [
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "2743",
                "_score": 26.059008,
                "_source": {
                    "title": "El político",
                    "rating": 7.4,
                    "year": 1949,
                    "directors": [
                        "Robert Rossen"
                    ],
                    "writers": [
                        "Robert Penn Warren",
                        "Robert Rossen"
                    ],
                    "actors": [
                        "Broderick Crawford",
                        "John Ireland",
                        "Joanne Dru",
                        "John Derek",
                        "Mercedes McCambridge",
                        "Shepperd Strudwick",
                        "Ralph Dumke",
                        "Anne Seymour",
                        "Katherine Warren",
                        "Raymond Greenleaf",
                        "Walter Burke",
                        "Will Wright",
                        "Grandon Rhodes",
                        "Beau Anderson",
                        "Sam Ash",
                        "Richard Bartell",
                        "Mary Bear",
                        "Helena Benda",
                        "Stanley Blystone",
                        "Marshall Bradford",
                        "Chet Brandenburg",
                        "William Bruce",
                        "Al Cantor",
                        "Wheaton Chambers",
                        "Edwin Chandler",
                        "Stephen Chase",
                        "Tom Coleman",
                        "James Conaty",
                        "William Cottrell",
                        "Kenneth Cutler",
                        "Roy Darmour",
                        "Jack Deery",
                        "Earle S. Dewey",
                        "King Donovan",
                        "Jack Evans",
                        "George Farmer",
                        "Charles Ferguson",
                        "Tom Ferrandini",
                        "Robert Filmer",
                        "Paul Ford",
                        "Ted French",
                        "Jack Gargan",
                        "Slim Gaut",
                        "John Giles",
                        "Dick Gordon",
                        "Jack Gordon",
                        "Avery Graves",
                        "William E. Green",
                        "Charles Haefeli",
                        "Frank Hagney",
                        "Richard Hale",
                        "Bert Hanlon",
                        "Sam Harris",
                        "Judd Holdren",
                        "Jimmie Horan",
                        "Robert Karnes",
                        "Kenner G. Kemp",
                        "Donald Kerr",
                        "Tom Kingston",
                        "Mike Lally",
                        "Nolan Leary",
                        "James Linn",
                        "Louis Mason",
                        "Paul Maxey",
                        "Frank McLure",
                        "Walter Merrill",
                        "H.C. Miller",
                        "Harold Miller",
                        "John 'Skins' Miller",
                        "Bob Milton",
                        "George Morrell",
                        "Truett Myers",
                        "Frank O'Connor",
                        "Pat O'Malley",
                        "Charles Perry",
                        "Jeffrey Sayre",
                        "Sammy Shack",
                        "Charles Sherlock",
                        "Leslie Sketchley",
                        "Irving Smith",
                        "Ray Spiker",
                        "Helene Stanley",
                        "Larry Steers",
                        "Houseley Stevenson",
                        "Charles Sullivan",
                        "William Tannen",
                        "George Taylor",
                        "Al Thompson",
                        "Glen Thompson",
                        "A.C. Tillman",
                        "Phil Tully",
                        "Glen Walters",
                        "Reba Waterson",
                        "Frank Wilcox",
                        "Rhoda Williams",
                        "Harry Wilson",
                        "Bill Wolfe",
                        "Al Wyatt Sr."
                    ],
                    "genres": [
                        "Drama",
                        "Film-Noir"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 110,
                    "summary": [
                        "The rise and fall of a corrupt politician, who makes his friends richer and retains power by dint of a populist appeal.",
                        "Jack Burden is a newspaper reporter who first hears of Willie Stark when his editor sends him to Kanoma County to cover the man. What's special about this nobody running for county treasurer? He's supposedly an honest man. Burden discovers this to be true when he sees Stark delivering a speech and having his son pass out handbills, while the local politicians do their best to intimidate him. Willie Stark is honest and brave. He's also a know-nothing hick whose schoolteacher wife has given him what little education he has. Stark loses the race for treasurer, but later makes his way through law school, becoming an idealistic attorney who fights for what is good. Someone in the governor's employ remembers Stark when the governor needs a patsy to run against him and split the vote of his rival. The fat cats underestimate Stark; but Jack Burden, Stark's biggest supporter, overestimates the man's idealism. To get where he wants to go, Willie Stark is willing to crack a few eggs - which include his tough-talking assistant, Sadie Burke; Jack's poised and elegant fiancée, Anne Stanton; and even Jack Burden himself. —J. Spurlin",
                        "The story of Willie Stark, an unassuming, unsophisticated idealistic farmer who becomes Governor of his state, and Jack Burden, reporter and Stark ally. We see how Stark fights his way up from lowly beginnings, initially failing at politics but then succeeding. However, once in office, the ideals slip, the standards fall and the power leads to corruption. Burden should be his conscience, but he finds himself going along for the ride. —grantss",
                        "The evolution of Willie Stark as a state politician is presented. A self-professed uneducated country bumpkin, Willie gets into politics, initially running for a county treasury seat, in his belief that the political machine is corrupt and that he, an honest man, will bring back integrity in his outward goal of getting the truth to the people. Despite he posing no real threat to the establishment, the establishment does whatever it can to quash Willie's political voice, especially through intimidation. It isn't until the establishment believes it can use Willie to their advantage that Willie in turn discovers an opportunity to use the machine to his advantage instead in espousing a populist agenda. Getting a taste of power may give Willie a different view of politics than his outward view in the beginning. Also presented are a number of people around Willie who get out of him what they need for their own lives, Willie, in turn, only keeping people around if they can serve his interests: Lucy Stark, his former schoolteacher wife, has acted more as a mother to him than a wife; reporter Jack Burden, having grown up in privilege in an isolated enclave of the state called Burden's Landing, is trying to find his place in life without the connections of his childhood, and believed he found that in writing articles on Willie for his newspaper; Jack's childhood friend and his current girlfriend Anne Stanton, the daughter of a former respected governor, she who wants her husband, regardless of if it's Jack or anyone else, to be a somebody; and Sadie Burke, who has always surrounded herself by who can pay her the most for her brains, she who may see Willie as more than just a paycheck. —Huggo",
                        "All The King's Men is the story of the rise of politician Willie Stark from a rural county seat to the spotlight. Along the way, he loses his initial innocence, and becomes just as corrupt as those who he assaulted before for this characteristic. Also included is the romance between one of his "right hand women" and the up-and-coming journalist who brings Stark to prominence. —Neal Scoones <verty@ritz.mordor.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZjQyN2MwMjAtNmJmZS00OWZlLWE1NGQtOGZmYmRjZjIyNWEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "27023",
                "_score": 23.776894,
                "_source": {
                    "title": "Manda Bala",
                    "rating": 7.2,
                    "year": 2007,
                    "directors": [
                        "Jason Kohn"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Portuguese"
                    ],
                    "runtime": 85,
                    "summary": [
                        "An examination of corruption and class warfare in Brazil as told through the stories of a wealthy businessman, a plastic surgeon who assists kidnapping victims and a politician whose income relies on a frog farm.",
                        "Several stories are told simultaneously: a frog farm in northern Brasil launders money for a corrupt politician; a young woman who was kidnapped for ransom talks about her ordeal; a plastic surgeon discusses then demonstrates how to reconstruct a severed ear; a young business man has his cars armored and takes a course in evasive driving; a policeman in Sao Paulo's anti-kidnapping squad discusses his work; a civil engineer, the attorney general, and a district attorney describe their anti-corruption efforts. Violence and corruption is Brasil: the object is money. —<jhailey@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGVmZjg3NjYtMTUwOS00YzlmLTkyMzEtYjBjZmFmZDQyMjk5XkEyXkFqcGdeQXVyMjgxMDg2NQ@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "27024",
                "_score": 23.776894,
                "_source": {
                    "title": "Manda Bala",
                    "rating": 7.2,
                    "year": 2007,
                    "directors": [
                        "Jason Kohn"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Portuguese"
                    ],
                    "runtime": 85,
                    "summary": [
                        "An examination of corruption and class warfare in Brazil as told through the stories of a wealthy businessman, a plastic surgeon who assists kidnapping victims and a politician whose income relies on a frog farm.",
                        "Several stories are told simultaneously: a frog farm in northern Brasil launders money for a corrupt politician; a young woman who was kidnapped for ransom talks about her ordeal; a plastic surgeon discusses then demonstrates how to reconstruct a severed ear; a young business man has his cars armored and takes a course in evasive driving; a policeman in Sao Paulo's anti-kidnapping squad discusses his work; a civil engineer, the attorney general, and a district attorney describe their anti-corruption efforts. Violence and corruption is Brasil: the object is money. —<jhailey@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGVmZjg3NjYtMTUwOS00YzlmLTkyMzEtYjBjZmFmZDQyMjk5XkEyXkFqcGdeQXVyMjgxMDg2NQ@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "2542",
                "_score": 23.553421,
                "_source": {
                    "title": "Un marido ideal",
                    "rating": 6.5,
                    "year": 1947,
                    "directors": [
                        "Alexander Korda"
                    ],
                    "writers": [
                        "Oscar Wilde",
                        "Lajos Biró"
                    ],
                    "actors": [
                        "Paulette Goddard",
                        "Michael Wilding",
                        "Diana Wynyard",
                        "Hugh Williams",
                        "C. Aubrey Smith",
                        "Glynis Johns",
                        "Constance Collier",
                        "Christine Norden",
                        "Harriette Johns",
                        "Michael Medwin",
                        "Michael Anthony",
                        "Peter Hobbes",
                        "John Clifford",
                        "Fred Groves",
                        "Michael Ward",
                        "Ronald Adam",
                        "Joy Adams",
                        "Strelsa Brown",
                        "Roma Goy",
                        "Rosalie Hillan",
                        "Mary Midwinter",
                        "Mary Nash"
                    ],
                    "genres": [
                        "Comedy",
                        "Drama"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 96,
                    "summary": [
                        "A prominent politician is preparing to expose a financial scandal. But then a woman who has invested heavily in the shady venture threatens to uncover a damaging secret in the politician's past if he exposes the speculation as a fraud. His problem is compounded by his wife's intolerance of the slightest character flaws. —Snow Leopard",
                        "It's 1895 among London's high society where honor among humankind is the most valued character, that is under the assumption that one has money and with it wields power and influence. Undersecretary with the government Sir Robert and Lady Gertrude Chiltern are hosting a lavish gala in their home. One of the invited guests is Laura Greveley, who has recently returned to London after living abroad for years, most recently in Vienna. She is now using the surname of her second and latest husband. Before extending the invitation, Lady Chiltern had no idea that Mrs. Greveley is her old much disliked schoolmate, as she went by her first husband's surname when she last lived in London. That dislike is due to her dishonorable nature. Despite her dislike in return for Lady Chiltern, Mrs. Greveley has an ulterior motive in attending the gala--with physical evidence in her possession, she plans to blackmail Sir Robert to make a public statement in the House supporting a controversial canal project in Argentina. This would be in return for her silence concerning his selling of government information when he was starting his political life--that information which was the basis not only of his career but his wealth, and information of which Lady Chiltern is totally unaware. As Sir Robert contemplates what to do in his opposition to knowing the canal project a fraud against what Mrs. Greveley knowing coming to light which would ruin his life. What happens between Mrs. Greveley and Sir Robert ends up being a battle of wills between Mrs. Greveley and Sir Robert's best friend, Viscount Arthur Goring, a carefree bachelor whom Sir Robert does not initially know was once shortly engaged to Mrs. Greveley before he discovered her true nature. —Huggo"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BODI0MmQ2Y2UtYTc5Ni00NDYyLTk0YjktZjg3NzFmMGIwNTM5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzAyNTQ1Mzk@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "853",
                "_score": 23.178352,
                "_source": {
                    "title": "La garra del gato",
                    "rating": 6.6,
                    "year": 1934,
                    "directors": [
                        "Sam Taylor",
                        "Harold Lloyd"
                    ],
                    "writers": [
                        "Clarence Budington Kelland",
                        "Sam Taylor",
                        "Clyde Bruckman"
                    ],
                    "actors": [
                        "Harold Lloyd",
                        "Una Merkel",
                        "George Barbier",
                        "Nat Pendleton",
                        "Grace Bradley",
                        "Alan Dinehart",
                        "Grant Mitchell",
                        "E. Alyn Warren",
                        "Warren Hymer",
                        "J. Farrell MacDonald",
                        "James Donlan",
                        "Edwin Maxwell",
                        "Frank Sheridan",
                        "Fuzzy Knight",
                        "Vince Barnett",
                        "Samuel Adams",
                        "Ernie Alexander",
                        "Dorothy Bay",
                        "Vangie Beilby",
                        "Brooks Benedict",
                        "Chief John Big Tree",
                        "Herman Bing",
                        "Billy Bletcher",
                        "Eddie Boland",
                        "Sidney Bracey",
                        "James Bradbury Jr.",
                        "Don Brodie",
                        "James Burke",
                        "Frederick Burt",
                        "Bob Chapman",
                        "Wong Chung",
                        "Nell Craig",
                        "Richard Cramer",
                        "George Davis",
                        "Jimmy Dime",
                        "Jack Don",
                        "Billy Dooley",
                        "Tom Dugan",
                        "Lalo Encinas",
                        "Eddie Fetherston",
                        "Alec B. Francis",
                        "John George",
                        "Rosa Gore",
                        "Kit Guard",
                        "Pat Harmon",
                        "Edward Hearn",
                        "Tom Herbert",
                        "Jack Herrick",
                        "Samuel S. Hinds",
                        "Gertrude Hoffman",
                        "David Holt",
                        "Pete Homer",
                        "Arthur Hoyt",
                        "John Ince",
                        "William Irving",
                        "Walter James",
                        "Sydney Jarvis",
                        "DeWitt Jennings",
                        "Johnny Kascier",
                        "Jack Kennedy",
                        "Frank LaRue",
                        "James B. Leong",
                        "Ivan Linow",
                        "Tom London",
                        "James T. Mack",
                        "George MacQuarrie",
                        "Noel Madison",
                        "George Magrill",
                        "Jim Mason",
                        "Matt McHugh",
                        "Charles McMurphy",
                        "Frances Morris",
                        "Louis Natheaux",
                        "Paul Panzer",
                        "Dewey Robinson",
                        "Constantine Romanoff",
                        "Charles Sellon",
                        "Pat Somerset",
                        "Larry Steers",
                        "John M. Sullivan",
                        "Phil Tead",
                        "Harry Tenbrook",
                        "Ray Turner",
                        "Michael Visaroff",
                        "Fred Walton",
                        "James Wang",
                        "Charles Williams",
                        "Leo Willis",
                        "Harry Wilson",
                        "Ernest Wood",
                        "John Wray",
                        "Noah Young"
                    ],
                    "genres": [
                        "Comedy"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Cantonese",
                        "German"
                    ],
                    "runtime": 102,
                    "summary": [
                        "A naive missionary brought up in China returns to America to seek a wife. Corrupt politicians enlist him to run for mayor as a dummy candidate with no chance of winning.",
                        "Naive Ezekial Cobb, brought up by his missionary father in China returns to America to seek a wife. Corrupt politicians enlist him to run for mayor as a dummy candidate with no chance of winning. Their plan backfires as he wins and embarks upon a reform crusade. —Herman Seifer <alagain@aol.com>",
                        "Being the son of Christian missionaries, Ezekial Cobb has lived in a small isolated town in China for twenty years, since he was an adolescent. Because of this sheltered life, Ezekial, who follows the teaching of Chinese poet and philosopher Ling Po, is a naive and overly trusting man. His parents send him back to his birthplace of Stockport, California so that he can find a wife, and for the two of them to return to China to continue the mission. In the big city of Stockport, Ezekial being unwise to the ways of the world gets him into one misadventure after another. Jake Mayo equates Ezekial's simplicity with being a pushover, just the type of person he needs to run as mayor on behalf of the Good Government League - the reform ticket - which is solely a front for the corrupt political machine in power who want to make it look like the election is being run in a true democratic fashion. Although Ezekial accepts the nomination on the premise he will lose as his primary goal is to find that wife and return to China, Ezekial, a man with integrity, may have different goals once he learns how corrupt politics in Stockport truly is. But Ezekial making changes to Stockport politics may be easier said than done, especially against those who the League fronts. Through it all, Ezekial gets the help of streetwise Pet Pratt, a fellow boarder at the rooming house where Ezekial is staying. —Huggo"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk5MDc1NDYzM15BMl5BanBnXkFtZTgwNTIzODYwMjE@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "34988",
                "_score": 23.04597,
                "_source": {
                    "title": "Seenelkäik",
                    "rating": 6.8,
                    "year": 2012,
                    "directors": [
                        "Toomas Hussar"
                    ],
                    "writers": [
                        "Toomas Hussar"
                    ],
                    "actors": [
                        "Raivo E. Tamm",
                        "Elina Reinold",
                        "Juhan Ulfsak",
                        "Hendrik Toompere Jr. Jr.",
                        "Hilje Murel",
                        "Ott Sepp",
                        "Emil Rutiku",
                        "Raimo Pass",
                        "Margus Pilt",
                        "Janek Tischler",
                        "Indrek Tischler",
                        "Piret Simson",
                        "Volli Käro",
                        "Ülle Kaljuste",
                        "Joosep Jürgenson",
                        "Markus Luik",
                        "Kaido Ehasoo",
                        "Ervin Õunapuu",
                        "Tarmo Männard",
                        "Anneli Aru",
                        "Paul Laasik",
                        "Mari-Liis Lill",
                        "Andres Maimik",
                        "Elmo Nüganen",
                        "Üllar Saaremäe",
                        "Peeter Tammearu",
                        "Hannes Vörnö"
                    ],
                    "genres": [
                        "Adventure",
                        "Comedy",
                        "Thriller"
                    ],
                    "country": "Estonia",
                    "languages": [
                        "Estonian"
                    ],
                    "runtime": 93,
                    "summary": [
                        "A journalist has gotten wind of corruption rumors involving a politician. On the day the journalist tries to contact him, he decides to go mushrooming with his wife."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZDcyZDQzMTUtZjlkMS00MWZmLTgxYzYtODk5YTY1ZDVjY2NhXkEyXkFqcGdeQXVyNjM3NTIzNjE@._V1_SY150_CR9,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "31294",
                "_score": 22.874998,
                "_source": {
                    "title": "Standing Army",
                    "rating": 6.8,
                    "year": 2010,
                    "directors": [
                        "Thomas Fazi",
                        "Enrico Parenti"
                    ],
                    "writers": [
                        "Thomas Fazi",
                        "Enrico Parenti"
                    ],
                    "actors": [
                        "Olivier Bancoult",
                        "William Blum",
                        "Noam Chomsky",
                        "Yôichi Iha",
                        "Chalmers Johnson",
                        "Rex A. Johnson",
                        "Michael Klare",
                        "Edward N. Luttwak",
                        "Catherine Lutz",
                        "Gligor Tashkovich",
                        "Gligor Tashkovich",
                        "Gore Vidal"
                    ],
                    "genres": [
                        "Documentary",
                        "War"
                    ],
                    "country": "Italy",
                    "languages": [
                        "English"
                    ],
                    "runtime": 75,
                    "summary": " This Movie had been banned from the United States. The movie exposes corruption of individuals within United States Government. And these corrupt individuals removed movie from United States ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjI2OTkxNzkyMF5BMl5BanBnXkFtZTcwNjAwMTcxOQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "3798",
                "_score": 22.761187,
                "_source": {
                    "title": "New York Confidential",
                    "rating": 7,
                    "year": 1955,
                    "directors": [
                        "Russell Rouse"
                    ],
                    "writers": [
                        "Jack Lait",
                        "Lee Mortimer",
                        "Clarence Greene",
                        "Russell Rouse"
                    ],
                    "actors": [
                        "Broderick Crawford",
                        "Richard Conte",
                        "Marilyn Maxwell",
                        "Anne Bancroft",
                        "J. Carrol Naish",
                        "Onslow Stevens",
                        "Barry Kelley",
                        "Mike Mazurki",
                        "Celia Lovsky",
                        "Herbert Heyes",
                        "Steven Geray",
                        "William 'Bill' Phillips",
                        "Henry Kulky",
                        "Nestor Paiva",
                        "Joseph Vitale",
                        "Carl Milletaire",
                        "William Forrest",
                        "Ian Keith",
                        "Charles Evans",
                        "Mickey Simpson",
                        "Tom Powers",
                        "Lee Trent",
                        "Leonard Bremen",
                        "John Doucette",
                        "Frank Ferguson",
                        "Hope Landin",
                        "Fortunio Bonanova",
                        "Donald Kerr",
                        "Abdullah Abbas",
                        "Leon Alton",
                        "Bill Baldwin",
                        "Paul Bradley",
                        "Gloria Dadisman",
                        "George DeNormand",
                        "Beverly Garland",
                        "Roy Gordon",
                        "Dorothy Granger",
                        "Robert Haines",
                        "Sam Harris",
                        "Don C. Harvey",
                        "Ted Hecht",
                        "Jack Kenney",
                        "Robert Keys",
                        "Jess Kirkpatrick",
                        "Tyler McVey",
                        "Charles Meredith",
                        "Marvin Miller",
                        "Ralph Montgomery",
                        "Robin Morse",
                        "Meg Myles",
                        "William H. O'Brien",
                        "Joe Ploski",
                        "Marshall Reed",
                        "Frank Richards",
                        "Michael Ross",
                        "Carl Sklover",
                        "George E. Stone"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Film-Noir",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 88,
                    "summary": [
                        "A top syndicate crime boss and his corrupt politicians, make multi-million deals and order murders , until the vicious pattern finally catches up to him.",
                        "Nick Magellan works for the corrupt businessman Charlie Lupo, who presides over an influential crime syndicate in Manhattan, New York. New York senators belong to the realm of this syndicate. Charlie has a recalcitrant daughter, Kathy Lupo. She is in love with Nick. Nick protects Kathy against her father when she leaves her parental home. Charlie always knows not to be judged, but when one of the senators talks too much during a television interview, he is in the center of a massive fraud research by the law. —Robert"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BM2VmMDA2MmMtZjZhZi00ZjI5LTgxMGUtYjA4YWMwZWUyNWU2XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "9308",
                "_score": 21.923061,
                "_source": {
                    "title": "El poder del fuego",
                    "rating": 5,
                    "year": 1979,
                    "directors": [
                        "Michael Winner"
                    ],
                    "writers": [
                        "Gerald Wilson",
                        "Bill Kerby",
                        "Michael Winner",
                        "Jo Eisinger"
                    ],
                    "actors": [
                        "Sophia Loren",
                        "James Coburn",
                        "O.J. Simpson",
                        "Eli Wallach",
                        "Anthony Franciosa",
                        "George Grizzard",
                        "Vincent Gardenia",
                        "Fred Stuthman",
                        "Richard Caldicot",
                        "Frank Singuineau",
                        "George Touliatos",
                        "Hank Garrett",
                        "Conrad Roberts",
                        "Billy Barty",
                        "Jake LaMotta",
                        "Vincent Beck",
                        "Dominic Chianese",
                        "Andrew Duncan",
                        "Paul D'Amato",
                        "Paul Garcia",
                        "Richard Roberts",
                        "Peter Savage",
                        "William Trotman",
                        "Paula Laurence",
                        "Thom Christopher",
                        "Bill Abbott",
                        "Sonia Manzano",
                        "Ruth Jaroslow",
                        "Elsa Raven",
                        "Catherine Neilson",
                        "Victor Mature",
                        "Roy Alon",
                        "Marc Boyle",
                        "Ken Butler",
                        "Billy Horrigan",
                        "Randy Jurgensen",
                        "Terry Leonard",
                        "J.C. Quinn",
                        "Glenn Randall Jr.",
                        "Doug Robinson",
                        "Tom Tully"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 104,
                    "summary": [
                        "A merc is hired by the F.B.I. to track down a powerful recluse criminal. A woman is also trying to track him down for her own personal vendetta.",
                        "Drug lord Carl Stegner (Touliatos) is wanted by the US government on fraud, bribery and corruption charges. But before Stegner can be indicted, the government's star witness is murdered. Adele Tasca (Loren), the murdered man's widow, suggests Stegner's kidnap to the Justice Department. She recommends Jerry Fanon (Coburn), her former lover and professional bounty hunter, to catch her husband's killer and bring him back to face justice."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BM2I4YmM2MTktOGQ4Mi00ZGEyLThjNmMtMjhlZTRlM2I2OGY2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "16934",
                "_score": 21.795769,
                "_source": {
                    "title": "Resucitar un amor",
                    "rating": 6.5,
                    "year": 2000,
                    "directors": [
                        "Keith Gordon"
                    ],
                    "writers": [
                        "Scott Spencer",
                        "Robert Dillon"
                    ],
                    "actors": [
                        "Billy Crudup",
                        "Bill Haugland",
                        "Nelson Landrieu",
                        "Ivonne Coll",
                        "Jennifer Connelly",
                        "Maxine Guess",
                        "Paul Hipp",
                        "Hal Holbrook",
                        "Lawrence Dane",
                        "Ed Harris",
                        "Robert Harding",
                        "Janet McTeer",
                        "Molly Parker",
                        "Larry Marshall",
                        "Don Jordan",
                        "Caroline Sabourin",
                        "Stanley Anderson",
                        "Patricia Gage",
                        "John Carroll Lynch",
                        "Bruce Dinsmore",
                        "Mimi Kuzyk",
                        "Tony Calabretta",
                        "Walter Massey",
                        "Norris Domingue",
                        "Dean Hagopian",
                        "Bernard Behrens",
                        "Philip Williams",
                        "Sharon Washington",
                        "Ranee Lee",
                        "Zoë Sakellaropoulo",
                        "Scott Spencer",
                        "Alan Fawcett",
                        "Leah Pinsent",
                        "Karina Iraola",
                        "Marco Ledezma",
                        "Walt MacPherson",
                        "John Walsh",
                        "Vlasta Vrana",
                        "Sandra Oh",
                        "Rafael Petardi",
                        "Leonardo Fuica",
                        "Qariy Hendrickson",
                        "Sandra Caldwell",
                        "Justin Bradley",
                        "Richard Hicks",
                        "Ed Cambridge"
                    ],
                    "genres": [
                        "Drama",
                        "Mystery",
                        "Romance",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 105,
                    "summary": " The first scene of the movie introduces Fielding Pierce (Billy Crudup) as he is watching news footage showing that Sarah Williams (Jennifer Connelly) has been killed in a suspected car bombing. The reporter indicates that Sarah was an activist from Chicago involved in helping refugees from the Chilean government and that her death may cast new light on the movement. Fielding is completely distraught over hearing this news and the movie begins.The first 3/4 of the movie unfolds on parallel timelines in the 70s and early 80s: the progression of Fielding & Sarah's complicated, volatile relationship and Fielding's ascension into power as an upcoming politician dealing with the recent loss (and haunting memories) of Sarah.Fielding meets Sarah as he is returning, in uniform, from duty in the Coast Guard and meeting up with his brother, who is a editor. The brother, Fielding and Sarah all go to lunch where Fielding is very ouspoken in his political ideals about current events. Sarah and Fielding are both immediately intrigued by each other, Fielding's attraction being more sexual and blatant and Sarah's attraction more of curiousity and intrigue. A few dates quickly lead to a sexual relationship despite an obvious difference in political thinking between the two. Sarah asks why Fielding wants to be a senator and his very serious reply is that he doesn't- he wants to be president. Sarah is later quoted as saying "Ambition is the ice in the lake of emotion." And when Fielding tries to comfort Sarah's fear of his Coast Guard duty leading to a Vietnam tour, she replies "but if you go over there, you'll be shooting at the guys that I want to win." Their intense love outweighs their differences, though, and their relationship quickly becomes serious.Meanwhile Fielding is a young politician being groomed to be congressman by the current govenor because of a scandal involving Jerry Carmichael 's (Ed Harris in a cameo role) resignation due to his homosexuality. Fielding seems ambivalent about the offer to be put on the ticket, perhaps because of the nature of the resignation- as he indicates- or pehaps because of the impact of Sarah's influence on his current ambitions. Either way, the governor and his top advisor Isaac (Hal Holbrook) are not comfortable with this lack of enthusiasm and do not offer much hand holding. This confrontation sets the tone for the later timeline in Fielding's life as his insecurities and haunting memories of Sarah eventually lead to hallucinations and his emotional breakdown. Fielding is now dating Isaac's daughter, but their relationship is clearly not as intense as his past relationship with Sarah. Conversations with his sister Caroline (Janet McTeer) and visits with his dad quickly lead to discussions about Sarah and how is haunting memories are leading to him seeing Sarah again. His family is supportive without offering any helpful advice other than to focus more on the political path ahead of him.Sarah and Fielding's relationship takes them to Chicago where they share an apartment as he continues law school and she begins missionary work for a local church led by Father Steven (John Carrol Lynch). Fielding's involvement with Isaac soon begins, and Sarah's aversion to the whole political process becomes more threatening. After a uncomfortable encounter with Sarah at one of Fielding's political events, where her disdain for the situation leads to a verbal attack on one of the attendees, they attempt to reconcile on the subway afterwards. They cannot reach an agreement and she proclaims "It is so infuriating loving you!" Fielding chuckes and says that the feeling is mutual. Sarah's long hours away from home, spent working at the church, lead Fielding to foolishly suspect Sarah is having an affair with Father Steven. Their intense bond holds them together through their disagreements and insecurities.Fielding starts the campaign trail even as his memories of Sarah convince him that she may still be alive and is watching him. He even chases someone he believes to be her through town and eventually ending at a church. But his search is fruitless and only further shows his descent into emotional breakdown. His relationship with Molly becomes troubled as he emotionally withdraws from her also. When she tries to reach to him, he does not offer any recognition of her or his feelings.Sarah's missionary work leads to activist work in Chile where her and Father Steven bring back political refugees of the government. At one uncomfortable dinner at the church with Fielding. The refugees are appalled to hear that Fielding is hoping to enter politics, an american institution they feel is overrun with corruption. Fielding tries to convince them he is not entering politics to become corrupt but to affect change. They are not conducive to this idea. He chastises their hypocrisy by observing that as awful as they try to hint his government is, he can't help but to notice when they needed help they ran to this country for freedom. When he turns to Sarah for help, she offers "You are alone in this conversation." Fielding then replies he is alone in this whole room and he is "choking on the collective sense of superiority." Fielding and Sarah's political difference and growing distance is shown at its worst, as no make up scene follows. Soon after Sarah leaves for her fatal trip in Milwauke. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDY1ODcyZmQtMjFlMC00MjNkLWExZDMtMGY5OGRhZWFlOTAwXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "34215",
                "_score": 21.668758,
                "_source": {
                    "title": "Likvidator",
                    "rating": 4.9,
                    "year": 2011,
                    "directors": [
                        "Akan Satayev"
                    ],
                    "writers": [
                        "Timur Zhaksylykov"
                    ],
                    "actors": [
                        "Berik Aytzhanov",
                        "Vinnie Jones",
                        "Aziz Beyshenaliev",
                        "Karlygash Mukhamedzhanova",
                        "Mikhail Tokarev",
                        "Toleubek Aralbaev",
                        "Timur Zhaksylykov",
                        "Anatoli Krezhenchukov",
                        "Sergey Nikonenko",
                        "Viktor Ashanin",
                        "Mentay Utepbergenov",
                        "Irina Lebssak",
                        "Sergey Ufimtzev",
                        "Matthew Mercer",
                        "Joe Thomas"
                    ],
                    "genres": [
                        "Action",
                        "Thriller"
                    ],
                    "country": "Kazakhstan",
                    "languages": [
                        "Russian"
                    ],
                    "runtime": 94,
                    "summary": [
                        "A highly skilled bodyguard avenging his brother's untimely death uncovers a ring of corruption extending to the highest levels of society and government."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNWFkYmI3YzQtODYwOS00ZWQ3LTgyZmEtMWQyZWVlNzlkY2Y2XkEyXkFqcGdeQXVyMTA2MDg3Mg@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "15482",
                "_score": 21.405401,
                "_source": {
                    "title": "City Hall: La sombra de la corrupción",
                    "rating": 6.2,
                    "year": 1996,
                    "directors": [
                        "Harold Becker"
                    ],
                    "writers": [
                        "Ken Lipper",
                        "Paul Schrader",
                        "Nicholas Pileggi",
                        "Bo Goldman"
                    ],
                    "actors": [
                        "Al Pacino",
                        "John Cusack",
                        "Bridget Fonda",
                        "Danny Aiello",
                        "Martin Landau",
                        "David Paymer",
                        "Anthony Franciosa",
                        "Richard Schiff",
                        "Lindsay Duncan",
                        "Nestor Serrano",
                        "Mel Winkler",
                        "Luna Lauren Velez",
                        "Chloe Morris",
                        "Ian Quinlan",
                        "Roberta Peters",
                        "Angel David",
                        "Larry Romano",
                        "Rob LaBelle",
                        "Ray Aranha",
                        "Jaliyl Lynn",
                        "John C. Vennema",
                        "Steve Aronson",
                        "Jerome X. O'Donovan",
                        "Mark Lonow",
                        "Murphy Guyer",
                        "John Finn",
                        "Richard Gant",
                        "Tamara Tunie",
                        "Fran Brill",
                        "Brian Murray",
                        "John Slattery",
                        "Benny Nieves",
                        "Miguel Sierra",
                        "Sylvia Kauders",
                        "Brenda Thomas",
                        "Gerry Vichi",
                        "Ernest F. Hollings",
                        "Jordan Baker",
                        "Leonard Chapman",
                        "Tony Capone",
                        "Jennifer Prescott",
                        "Joseph A. Kelly",
                        "Harry Bugin",
                        "Ron L. Cox",
                        "Kaity Tong",
                        "Amy Atkins",
                        "Brenda Pressley",
                        "Michael O'Looney",
                        "Carl White",
                        "Mary Murphy",
                        "Justin Ashforth",
                        "Charles Gemmill",
                        "Gina Rice",
                        "Roma Torre",
                        "Jack Cafferty",
                        "Lewis Dodley",
                        "Ed Koch",
                        "Stanley Anderson",
                        "Sally Mayes",
                        "Lucia Mendoza",
                        "Geoffrey Wade",
                        "Gloria K. Smith",
                        "James F. Gainer",
                        "David Wenzel",
                        "Alex Ballar",
                        "Sedly Bloomfield",
                        "Michael Carrara",
                        "Gloria Cuomo",
                        "Mary L. Davis",
                        "Nancy Duerr",
                        "Brian Ferrari",
                        "Harrison Freed",
                        "Philippe Hartmann",
                        "Dorinda Katz",
                        "Kent Klineman",
                        "Marshall Dancing Elk Lucas",
                        "Michael Luceri",
                        "Michael Luggio",
                        "Doris McCarthy",
                        "Frances Mignano",
                        "Romano Mosca",
                        "Chris Place",
                        "Joseph C. Reyes",
                        "Michelle Rouhani",
                        "Andrew D. Schwartz",
                        "Ralph A. Villani",
                        "John Haynes Walker"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 111,
                    "summary": " This complex 1996 drama directed by Harold Becker (Sea of Love) attempts to explore big-city corruption and the flexibility of what's right and wrong in the political arena. John Cusack plays the senior aide to mayor John Pappas (Al Pacino), a popular and seasoned politician whose administration is threatened when what seems to be an accidental shooting of a child reveals a nest of corruption and lifelong personal debts. This tests Cusack's loyalty to the man he thought he knew. Pacino turns in a finely textured performance as a man who has his own lofty ideals, but whose pragmatism sets in motion a series of events with tragic results. Cusack admirably captures the essence of someone polished and savvy at his job but must cope with fundamental disillusionment. This political thriller suffers at times from a lack of focus, but still offers an insightful and poignant treatise on the quagmire of politics in the modern age and the human toll it sometimes exacts. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDlhNDc3MmEtODJkMS00YmVlLWI4MTUtNDRkMTFhYjk1NDdlXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "26551",
                "_score": 21.363232,
                "_source": {
                    "title": "Varg Veum - Flores amargas",
                    "rating": 6.4,
                    "year": 2007,
                    "directors": [
                        "Ulrik Imtiaz Rolfsen"
                    ],
                    "writers": [
                        "Thomas Moldestad",
                        "Gunnar Staalesen"
                    ],
                    "actors": [
                        "Trond Espen Seim",
                        "Bjørn Floberg",
                        "Kathrine Fagerland",
                        "Endre Hellestveit",
                        "Anders Dale",
                        "Øyvind Gran",
                        "Per Jansen",
                        "Trine Wiggen",
                        "Håvard Bakke",
                        "Nicholas Hope",
                        "Ove Andreassen",
                        "Belinda Braza",
                        "Glenn Andre Kaada",
                        "Julie Fløysand",
                        "Tor Andre Rundhaug",
                        "Pål Obrestad",
                        "Sol Beth Arnøy",
                        "Cato Jensen",
                        "Ragnar Holen",
                        "Merete Armand",
                        "Gro Ann Uthaug",
                        "Oddmund Andersen",
                        "Sissel Marie Th. Bergesen",
                        "Erik Brynjulfsen",
                        "Tor Kristoffersen",
                        "Christoffer Kårevik",
                        "Kari Nyborg",
                        "Per Ivar Odden",
                        "Torgeir Ommedal",
                        "Lenka Rozehnal",
                        "Kristin Krogh Sissener",
                        "Bent Skjærstad",
                        "Bjørn Sothberg",
                        "Henrik Sørland"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "Norway",
                    "languages": [
                        "Norwegian"
                    ],
                    "runtime": 95,
                    "summary": [
                        "A successful female politician hires private detective Varg Veum to find her missing daughter without attracting too much attention. During his investigation, Veum becomes aware of an international company and its dealings with corruption, black-market business, ad murder. —HardHouseClubber"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZDY0NTk0N2ItYjEwOS00YzRlLWI1MjUtMzhiMGU5YmI2YzNiXkEyXkFqcGdeQXVyMzAyMzEwNTI@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "13314",
                "_score": 21.354326,
                "_source": {
                    "title": "El último boy scout",
                    "rating": 7,
                    "year": 1991,
                    "directors": [
                        "Tony Scott"
                    ],
                    "writers": [
                        "Shane Black",
                        "Shane Black",
                        "Greg Hicks"
                    ],
                    "actors": [
                        "Bruce Willis",
                        "Damon Wayans",
                        "Chelsea Field",
                        "Noble Willingham",
                        "Taylor Negron",
                        "Danielle Harris",
                        "Halle Berry",
                        "Bruce McGill",
                        "Badja Djola",
                        "Kim Coates",
                        "Chelcie Ross",
                        "Joe Santos",
                        "Clarence Felder",
                        "Tony Longo",
                        "Frank Collison",
                        "Bill Medley",
                        "Verne Lundquist",
                        "Dick Butkus",
                        "Lynn Swann",
                        "Billy Blanks",
                        "Ken Kells",
                        "Morris Chestnut",
                        "Michael J. Fisher",
                        "Doug Simpson",
                        "Joe El Rady",
                        "David McMillan",
                        "Benjamin Agee",
                        "Donna W. Scott",
                        "Denise Ames",
                        "Frank Kopyc",
                        "Teal Roberts",
                        "Sara Suzanne Brown",
                        "Ryan Cutrona",
                        "Eddie Griffin",
                        "John Cenatiempo",
                        "Michael Papajohn",
                        "Matt Johnston",
                        "Edmund Villa",
                        "James Keane",
                        "Jack Kehler",
                        "Duke Valenti",
                        "Dennis Garber",
                        "Manny Perry",
                        "Vic Manni",
                        "Frank Ferrara",
                        "Erik Onate",
                        "Robert Apisa",
                        "Shane Dixon",
                        "Rick Ducommun",
                        "E. Brian Dean",
                        "Dick Ziker",
                        "Fred Lerner",
                        "John Meier",
                        "Don Pulford",
                        "Dennis Packer",
                        "Gene Borkan",
                        "Kevin Bourland",
                        "Jeff Hochendoner",
                        "Steve Picerni",
                        "Craig A. Pinckes",
                        "Carmine Zozzora",
                        "Theresa St. Clair",
                        "Ed Beheler",
                        "Colby Kline",
                        "Robert M. Bouffard",
                        "Kristin Coppola",
                        "Adam DiSpirito",
                        "James Gandolfini",
                        "Robert Gatewood",
                        "Steven A. Hite",
                        "Anne Lockhart",
                        "Ray K. Morris",
                        "Patrick Potter",
                        "Julie K. Smith",
                        "USC Trojan Marching Band"
                    ],
                    "genres": [
                        "Action",
                        "Comedy",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 105,
                    "summary": [
                        "A private detective's protected female witness is murdered, prompting him and the victim's boyfriend to investigate the crime that leads to a corrupt politician and a crooked football team owner.",
                        "A down and out cynical detective teams up with a down and out ex-quarterback to try and solve a murder case involving a pro football team and a politician. —Ed Sutton <esutton@mindspring.com>",
                        "Joe Hallenbeck is a burned-out detective. Jimmy Dix is an ex-LA Stallions player. Hallenbeck was hired to protect a stripper named Cory. Dix is Cory's boyfriend. When Cory is executed during a drive-by shooting, both Hallenbeck and Dix try to get to the bottom of the case. —Ridley Lavine",
                        "When the girl that detective Joe Hallenback is protecting gets murdered, the boyfriend of the murdered girl (ex-football player Jimmy Dix) attempts to investigate and solve the case. What they discover is that there is deep seated corruption going on between a crooked politician and the owner of a pro football team. —Jason Ihle <jrihl@conncoll.edu>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BN2QxYjAwNDUtYWIzMC00ZTg3LTg5YjMtOGM4YzAyZmUxMzI2XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "2714",
                "_score": 20.380249,
                "_source": {
                    "title": "El estado de la Unión",
                    "rating": 7.2,
                    "year": 1948,
                    "directors": [
                        "Frank Capra"
                    ],
                    "writers": [
                        "Howard Lindsay",
                        "Russel Crouse",
                        "Anthony Veiller",
                        "Myles Connolly"
                    ],
                    "actors": [
                        "Spencer Tracy",
                        "Katharine Hepburn",
                        "Van Johnson",
                        "Angela Lansbury",
                        "Adolphe Menjou",
                        "Lewis Stone",
                        "Howard Smith",
                        "Charles Dingle",
                        "Maidel Turner",
                        "Raymond Walburn",
                        "Margaret Hamilton",
                        "Art Baker",
                        "Pierre Watkin",
                        "Florence Auer",
                        "Irving Bacon",
                        "Charles Lane",
                        "Patti Brady",
                        "Georgie Nokes",
                        "Carl 'Alfalfa' Switzer",
                        "Tom Fadden",
                        "Tom Pedi",
                        "Don Anderson",
                        "Harry Anderson",
                        "Stanley Andrews",
                        "Sam Ash",
                        "Frank Austin",
                        "David Bair",
                        "George Barton",
                        "Brandon Beach",
                        "Anne Beck",
                        "Lennie Bluett",
                        "Jack Boyle",
                        "Norma Brown",
                        "Douglas Carter",
                        "Maurice Cass",
                        "Naomi Childers",
                        "Davison Clark",
                        "David Clarke",
                        "Frank L. Clarke",
                        "Gene Coogan",
                        "Edwin Cooper",
                        "Fred Datig Jr.",
                        "Bert Davidson",
                        "Boyd Davis",
                        "Lew Davis",
                        "Drew Demorest",
                        "Helen Eby-Rock",
                        "Thornton Edwards",
                        "Franklyn Farnum",
                        "Sam Finn",
                        "Sig Frohlich",
                        "Joe Gilbert",
                        "Herschel Graham",
                        "Jesse Graves",
                        "Mahlon Hamilton",
                        "Phil Harron",
                        "Timmy Hawkins",
                        "Dell Henderson",
                        "Al Hill",
                        "Art Howard",
                        "Tor Johnson",
                        "Eddie Kane",
                        "Jimmy Lennon Sr.",
                        "Marion Martin",
                        "Frank Mayo",
                        "Frank McLure",
                        "Charles Meakin",
                        "Russell Meeker",
                        "Fred Miller",
                        "Howard M. Mitchell",
                        "Rhea Mitchell",
                        "Ralph Montgomery",
                        "Roger Moore",
                        "Bert Moorhouse",
                        "Arthur O'Connell",
                        "Garry Owen",
                        "Netta Packer",
                        "Frank Pharr",
                        "Eddie Phillips",
                        "Francis Pierlot",
                        "Stanley Price",
                        "Eleni Qirici",
                        "Ed Randolph",
                        "Barry Regan",
                        "Ellen Ross",
                        "Henry Russell",
                        "Marshall Ruth",
                        "Jerry Schumacher",
                        "Charles Sherlock",
                        "Robert Skelton",
                        "J. Lewis Smith",
                        "Robert Spencer",
                        "Ted Stanhope",
                        "Charles Sullivan",
                        "Henry Sylvester",
                        "Eve Whitney",
                        "Dave Willock",
                        "Wilson Wood",
                        "Fred Zendar"
                    ],
                    "genres": [
                        "Comedy",
                        "Drama"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 124,
                    "summary": [
                        "An industrialist is urged to run for President, but this requires uncomfortable compromises on both political and marital levels.",
                        "Kay Thorndyke (Dame Angela Lansbury) loves Grant Matthews (Spencer Tracy) and helps him become Republican nominee for President. The party machine begins to worry as Grant begins to speak for himself. At an important dinner, his wife Mary (Katharine Hepburn) condemns corrupt politicians, and Grant learns to speak out even more boldly. —Ed Stephan <stephan@cc.wwu.edu>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTkyNzdkOTItZmY0My00OTg3LTk1OTgtZTkyNmUzNzYyOWU2XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "1501",
                "_score": 20.160124,
                "_source": {
                    "title": "Muero cada amanecer",
                    "rating": 7.3,
                    "year": 1939,
                    "directors": [
                        "William Keighley"
                    ],
                    "writers": [
                        "Norman Reilly Raine",
                        "Warren Duff",
                        "Jerome Odlum",
                        "Charles Perry"
                    ],
                    "actors": [
                        "James Cagney",
                        "George Raft",
                        "Jane Bryan",
                        "George Bancroft",
                        "Maxie Rosenbloom",
                        "Stanley Ridges",
                        "Alan Baxter",
                        "Victor Jory",
                        "John Wray",
                        "Edward Pawley",
                        "Willard Robertson",
                        "Emma Dunn",
                        "Paul Hurst",
                        "Louis Jean Heydt",
                        "Joe Downing",
                        "Thurston Hall",
                        "William B. Davidson",
                        "Clay Clement",
                        "Charles Trowbridge",
                        "Harry Cording",
                        "Raymond Bailey",
                        "Abner Biberman",
                        "Martin Cichy",
                        "John Conte",
                        "John Dilson",
                        "Sam Finn",
                        "James Flavin",
                        "Arthur Gardner",
                        "Jack A. Goodrich",
                        "Fred Graham",
                        "Joe Gray",
                        "Mack Gray",
                        "Chuck Hamilton",
                        "John Harron",
                        "Eddie Hart",
                        "Al Hill",
                        "Max Hoffman Jr.",
                        "Stuart Holmes",
                        "Robert Homans",
                        "Art Howard",
                        "John Irwin",
                        "Selmer Jackson",
                        "Mike Lally",
                        "Wilfred Lucas",
                        "Walter Miller",
                        "Bert Moorhouse",
                        "Lew Morphy",
                        "Wedgwood Nowell",
                        "Frank O'Connor",
                        "Henry Otho",
                        "Paul Panzer",
                        "Bob Perry",
                        "Jack Perry",
                        "Lee Phelps",
                        "Dick Rich",
                        "John Ridgely",
                        "Hector V. Sarno",
                        "Cliff Saum",
                        "Napoleon Simpson",
                        "Garland Smith",
                        "Jack C. Smith",
                        "James P. Spencer",
                        "Charles Sullivan",
                        "Elliott Sullivan",
                        "Harry Tenbrook",
                        "Sailor Vincent",
                        "Emmett Vogan",
                        "Leo White",
                        "Jack Wise",
                        "Maris Wrixon"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Film-Noir",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 92,
                    "summary": [
                        "A corrupt D.A. (Thurston Hall) with political ambitions is angered by news stories implicating him in criminal activity and decides to frame the reporter (James Cagney) for manslaughter in order to silence him.",
                        "Although innocent, reporter Frank Ross (James Cagney) is found guilty of murder and is sent to jail. While his friends at the newspaper try to find out who framed him, Frank gets hardened by prison life and his optimism turns into bitterness. He meets fellow-inmate Stacey (George Raft) and they decide to help each other. —Leon Wolters <wolters@strw.LeidenUniv.nl>",
                        "Even though he was warned off the story, newspaper reporter Frank Ross (James Cagney) goes ahead with his story of corruption and graft in the awarding of contracts to companies owned by the powerful Hanley (Thurston Hall). They frame him for drunk driving and manslaughter and he's sent to the State penitentiary for 1 to 20 years. Life is tough in prison and the guards are cruel. Intent on eventually proving his innocence, Frank's plan is to keep his nose clean and get paroled as soon as possible. He befriends a gangster, Hood Stacey (George Raft), who has a proposition for him: if Frank helps him break out of prison, Stacey will find the truth and get him released. —garykmcd",
                        "The investigative reporter Frank Ross (James Cagney) finds evidence of corruption against a powerful politician Jesse Hanley (Thurston Hall) that is candidate to Governor in the elections. Hanley sends his gangsters to catch Frank and frame him. They knock him out, soak him with whiskey and put him unconscious in a moving car which hits another and kills the driver and two passengers. Frank can not prove that he is innocent and is sentenced to 20 years of hard labor in Rocky Point Prison. The newspaper editor tries to find evidence of Frank's innocence while he befriends the gangster Stacey (George Raft) who was sentenced to 199 years. Stacey asks Frank to help him to be accused of a crime which he had not committed since he has planned to escape from the courthouse. In return, he would help to find who had framed him using his contacts in the underworld. Will Stacey really find the responsible party for the frame-up? —Claudio Carvalho, Rio de Janeiro, Brazil"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzViZmQwYWUtOWNkZS00NjQ4LTliNGUtODg0NjM0NTRkYWMyL2ltYWdlXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "5973",
                "_score": 19.290482,
                "_source": {
                    "title": "A cada uno lo suyo",
                    "rating": 7,
                    "year": 1967,
                    "directors": [
                        "Elio Petri"
                    ],
                    "writers": [
                        "Leonardo Sciascia",
                        "Elio Petri",
                        "Ugo Pirro"
                    ],
                    "actors": [
                        "Gian Maria Volontè",
                        "Irene Papas",
                        "Gabriele Ferzetti",
                        "Laura Nucci",
                        "Mario Scaccia",
                        "Luigi Pistilli",
                        "Leopoldo Trieste",
                        "Giovanni Pallavicino",
                        "Tanina Zappalà",
                        "Luciana Scalise",
                        "Orio Cannarozzo",
                        "Anna Rivero",
                        "Michele Jannucci",
                        "Franco Tranchina",
                        "Carlo Ferro",
                        "Carmelo Oliviero",
                        "Valentino Macchi",
                        "Salvo Randone",
                        "Aldo Cascino"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Mystery"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 99,
                    "summary": [
                        "A leftist professor wants the truth about two men killed during a hunting party; but the mafia, the Church and corrupt politicians don't want him to learn it.",
                        "Sicilia, late '60s. Two men are killed during a hunting party. The hurried inquiry indicates that it was a killing made for 'honor' reasons. Paolo Laurana is a leftist professor not convinced of the official truth and starts investigating by himself. He finds some help from a solicitor, Mr. Rosello. While investigating, he is fascinated by Luisa, the widow of one of the victims. But the reality is too different from what Laurana could imagine. Reality includes not only the mafia and corrupt politicians, but also Church connections. The reality is that there could be only one end for Laurana. It won't take long. —1felco"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTBkNTY1ZmQtMGE3Mi00YzBiLWFmM2MtOTMxNmI0MTRkMDM3XkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "38785",
                "_score": 19.071178,
                "_source": {
                    "title": "The Republic",
                    "rating": 6,
                    "year": 2015,
                    "directors": [
                        "Dimitris Tzetzas"
                    ],
                    "writers": [
                        "Giannis G. Georgiou",
                        "Giannis G. Georgiou",
                        "Dimitris Tzetzas",
                        "Dimitris Tzetzas"
                    ],
                    "actors": [
                        "Prometheus Aleifer",
                        "Giannis Stankoglou",
                        "Takis Spyridakis",
                        "Errikos Litsis",
                        "Vicky Papadopoulou",
                        "Alexandros Logothetis",
                        "Petros Laoudis",
                        "Zoi Laskari",
                        "Giorgos Kimoulis",
                        "Makis Papadimitriou",
                        "Kostas Nikouli",
                        "Alexandra Hasani",
                        "Ioanna Kolliopoulou",
                        "Dimitris Liolios",
                        "Nikos Alefantos",
                        "Sultan Amir",
                        "John Bicknell",
                        "Nikol Drizi",
                        "Fratzeskos Gerakaris",
                        "Giannis Geranios",
                        "Christos Gogousis",
                        "Hionia Hiotelli",
                        "Elpida Katsafadou",
                        "Steve Kekis",
                        "Angeliki Kivotou",
                        "Maria Laina",
                        "Amie Makris",
                        "Giorgos Manitas",
                        "Vali Mavridi",
                        "Yorgos Melissinos",
                        "Anna Michalopoulou",
                        "Vivi Pagonopoulou",
                        "Babis Papanikolaou",
                        "Grigoris Papavasileiou",
                        "Blaine Reininger",
                        "Anthony Rokakis",
                        "Nikos Rousalis",
                        "Kazuaki Shitamori",
                        "Ahilleas Skevis",
                        "Vyron Theodoropoulos",
                        "Giorgos Tsamouras",
                        "Zeta Zarkou"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Thriller"
                    ],
                    "country": "Greece",
                    "languages": [
                        "Greek"
                    ],
                    "runtime": 112,
                    "summary": [
                        "A photojournalist and surveillance expert decides to go up against a system of political corruption and corporate intrigue after witnessing the murder of his brother.",
                        "Achilles is a photographer living in Athens, together with his brother. In order to make ends meet Achilles is working for Mario Sfikas, a respected political reporter who is the behind-the-scenes mastermind of an illegal ring of blackmail and extortion of the country's political and economic elite. When the Minister of Energy assigns Sfikas the surveillance of Socrates, a high profile businessman ogling Greece's natural resources, Achilles will find himself pawn amidst a cut-throat power game leading his brother to death and Achilles to a coma. Weeks later he wakes up sworn for revenge and dispensation of justice."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1MjE0OTY5NV5BMl5BanBnXkFtZTgwMTk2MDYxNzE@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "7974",
                "_score": 18.758131,
                "_source": {
                    "title": "Corrupción en el palacio de justicia italiano",
                    "rating": 6,
                    "year": 1975,
                    "directors": [
                        "Marcello Aliprandi"
                    ],
                    "writers": [
                        "Marcello Aliprandi",
                        "Ugo Betti",
                        "Gianfranco Clerici",
                        "Fernando Imbert"
                    ],
                    "actors": [
                        "Franco Nero",
                        "Fernando Rey",
                        "Umberto Orsini",
                        "Mara Danaud",
                        "Giovanna Benedetto",
                        "Umberto D'Orsi",
                        "Renato Montanari",
                        "Gabriele Ferzetti",
                        "Martin Balsam",
                        "Adriano Amidei Migliano",
                        "Roberto Antonelli",
                        "Renato Baldini",
                        "Aldo Bonamano",
                        "Francesco D'Adda",
                        "Valentino Dain",
                        "Evelyn Hanack",
                        "Carla Mancini",
                        "Nicola Morelli",
                        "Ugo Maria Morosi",
                        "Roberto Pescara",
                        "Lorenzo Piani",
                        "Bruno Rosa",
                        "Margherita Sala",
                        "Bruno Tocci",
                        "Angelo Boscariol",
                        "Augusto Brenna",
                        "Nestore Cavaricci",
                        "Fulvio Esposti",
                        "Tom Felleghy",
                        "Giuseppe Marrocco",
                        "Fulvio Mingozzi"
                    ],
                    "genres": [
                        "Thriller",
                        "Crime",
                        "Drama"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 104,
                    "summary": [
                        "During an inquest, an ambitious judge finds out that a lot of high-rank politicians are corrupt to the core."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk5NDU1Mzk1NF5BMl5BanBnXkFtZTcwNjI0NTIwMg@@._V1_SY150_CR33,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "39194",
                "_score": 18.52242,
                "_source": {
                    "title": "Chain of Command",
                    "rating": 3.4,
                    "year": 2015,
                    "directors": [
                        "Kevin Carraway"
                    ],
                    "writers": [
                        "Kevin Carraway",
                        "Lawrence Sara"
                    ],
                    "actors": [
                        "Michael Jai White",
                        "Max Ryan",
                        "Steve Austin",
                        "Ian Short",
                        "Allen Yates",
                        "Ashleigh Barnett",
                        "Carter Bratton",
                        "Shyra Thomas",
                        "Charles Page",
                        "Matthew Bentley",
                        "Joe Fidler",
                        "Ken Early",
                        "Bobby Burns",
                        "Jon Osbeck",
                        "JoAnna Pallante",
                        "Ken Strunk",
                        "Imani Lee",
                        "Brian Searle",
                        "Mike Dennis",
                        "Jon D. Wagner",
                        "John W. Lawson",
                        "Bo Roberts",
                        "Chester E. Tripp III",
                        "Michael Vehar",
                        "Aswan Harris",
                        "Dan Anders",
                        "Steven J. Colwell",
                        "Terrance Huff",
                        "Jim Owens",
                        "Nick Pirrmann",
                        "K.D. Richardson"
                    ],
                    "genres": [
                        "Action",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 88,
                    "summary": [
                        "After finding his brother murdered after returning from duty, Webster searches for the perpetrators, but discovers a conspiracy that cuts deep inside the U.S. government.",
                        "Special Operative James Webster (Michael Jai White "Blood and Bone", "The Dark Knight") just returned home from duty, only to witness the brutal slaying of his brother. Webster immediately tries to retaliate and hunt down the perpetrators, but as he delves deeper into the secret world of corruption and murder, he finds himself at the center of a deadly conspiracy that cuts deep inside the walls of the US Government. With the most ruthless military assassin (Steve Austin "The Expendables", "WWF Raw") hot on his trail, Webster must expose the corrupt high-ranking officials before he becomes just another victim of the nefarious plot. —Grindstone Entertainment Group, LLC."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTgyMTE4OTAyNl5BMl5BanBnXkFtZTgwOTQ2NTg4OTE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "15658",
                "_score": 18.084675,
                "_source": {
                    "title": "Kansas City",
                    "rating": 6.3,
                    "year": 1996,
                    "directors": [
                        "Robert Altman"
                    ],
                    "writers": [
                        "Robert Altman",
                        "Frank Barhydt"
                    ],
                    "actors": [
                        "Jennifer Jason Leigh",
                        "Miranda Richardson",
                        "Harry Belafonte",
                        "Michael Murphy",
                        "Dermot Mulroney",
                        "Steve Buscemi",
                        "Brooke Smith",
                        "Jane Adams",
                        "Jeff Feringa",
                        "A.C. Tony Smith",
                        "Martin Martin",
                        "Albert J. Burnes",
                        "Ajia Mignon Johnson",
                        "Tim Snay",
                        "Tawanna Benbow",
                        "Cal Pritner",
                        "Jerry Fornelli",
                        "Michael Ornstein",
                        "Michael Garozzo",
                        "Joe Digirolamo",
                        "John Durbin",
                        "Gina Belafonte",
                        "Nancy Marcy",
                        "Buck Baker",
                        "Dorothy Kemp-Clark",
                        "Edward Pennington",
                        "Robert Elliott",
                        "Marlon Hoffman",
                        "Patrick Oldani",
                        "Philip Trovato",
                        "James Carter",
                        "Craig Handy",
                        "David Murray",
                        "Joshua Redman",
                        "Jesse Davis",
                        "David 'Fathead' Newman Jr.",
                        "Don Byron",
                        "Olu Dara",
                        "Nicholas Payton",
                        "James Zollar",
                        "Curtis Fowlkes",
                        "Clark Gayton",
                        "Victor Lewis",
                        "Geri Allen",
                        "Cyrus Chestnut",
                        "Ron Carter",
                        "Tyrone Clark",
                        "Christian McBride",
                        "Russell Malone",
                        "Mark Whitfield",
                        "Kevin Mahogany",
                        "Paul Anselmo",
                        "Glenn Bartlett",
                        "Michael Chiles",
                        "Cameron DeVictor",
                        "Ron Licari",
                        "David McKay",
                        "Gerald McWilliams",
                        "John Pritchett",
                        "Andrew Patrick Ralston",
                        "Jason Ray",
                        "Tim Wrobel"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Music",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 116,
                    "summary": [
                        "A pair of kidnappings expose the complex power dynamics within the corrupt and unpredictable workings of 1930s Kansas City.",
                        "Robert Altman's jazz-scored film explores themes of love, crime, race, and politics in 1930s Kansas City. When Blondie O'Hara's husband, a petty thief, is captured by Seldom Seen and held at the Hey Hey Club, she launches a desperate plan to release him. She kidnaps the wife of a powerful local politician in an attempt to blackmail him into using his connections to free Johnny. Despite this being election time, he risks exposure by putting the political machine into action to free Johnny and thereby save his wife. Mrs. Stilton, meanwhile, has befriended Blondie and is impressed by her love and devotion to Johnny, especially in contrast to her own loveless marriage. —Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BODE1ZjIwMjYtMmFhMC00NGZiLTgxNmUtYTVmYTg1MDg2NDBkXkEyXkFqcGdeQXVyMTQ4NDY5OTc@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "9791",
                "_score": 18.07036,
                "_source": {
                    "title": "Dos primos y un destino",
                    "rating": 5.9,
                    "year": 1981,
                    "directors": [
                        "Bruno Corbucci"
                    ],
                    "writers": [
                        "Mario Amendola",
                        "Bruno Corbucci"
                    ],
                    "actors": [
                        "Tomas Milian",
                        "Renato Pozzetto",
                        "Anna Maria Rizzoli",
                        "Bombolo",
                        "Riccardo Billi",
                        "Caterina Boratto",
                        "Anna Cardini",
                        "Iolanda Angelucci",
                        "Francesco Anniballi",
                        "Ennio Antonelli",
                        "Andrea Aureli",
                        "Salvatore Baccaro",
                        "Sergio Di Pinto",
                        "Leo Gavero",
                        "Valerio Isidori",
                        "Elisa Mainardi",
                        "Mimmo Poli",
                        "Alfredo Rizzo",
                        "Vasco Santoni",
                        "Tony Scarf",
                        "Franco Ukmar",
                        "Piero Vivaldi",
                        "Angelo Casadei",
                        "Mario Donatone"
                    ],
                    "genres": [
                        "Comedy"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 90,
                    "summary": [
                        "An industrialist wants to corrupt a politician in Rome and here he meets Er Monnezza. The thief will help the entrepreneur to recover the stolen goods."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNWYzNWY0ZTYtYWVkZC00N2I2LWIyMzAtMWYwZmZhODE4ZWI3XkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "2742",
                "_score": 17.683968,
                "_source": {
                    "title": "Alias Nick Beal",
                    "rating": 7.1,
                    "year": 1949,
                    "directors": [
                        "John Farrow"
                    ],
                    "writers": [
                        "Jonathan Latimer",
                        "Mindret Lord"
                    ],
                    "actors": [
                        "Ray Milland",
                        "Audrey Totter",
                        "Thomas Mitchell",
                        "George Macready",
                        "Fred Clark",
                        "Geraldine Wall",
                        "Henry O'Neill",
                        "Darryl Hickman",
                        "Nestor Paiva",
                        "King Donovan",
                        "Charles Evans",
                        "Ernö Verebes",
                        "Douglas Spencer",
                        "Arlene Jenkins",
                        "Pepito Pérez",
                        "Joey Ray",
                        "Leon Alton",
                        "Edward Biby",
                        "Danny Borzage",
                        "James Burke",
                        "James Carlisle",
                        "Helen Chapman",
                        "Michael Clifton",
                        "Bob Coleman",
                        "James Conaty",
                        "James Cornell",
                        "Frank Darien",
                        "James Davies",
                        "Donya Dean",
                        "Jimmy Dime",
                        "Ray Dolciame",
                        "Lester Dorr",
                        "Allan Douglas",
                        "Tom Dugan",
                        "Jimmie Dundee",
                        "Franklyn Farnum",
                        "Julia Faye",
                        "Al Ferguson",
                        "Charles Flickinger",
                        "Bess Flowers",
                        "Howard Gardiner",
                        "Jack Gargan",
                        "Maxine Gates",
                        "Everett Glass",
                        "Dick Gordon",
                        "Herschel Graham",
                        "Bret Hamilton",
                        "Sam Harris",
                        "Theresa Harris",
                        "Percy Helton",
                        "Weldon Heyburn",
                        "Stuart Holmes",
                        "Jerry James",
                        "Gil Johnston",
                        "Geraldine Jordan",
                        "Richard Kipling",
                        "Ethan Laidlaw",
                        "Orley Lindgren",
                        "Alyn Lockwood",
                        "Ben Mantz",
                        "Jean Marshall",
                        "Frank Mayo",
                        "Russell Meeker",
                        "Harold Miller",
                        "Howard M. Mitchell",
                        "Ralph Montgomery",
                        "Frances Morris",
                        "Diana Mumby",
                        "Richard Neill",
                        "Anton Northpole",
                        "Monty O'Grady",
                        "Pat O'Malley",
                        "Steve Pendleton",
                        "Pat Phelan",
                        "Elaine Riley",
                        "Jean Ruth",
                        "Tim Ryan",
                        "Louise Saraydar",
                        "John Shay",
                        "Bill Sheehan",
                        "John Sheehan",
                        "Don Shelton",
                        "Charles Sherlock",
                        "Billy Snyder",
                        "Cap Somers",
                        "Robert R. Stephenson",
                        "Bert Stevens",
                        "Diane Stewart",
                        "Sid Tomack",
                        "Kippee Valez",
                        "Philip Van Zandt",
                        "Harold Vermilyea",
                        "Joe Whitehead",
                        "Virginia Whitmire"
                    ],
                    "genres": [
                        "Drama",
                        "Fantasy",
                        "Film-Noir",
                        "Mystery",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 93,
                    "summary": [
                        "A district attorney rises to political success and the governorship but loses his sense of morality once he starts associating with the shadowy and perhaps diabolical Nick Beal.",
                        "Righteous district attorney Joseph Foster's main goal in life is to rid his city of the gangsters infesting it. In order to be even more efficient in his war against crime he plans to run for governor. One day he meets a strange, shadowy man, Nick Beal, who offers to help him to achieve his end. Beal convinces hesitating Foster by dint of easy money, easy sex with an alluring young woman and the promise of easy success. Joseph Foster soon becomes an influential politician but a corrupt one. A minister of God manages to show him that he has been the plaything of the so-called Nick Beal, who might be "Old Nick" , that is to say Satan himself. Foster then decides to resign and to become an honest man again. —Guy Bellinger"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZGU1OGJjMzYtNTA0ZS00ODg2LWI5MDUtZTk0YTM4N2IzNmRhXkEyXkFqcGdeQXVyNTk1MTk0MDI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "7693",
                "_score": 17.398602,
                "_source": {
                    "title": "Un comisar acuzã",
                    "rating": 7.6,
                    "year": 1974,
                    "directors": [
                        "Sergiu Nicolaescu"
                    ],
                    "writers": [
                        "Eugen Burada",
                        "Vintilä Corbul",
                        "Mircea Gandila",
                        "Sergiu Nicolaescu"
                    ],
                    "actors": [
                        "Amza Pellea",
                        "Gheorghe Dinica",
                        "Ion Besoiu",
                        "Jean Constantin",
                        "Emmerich Schäffer",
                        "Sergiu Nicolaescu",
                        "Stefan Mihailescu-Braila",
                        "Alexandru Dobrescu",
                        "Marin Moraru",
                        "Vasile Nitulescu",
                        "Jean Lorin Florescu",
                        "Ion Apahideanu",
                        "Mircea Pascu",
                        "Corneliu Gîrbea",
                        "Pierre Gherase",
                        "Mihai Adrian",
                        "Adrian Stefanescu",
                        "Paul Fister",
                        "Vasile Popa",
                        "Ion Smeianu",
                        "Valeriu Arnautu",
                        "Mircea Anghelescu",
                        "Constantin Dinulescu",
                        "Andrei Bursaci",
                        "Dinu Gherasim",
                        "Virgil Popovici",
                        "Victor Mavrodineanu",
                        "Corneliu Revent",
                        "Sergiu Demetriad",
                        "Ioana Ciomârtan",
                        "Mimi Enaceanu",
                        "Rodica Mandache",
                        "Maria Cumbari",
                        "Szabolcs Cseh",
                        "Constantin Baltaretu",
                        "Cristian Grigore",
                        "Ion Bîrloiu",
                        "Maria Ploae",
                        "Ion Manolescu",
                        "Constantin Vurtejan",
                        "Sever Plocon",
                        "Aurel Popescu",
                        "Alexandru Manea",
                        "Benone Carmazan",
                        "Victor Imoseanu",
                        "Dumitru Ghiuzelea",
                        "Ion Polizache",
                        "Dumitru Craciun",
                        "Teodor Stavru",
                        "Gheorghe Mazilu",
                        "Nicolae Curta",
                        "Vasile Muresan",
                        "Petre Petrache",
                        "Simion Huluta",
                        "Ion Barbu",
                        "Miron Murea",
                        "Constantin Totoescu",
                        "Nita Anastase",
                        "Adrian Mihai"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "Romania",
                    "languages": [
                        "Romanian"
                    ],
                    "runtime": 114,
                    "summary": [
                        "The Iron Guard, also known as Legion of Archangel Michael, was a Romanian nationalist and patriotic movement of extreme right; as such, after it rose to power, it supported Nazi Germany and started a fierce campaign of retaliation against its political enemies. As such, in the night of November 26-27, 1940, the Death Teams executed forty political prisoners in the Jilava prison (in the movie, named "Viraga"), and next day, other two Teams arrested and shot the former minister Virgil Madgearu and the world famous historian Nicolae Iorga (in the movie: Costin Märgeanu and Nicolae Jugu). To squash down the political outcry, the Police Prefect Stefan Zävoianu (Visan Nävodeanu) conveniently assigns the cases to a commissioner from the "Morals Division" (prostitution, thieves), Tudor Moldovan, hoping that he will fail to get to the bottom of the case. However, Moldovan has communist sympathies, so he quickly comes under the influence of the Bolshevik Pîrvu, who had escaped during the Viraga massacre, only to be later apprehended again by the police. Pîrvu being an old friend and work mate of Moldovan's father, he feeds to the commissioner all the well-known soviet propaganda, during the interrogatories. Thus gained on the left side, Moldovan turns against the Iron Guards, in a short time gathering enough evidence to close the case. Hearing about this, the Iron Guard Senator Naumescu (Nae Ionescu) tries to bribe Moldovan - but the commissioner only accepts the money (one briefcase containing half a million lei, worth his salary for ten years) to use it for financing the communist party. He then delivers the file to the "Universul" newspaper, but the Legionnaire commissioner Paraipan, his arch enemy, retrieves it before going into print. Learning this, Naumescu orders Moldovan's dispatching. After a long and noisy series of shootouts and street action, Moldovan gradually shoots eight out of the new members of Paraipan's team, sparing only Tänäsescu, who had been assigned as his assistant during the investigation. Loyal to the cause, Tänäsescu informs Naumescu about Moldovan's whereabouts - so the Senator lays a trap for the commissioner, using Tänäsescu as bait. At the height of an unequal confrontation, in the heart of the Plumbuita slum, Moldovan is ridden with bullets by a few dozens of Legionnaires. —Mihnea Columbeanu"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTkwNjc0OTc0Ml5BMl5BanBnXkFtZTgwNjc1ODEzMTE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "33158",
                "_score": 16.95495,
                "_source": {
                    "title": "Fools on the Hill",
                    "rating": 8.1,
                    "year": 2012,
                    "directors": [
                        "Jed Rigney"
                    ],
                    "writers": [
                        "Jed Rigney"
                    ],
                    "actors": [
                        "Jerrol LeBaron",
                        "Dean Cain",
                        "Ed Begley Jr.",
                        "Cary Harrison",
                        "John Phillips",
                        "Rick Amato",
                        "Ted Baehr",
                        "Tom Schatz",
                        "Scott Baugh",
                        "Brian Darling",
                        "Marcia Fritz",
                        "William Holder",
                        "Gary Jacobsen",
                        "Desmond Lachman",
                        "Barbara Maynard",
                        "Laura Murphy",
                        "Richard Nephew",
                        "Robert Porter",
                        "Larry Smith",
                        "Nestor Valencia",
                        "Bree Walker",
                        "Dale Wetzel",
                        "Bruce Wiseman",
                        "Kristy Yale"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 80,
                    "summary": [
                        "American politicians don't write the laws or read the laws and then they pass the laws. Disgusted with the corruption, an average businessman exposes incompetence and greed while trying to single-handedly fix how laws are passed."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjAyMjcyNDY3NV5BMl5BanBnXkFtZTcwNzY1NjAxNw@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "322",
                "_score": 16.818802,
                "_source": {
                    "title": "La horda",
                    "rating": 6.7,
                    "year": 1928,
                    "directors": [
                        "Lewis Milestone"
                    ],
                    "writers": [
                        "Bartlett Cormack",
                        "Bartlett Cormack",
                        "Del Andrews",
                        "Tom Miranda",
                        "Harry Behn"
                    ],
                    "actors": [
                        "Thomas Meighan",
                        "Louis Wolheim",
                        "Marie Prevost",
                        "G. Pat Collins",
                        "Henry Sedley",
                        "George E. Stone",
                        "Sam De Grasse",
                        "Richard 'Skeets' Gallagher",
                        "Lee Moran",
                        "John Darrow",
                        "Lucien Prival",
                        "Dan Wolheim",
                        "Frank Austin",
                        "Walter Brennan",
                        "Jimmy Dime",
                        "Jim Farley",
                        "Sherry Hall",
                        "Sydney Jarvis",
                        "Tony Marlo",
                        "Burr McIntosh",
                        "Pat McKee",
                        "Lewis Milestone",
                        "William H. O'Brien",
                        "Jack Perry",
                        "Dick Rush",
                        "Charles Sullivan",
                        "Nick Thompson",
                        "Harry Wilson"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Film-Noir"
                    ],
                    "country": "United States",
                    "languages": [
                        "None",
                        "English"
                    ],
                    "runtime": 84,
                    "summary": [
                        "An honest police captain vows to bring down a powerful bootlegger who is protected by corrupt politicians and judges.",
                        "An honest police captain named McQuigg becomes a tough rival to a powerful bootlegger named Scarsi, even though McQuigg's pinches never stick because Scarsi and his organization control the corrupt politicians and judges. When Scarsi can't scare McQuigg off, he gets him transferred to a quiet police precinct in the suburbs, but McQuigg continues their war of words via a pair of wisecracking newspaper reporters. Then McQuigg catches a huge break when Scarsi's younger brother gets picked up for a hit and run accident in his precinct, putting in motion a complex plan to bring down the mobster using the reporters, a nightclub singing gold digger, the upcoming elections and Scari's own organization. —TimeNTide"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk5Mzc0MDY2N15BMl5BanBnXkFtZTgwMTg4MjQ3NDE@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "31832",
                "_score": 16.771267,
                "_source": {
                    "title": "Honest Man: The Life of R. Budd Dwyer",
                    "rating": 7.2,
                    "year": 2010,
                    "directors": [
                        "James Dirschberger"
                    ],
                    "writers": [
                        "Adam Wroblewski",
                        "James Dirschberger"
                    ],
                    "actors": [
                        "Dyan Dwyer",
                        "Joanne Dwyer",
                        "R. Budd Dwyer",
                        "Robert Dwyer",
                        "Neil O'Neill",
                        "William Smith",
                        "Steve Voldseth"
                    ],
                    "genres": [
                        "Documentary",
                        "Biography",
                        "Drama",
                        "News"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 76,
                    "summary": " Honest Man is a movie about politics and corruption, suicide and survival. Four years in the making, it explores the scandal that led an honest, hard-working man to take his own life.R. Budd Dwyer, a farm boy from the northwest of the state, was a very successful Pennsylvania politician. In 1980, on the strength of his squeaky-clean reputation, he was elected to the statewide office of Treasurer.Dwyer soon began to run afoul of Governor Dick Thornburgh, rejecting some of his padded expense vouchers and questioning the use of state troopers to transport his children to boarding school.Shortly thereafter, prosecutor James West, Governor Thornburgh's protege, indicted Budd on bribery charges. William T. Smith, a lawyer for a company called CTA, claimed to have met with Budd and offered him $300,000 to give his client a state contract.Dwyer was convicted on the strength of Smith's testimony. The day before his sentencing, he shot himself at a press conference while television cameras rolled. Over twenty years later, that shocking video is still circulating on the Internet.Was Dwyer venal, or a victim? Did he kill himself because he couldn't live with being guilty--or because he couldn't live with being innocent?The film features exclusive new interviews with Dwyer's family, friends, and colleagues, including Dwyer's widow Joanne and William T. Smith, whose testimony convicted Dwyer. This portrait of a man swept up in the turbulent and cutthroat political world of the 1980s raises important questions about Dwyer's presumed guilt. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzkxNzA3MDEyMl5BMl5BanBnXkFtZTcwNjE1Nzg4NA@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "6374",
                "_score": 16.563736,
                "_source": {
                    "title": "Yo soy la oveja negra",
                    "rating": 6.4,
                    "year": 1968,
                    "directors": [
                        "Luciano Salce"
                    ],
                    "writers": [
                        "Ennio De Concini",
                        "Luciano Salce",
                        "Adriano Baracco",
                        "Ennio De Concini",
                        "Luciano Salce"
                    ],
                    "actors": [
                        "Vittorio Gassman",
                        "Lisa Gastoni",
                        "Adrienne Larussa",
                        "Ettore Mattia",
                        "Antonio Centa",
                        "Umberto D'Orsi",
                        "James Riley",
                        "Janine Hendy",
                        "Ennio Balbo",
                        "Giampiero Albertini",
                        "Fiorenzo Fiorentini",
                        "Eugene Walter",
                        "Christopher Hodge",
                        "Michel Bardinet",
                        "Marisa Fabbri",
                        "Antonella Della Porta",
                        "Donatella Ceccarello",
                        "Tullio Altamura",
                        "Guido Spadea",
                        "Leonardo De Fraia",
                        "Giuseppe Terranova",
                        "Giovanni Ivan Scratuglia",
                        "Jimmy il Fenomeno",
                        "Ljiliana Paulovic",
                        "Pino Patti",
                        "Cesare Gelli",
                        "Lino Banfi",
                        "John Bartha",
                        "Francesco Di Federico",
                        "Ettore Geri",
                        "Alfonso Giganti",
                        "Renato Marzano",
                        "Paolo Paoloni",
                        "Antonio Proietti",
                        "Jean Rougeul",
                        "Farhad Sadighi",
                        "Luca Sportelli",
                        "Walter Williams"
                    ],
                    "genres": [
                        "Comedy"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 107,
                    "summary": [
                        "Mario and Filippo are two twin brothers, the honorable one want to bring morality back into Italian political life, as president of the Commission for the investigation of corruption. The other brother is a cynical trickster."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BODZlNGE4OGEtNTcwOS00YTVlLTkyNTgtNWU2Yjk1ZWQzMDdmXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "18561",
                "_score": 16.45796,
                "_source": {
                    "title": "El-Akhar",
                    "rating": 6,
                    "year": 1999,
                    "directors": [
                        "Youssef Chahine"
                    ],
                    "writers": [
                        "Youssef Chahine",
                        "Khaled Youssef",
                        "Khaled Youssef"
                    ],
                    "actors": [
                        "Hanan Turk",
                        "Hani Salama",
                        "Nabila Ebeid",
                        "Mahmoud Hemida",
                        "Lebleba",
                        "Hassan Abdel Hamid",
                        "Izzat Abu-Of",
                        "Ahmed Fouad Selim",
                        "Amr Saad",
                        "Ahmad Wafiq",
                        "Edward Said",
                        "Hamdine Sabahi",
                        "Tamer Samir",
                        "Muhammad Ali",
                        "Dua Amer",
                        "Maher Esam",
                        "Nirmin Fransis",
                        "Muhammad Gamal",
                        "Samir Ibrahim",
                        "Mahmood Khalifah",
                        "Amr Abul Nasr",
                        "Ahmad Sarhan"
                    ],
                    "genres": [
                        "Drama",
                        "Romance"
                    ],
                    "country": "France",
                    "languages": [
                        "French",
                        "Arabic"
                    ],
                    "runtime": 105,
                    "summary": [
                        "Egyptian director Youssef Chahine exposes the links between power and fanaticism and denounces intolerance in this bitter portrait of the Egyptian business world, where unconditional drive for money rules. Adam (Hani Salama), the son of a rich businessman and his American wife, meets Hanane (Hanane Turk), a journalist of modest means at the airport on his return from his studies in the US. She is part of a campaign against a wealthy elite, which has thrived on plundering its own people. They fall in love and get married. Corruption is everywhere in the country and American interests are taking over the lucrative tourist trade. Adam's rich parents and their friends in the government are at the heart of this corrupt system. Adam's mother, Margaret (Nabila Ebeid), nourishes a strange affection for her son. She is possessive to the point of violence and is ready to get rid of Hanane, whom she considers her rival. Adam turns against the global economy of which his parents are the perfect examples as he sees through the greed of international speculators and the secret ties that bind them to fanatical fundamentalist sects. The fact that Hanane's brother has become an Islamist terrorist does not help matters. The resistance that the couple has to put up makes them grow strong, for which they pay a heavy price. 52nd Cannes Film Festival, 1999. —ahmedzain",
                        "Adam is an Egyptian-American student who returns to Cairo for a visit and falls in love with a young journalist, Hanane. When they elope, Adam's mother becomes possessive and jealous, and determines to get rid of her young rival for her son's affections. Discovering that Hanane's brother is a terrorist, she plans her revenge. —noorezz"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOWIyNWY5MDYtOTQ1Yy00NmIzLWI5OWUtN2UzNmFlNzZjM2ViXkEyXkFqcGdeQXVyMjg0MzMwNzg@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "25036",
                "_score": 16.456535,
                "_source": {
                    "title": "De hel van Tanger",
                    "rating": 7.1,
                    "year": 2006,
                    "directors": [
                        "Frank van Mechelen"
                    ],
                    "writers": [
                        "Paul Piedfort"
                    ],
                    "actors": [
                        "Filip Peeters",
                        "Els Olaerts",
                        "Kyoko Scholiers",
                        "Emile Van Hamme",
                        "Axel Daeseleire",
                        "Peter Bolhuis",
                        "Veerle Dejonghe",
                        "Carl Ridders",
                        "Ossyane El Hassouni",
                        "Ali Wauters",
                        "Mostafa Benkerroum",
                        "Nacer Nafti",
                        "Azdine Gharbaoui",
                        "Hicham Slaoui",
                        "Rachid Benbouchta",
                        "Mohamed Bari",
                        "Brahim Waabach",
                        "Peter Gorissen",
                        "Warre Borgmans",
                        "Mieke De Groote",
                        "Nadia Abdelouafi",
                        "Johan van Assche",
                        "Sofie Decleir",
                        "Gert Lahousse",
                        "Michael De Cock",
                        "Wim Danckaert",
                        "Abdelmalek Kadi",
                        "Billy Eelen",
                        "Kamel Kenzo"
                    ],
                    "genres": [
                        "Drama"
                    ],
                    "country": "Belgium",
                    "languages": [
                        "French",
                        "Dutch",
                        "Arabic"
                    ],
                    "runtime": 105,
                    "summary": [
                        "In August 1996, bus drivers Marcel Van Loock and Wim Moreels are apprehended by the Moroccan Customs for drug trafficking. Inside their bus, hidden behind a false compartment, they have discovered 700 pounds of hashish. Although the owner of the bus company is arrested as well and makes a full confession clearly indicating that both drivers were unaware of the hidden drugs, the Moroccan judge sentences both men to 5 years in the Moroccan prison of Tangiers. Nothing could have prepared the two men for life inside a Moroccan prison. Without food, clothes or medical care, they must learn how to take care of themselves to survive their stay in prison. Corrupt guards, corrupt lawyers and judges, a consul who doesn't care and frequent beatings are only part of the terrible prison. Meanwhile their families at home are left without any information, any help or any hope - finding out that their own government doesn't care for Belgian people in prisons abroad. —Dennis"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjEzMjc3NDM2Nl5BMl5BanBnXkFtZTcwMTYyOTI0MQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "13387",
                "_score": 16.305468,
                "_source": {
                    "title": "La voz de su amo",
                    "rating": 7.1,
                    "year": 1991,
                    "directors": [
                        "Daniele Luchetti"
                    ],
                    "writers": [
                        "Franco Bernini",
                        "Angelo Pasquini",
                        "Sandro Petraglia",
                        "Stefano Rulli",
                        "Daniele Luchetti"
                    ],
                    "actors": [
                        "Silvio Orlando",
                        "Nanni Moretti",
                        "Giulio Brogi",
                        "Anne Roussel",
                        "Graziano Giusti",
                        "Lucio Allocca",
                        "Dario Cantarelli",
                        "Antonio Petrocelli",
                        "Gianna Paola Scaffidi",
                        "Giulio Base",
                        "Guido Alberti",
                        "Renato Carpentieri",
                        "Silvia Cohen",
                        "Roberto De Francesco",
                        "Dino Valdi",
                        "Ivano Marescotti",
                        "Giacomo Piperno",
                        "Salvatore Puntillo",
                        "Angela Finocchiaro",
                        "Cristina Cacace",
                        "Gabriele Ceracchini",
                        "Stefano Chiezzi",
                        "Alfredo Girard",
                        "Fabio Luzzi",
                        "Riccardo Zinna",
                        "Rosanna Cancellieri",
                        "Daniele Luchetti"
                    ],
                    "genres": [
                        "Comedy",
                        "Drama"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 95,
                    "summary": [
                        "Cesare Botero (Nanni Moretti) is a young minister well-known to be corrupted and corrupter. He is looking for an appropriate spokesman. He finds the right person in Prof. Luciano Sandulli (Silvio Orlando). Sandulli is a very good and polite person, he is positive and full of hopes, but unluckily his economic position is disastrous. So he immediately accepts the new job. He has to write all the speeches of the minister, and soon became a sort of mentor. In fact his first impact with Rome and his politician world is positive, Sandulli is really convinced the young minister want really change the situation working for the common interest. But step by step, nevertheless his economic and familiar situation gets a lot of benefits by his new job, he enters in a world in which intrigues and corruption are the only laws. The honest Sandulli will react trying to resist to the cynic world of Botero. He will come back to his students. —1felco"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDIyYjZjNmMtMTBlNi00ODNlLTgxODItMDVlZDY1NGRkZmYxXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "34618",
                "_score": 16.117624,
                "_source": {
                    "title": "The List",
                    "rating": 4.3,
                    "year": 2013,
                    "directors": [
                        "Klaus Hüttmann"
                    ],
                    "writers": [
                        "Klaus Hüttmann"
                    ],
                    "actors": [
                        "Sienna Guillory",
                        "Bill Paterson",
                        "Clive Russell",
                        "Anthony Flanagan",
                        "Louise Delamere",
                        "Nigel Planer",
                        "Andrew Havill",
                        "Andrew Leung",
                        "Charles Dale",
                        "Rita Davies",
                        "Charles De'Ath",
                        "Christopher Dane",
                        "Seamus O'Neill",
                        "Rebecca Ferdinando",
                        "Rupert Procter",
                        "Mingus Johnston",
                        "Eddie Arnold",
                        "Phil Corbitt",
                        "Mia Vore",
                        "Andy Calderwood",
                        "Richard Lee O'Donnell",
                        "Mark Tristan Eccles",
                        "Rebecca Elliot",
                        "Nakib Narat",
                        "Aoife Kennedy",
                        "Annahita Clara Lagevardi",
                        "Ferdinand Rauch",
                        "Ross Donnelly",
                        "Wilson Green"
                    ],
                    "genres": [
                        "Thriller"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": [
                        "When the man behind a popular website that rnaks the world's most corrupt individuals is voted number one on his own site, he becomes the target of a killer who is out to murder every person named to the top of "The List.",
                        "Written and directed by Palme D'Or nominee Klaus Huttmann, THE LIST is a universal and psychological thriller at the edge of our time. Christopher Cowin is in his mid 30s, a family man who owns a small advertising agency. A court case he had recently lost has shown him the rich and powerful always win! That is why Christopher creates the website THE LIST. On this site, users can label corrupt individuals in public life and award them points as to how much of a menace they are. The result is a list of politicians, CEOs and bankers. The website quickly becomes a worldwide success but suddenly, whoever is number one on THE LIST appears murdered and public opinion starts to turn against Christopher. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTIxNDg3MDkxOF5BMl5BanBnXkFtZTgwNzU0MDcyMjE@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "8520",
                "_score": 15.947554,
                "_source": {
                    "title": "Gator, el confidente",
                    "rating": 5.8,
                    "year": 1976,
                    "directors": [
                        "Burt Reynolds"
                    ],
                    "writers": [
                        "William W. Norton",
                        "Roderick Taylor"
                    ],
                    "actors": [
                        "Burt Reynolds",
                        "Jack Weston",
                        "Lauren Hutton",
                        "Jerry Reed",
                        "Alice Ghostley",
                        "Dub Taylor",
                        "Mike Douglas",
                        "Burton Gilliam",
                        "William Engesser",
                        "John Steadman",
                        "Lori Futch",
                        "Stephanie Burchfield",
                        "Dudley Remus",
                        "Alex Hawkins",
                        "J. Don Ferguson",
                        "John P. Rousakis",
                        "Patrick Moody",
                        "John Nicholson",
                        "Tommy Anderson",
                        "Georgetta Blair",
                        "Rick Allen",
                        "Cornelia Lawsen",
                        "George A. Jones",
                        "Stephen J.J. Wilder",
                        "Gwen Ferguson",
                        "Mary Sharpe",
                        "Jim Burk",
                        "Dick Ziker",
                        "Bud Miller",
                        "J.B. Pappas",
                        "Jim Rainwater",
                        "John B. Lastinger",
                        "Robert Urquhart",
                        "Sonny Shroyer",
                        "Watson B. Duncan III",
                        "Albert Weis Jr.",
                        "Albert W. Garmany III",
                        "Bob Yeager",
                        "Paul Hansen",
                        "William J. Booten Sr.",
                        "Robert Smith",
                        "Kim Trawick",
                        "Charles A. Tamburro",
                        "Norman Evans",
                        "Gus Carlucci",
                        "Dan Everett",
                        "James Best",
                        "Ned Beatty",
                        "Eric G. Mitchell"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 115,
                    "summary": [
                        "Agents force a former con man to help them nab a corrupt politician."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTQzMzIzNjY2MV5BMl5BanBnXkFtZTcwNjk3MTE3NA@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "15743",
                "_score": 15.901129,
                "_source": {
                    "title": "Mis queridos compatriotas",
                    "rating": 6.5,
                    "year": 1996,
                    "directors": [
                        "Peter Segal"
                    ],
                    "writers": [
                        "E. Jack Kaplan",
                        "Richard Chapman",
                        "E. Jack Kaplan",
                        "Richard Chapman",
                        "Peter Tolan"
                    ],
                    "actors": [
                        "Jack Lemmon",
                        "James Garner",
                        "Dan Aykroyd",
                        "John Heard",
                        "Wilford Brimley",
                        "Lauren Bacall",
                        "Sela Ward",
                        "Everett McGill",
                        "Bradley Whitford",
                        "James Rebhorn",
                        "Esther Rolle",
                        "Conchata Ferrell",
                        "Jack Kehler",
                        "Connie Ray",
                        "Tom Everett",
                        "Mark Lowenthal",
                        "Jeff Yagher",
                        "Edwin Newman",
                        "Lynn Clark",
                        "Leigh Rose",
                        "Mihoko Tokoro",
                        "Ken Enomoto",
                        "Gunnar Peterson",
                        "Scott Burkholder",
                        "Wayne Duvall",
                        "Jack Garner",
                        "Gene Boland",
                        "Francesca Rollins",
                        "Paul Feig",
                        "Cathy Ladman",
                        "Tom Wright",
                        "Dana Gould",
                        "Scott Hoxby",
                        "Jonathan Osser",
                        "Mitch Braswell",
                        "E. Arthur Booth",
                        "Steve Carlisle",
                        "Todd McDurmont",
                        "Madison Wellington",
                        "David Malloy",
                        "Jennifer Leigh Jones",
                        "Rob Roy Fitzgerald",
                        "Jennifer Austin",
                        "Bobby Bass",
                        "Steven Chambers",
                        "Jimmy Nickerson",
                        "Cara Gooden",
                        "Matthew R. Zboyovski",
                        "Michael Peña",
                        "Alex Joganic",
                        "Ocie Pouncie",
                        "Neva Howell",
                        "Sheri Mann Stewart",
                        "Pete Penuel",
                        "John O'Leary",
                        "Leighanne Littrell",
                        "Rick Hall",
                        "Eric Siegel",
                        "Ann Cusack",
                        "Jean Speegle Howard",
                        "Dorothy Lucey",
                        "Jeff Mandon",
                        "Jim Bissell",
                        "Shawn D. Woodyard",
                        "Steve Wedan",
                        "Tom Sean Foley",
                        "Michael Russo",
                        "Christopher Kriesa",
                        "William Kerr",
                        "Peter Segal",
                        "Jeffrey J. Ayers",
                        "Greg Bronson",
                        "Tory Christopher",
                        "Scott Fowler",
                        "C. Michael Haynes",
                        "Marg Helgenberger",
                        "Jan Jackson",
                        "Stephen Kelly",
                        "Jesse G. Martin",
                        "Jennifer L. Ray",
                        "Robert Shepherd",
                        "Sam P. Whitehead"
                    ],
                    "genres": [
                        "Adventure",
                        "Comedy"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Spanish"
                    ],
                    "runtime": 101,
                    "summary": [
                        "Two former U. S. Presidents, hated rivals, join forces to expose the current, corrupt President at the risk of their lives.",
                        "Kramer and Douglas, two former presidents from opposite ends of the political spectrum, become reluctant allies when they become the target of a conspirator in President Haney's administration. The two ex-presidents realize they have an enemy within the government and set out to find evidence that will clear their names. The search takes them across the Southern Appalachians; along the way they meet a homeless couple, thwart kidnapers in the parking lot of a fast-food restaurant, and find themselves marching in a gay pride parade. —Dennis Lewis <dsl@sprynet.com>",
                        "They used to run the country. Now they're running for their lives! Two on-the-lam former Presidents of the United States. Framed in a scandal by the current President and pursued by armed agents, the two squabbling political foes plunge into a desperately frantic search for the evidence that will establish their innocence. As the scramble through the real America, they get an unexpected crash course in how their policies affected the citizens. —Robert Lynch <docrlynch@yahoo.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZTNmYTdmOTAtMjYzMS00YjAzLTg1ZTUtNDk3ZWVjYWEwNjFjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "12912",
                "_score": 15.853803,
                "_source": {
                    "title": "Difícil de matar",
                    "rating": 5.8,
                    "year": 1990,
                    "directors": [
                        "Bruce Malmuth"
                    ],
                    "writers": [
                        "Steven McKay"
                    ],
                    "actors": [
                        "Steven Seagal",
                        "Kelly LeBrock",
                        "William Sadler",
                        "Frederick Coffin",
                        "Bonnie Burroughs",
                        "Andrew Bloch",
                        "Branscombe Richmond",
                        "Charles Boswell",
                        "Zachary Rosencrantz",
                        "Lou Beatty Jr.",
                        "Nick DeMauro",
                        "Nick Corello",
                        "Justin De Rosa",
                        "Stanley Brock",
                        "Evan James",
                        "Tomas Trujillo",
                        "Robert LaSardo",
                        "Haruo Matsuoka",
                        "Craig Dunn",
                        "Tony Perez",
                        "Steve Jones",
                        "Francesca P. Roberts",
                        "James DiStefano",
                        "Dean Norris",
                        "Michael Fosberg",
                        "Buddy Joe Hooker",
                        "Jerry Dunphy",
                        "Barbara Townsend",
                        "Carlos Gómez",
                        "Christian Duffy",
                        "Andrea Stein",
                        "Eddie Frias",
                        "Michael Adler",
                        "Geoffrey Bara",
                        "Kent Turnipseed",
                        "Janet Zappala",
                        "Ernie Lively",
                        "Frank Conn",
                        "Philip Weyland",
                        "Sheri Hueffmeier",
                        "Linda Klein",
                        "Gary McLarty",
                        "James Thompson",
                        "Tom Muzila",
                        "Catherine Quinn",
                        "Richard Kwong",
                        "Osama Joseph Sabbagh",
                        "Richard Wakasa",
                        "Al Goto",
                        "Bernie Bielawski",
                        "Julia Stormson",
                        "Jack Eiseman",
                        "Mickey McMeel",
                        "James Kindelon",
                        "Ruben Avitia",
                        "Kenny Endoso",
                        "Liam Ferguson",
                        "Jeff Imada",
                        "Geraldo Rivera"
                    ],
                    "genres": [
                        "Action",
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 96,
                    "summary": " In 1983 Mason Storm (Seagal) is a Los Angeles police detective who is investigating a mob meeting taking place by a pier. He spies on them with a video camera and captures on tape a shadowy figure telling the other people that they can rely on his political support, emphasizing this by saying "And you can take that to the bank!" Storm is spotted but manages to get away. Driving home and unaware of another pair of cops listening in, Mason informs first his partner then his friend Lt. O'Malley (Coffin) that he has evidence of corruption, and will be bringing the tape to them soon. He goes into a store to get Champagne and a teddy bear to give to his son. The store is robbed, with one of the robbers shooting the clerk. Mason manages to stop them and afterward goes home, intent on celebrating with his wife Felicia (Bonnie Burroughs). Before he does anything else, Mason hides the tape in a small hole in his kitchen wall. When he goes upstairs, a hit squad composed of corrupt policemen, including Jack Axel (Boswell) and Max Quentero (Richmond), working for the politician, break in. Mason is shot non-fatally at first and his wife is killed. Another shot brings Mason down. Mason's young son Sonny, (Bara) manages to hide until the danger passes. At the same time, Storm's partner is shot by a masked assassin whilst seated beside his window. At the hospital, Mason is pronounced dead. As O'Malley stalks off, a doctor tells him Mason was revived but in a coma. Lieutenant O'Malley informs the medics to tell people that Mason died, and hide is identity under a "John Doe" to prevent anyone from coming back for him later. Mason is set up by the corrupt policemen as having murdered his wife and committed suicide. A montage shows a string of events during the next seven years where Trent has become a powerful and influential US Senator.One day Mason wakes from his coma. Andy (LeBrock), one of the two nurses monitoring him, makes a phone call, which is intercepted by one of the corrupt police officers who want to see Mason dead. They send Jack Axel to the hospital to finish the job and kill the nurses to whom Mason might have talked. Mason realizes that he is still in danger but his muscles have atrophied to where he can barely use his arms. He manages to get himself to an elevator, and when Andy sees her colleagues killed, she helps Mason escape from the hospital.Needing time to recuperate, Andy brings Mason to a friend's house in a secluded mountain area, where Mason uses his knowledge of acupuncture, moxibustion and other meditation techniques to recover his strength. While training, Mason hears a commercial for Senator Vernon Trent (Sadler) on television, who caps the commercial with the phrase, "And you can take that to the bank!" Recognizing the voice, Mason now knows who he has to go after to get his revenge and even mocks Trent's phrase by saying "I'm gonna take you to the bank, Senator Trent. To the blood bank!". Mason contacts O'Malley, who comes over with some weapons for Mason. O'Malley tells Mason that his son is still alive - O'Malley took Mason's son in and raised him, sending him to a private school so that he would be out of danger. O'Malley then leaves. However, Senator Trent's men find the house where Mason and Andy are and attempt to kill them, but Mason manages to get them both out again.Mason then goes back to his old house. Posing as realtors looking to see if the house is one that can be put on the market, Mason breaks through the plaster in the kitchen to retrieve the video camera and tape he'd hidden seven years before. Mason then goes to meet O'Malley in a train station, where O'Malley brings Mason's now teenage son. They do not see each other, because as Mason arrives, O'Malley is already dead having been shot (by Max) after giving the tape to Andy for safe-keeping while providing a distraction for Sonny (Rosencrantz) to get away. When Mason arrives, he sees his son running away from two of the corrupt officers (recognizing one who helped murder his wife). Mason catches up with the men, kills Max and saves his son and decides to go after Senator Trent at his home.At the Senator's mansion, Mason sneaks in and manages to take the Senator's men down one by one. Mason fights with Axel in the billiard room, ending with him jamming a pool stick into his neck. Mason finally manages to confront Senator Trent and holds him at gunpoint when the police storm the mansion. However, rather than arresting Mason, the police arrest Senator Trent and take him away. Mason is then reunited with Andy and his son and walk off as the image from the videotape is played, showing Trent coming out of the shadows briefly, wondering who it is that is taping him. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NzE1NTU5N15BMl5BanBnXkFtZTgwNTgwNTg4NjE@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "12590",
                "_score": 15.741589,
                "_source": {
                    "title": "Marquis",
                    "rating": 6.8,
                    "year": 1989,
                    "directors": [
                        "Henri Xhonneux"
                    ],
                    "writers": [
                        "Roland Topor",
                        "Henri Xhonneux",
                        "Marquis de Sade"
                    ],
                    "actors": [
                        "François Marthouret",
                        "Valérie Kling",
                        "Michel Robin",
                        "Isabelle Wolfe",
                        "Vicky Messica",
                        "Nathalie Juvet",
                        "René Lebrun",
                        "Bob Morel",
                        "Roger Crouzet",
                        "Willem Holtrop",
                        "Eric De Sarria",
                        "Henri Rubinstein",
                        "Peter Fischer",
                        "Hans Mauli",
                        "Jacques Bouanich",
                        "Jean-Daniel Boucry",
                        "Philippe Dumond",
                        "Serge Blumental",
                        "Philippe Bizot",
                        "Bien de Moor",
                        "Gabrielle van Damme",
                        "Olivier Dechaveau",
                        "Bernard Cogniaux",
                        "Pierre Decuypere"
                    ],
                    "genres": [
                        "Comedy"
                    ],
                    "country": "Belgium",
                    "languages": [
                        "French"
                    ],
                    "runtime": 83,
                    "summary": [
                        "The scene is a pre-French Revolution Bastille, where various political prisoners are being held: a woman who was raped and impregnated by the king, a police chief who was accused of selling bad pork, and the Marquis, who was unjustly accused of working for the overthrow of the king. The Marquis is only interested in writing his deviant stories, while his penis yearns for a little action (they argue about this frequently), the prime candidate being the jailer who likes to be buggered. The corrupt priest arranges to have the pregnant woman raped by the Marquis so they can claim the king had nothing to do with it. The priest also steals the Marquis' manuscripts and publishes them for his own profit. Things come to a head as the people rise up against the tyranny. —Ed Sutton <esutton@mindspring.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTk5NDkxODQ4M15BMl5BanBnXkFtZTcwMTc4NjcyMQ@@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "1665",
                "_score": 15.729705,
                "_source": {
                    "title": "El gran McGinty",
                    "rating": 7.3,
                    "year": 1940,
                    "directors": [
                        "Preston Sturges"
                    ],
                    "writers": [
                        "Preston Sturges"
                    ],
                    "actors": [
                        "Brian Donlevy",
                        "Muriel Angelus",
                        "Akim Tamiroff",
                        "Allyn Joslyn",
                        "William Demarest",
                        "Louis Jean Heydt",
                        "Harry Rosenthal",
                        "Arthur Hoyt",
                        "Libby Taylor",
                        "Thurston Hall",
                        "Steffi Duna",
                        "Esther Howard",
                        "Frank Moran",
                        "Jimmy Conlin",
                        "Dewey Robinson",
                        "Donnie Kerr",
                        "Joyce Arleen",
                        "Drew Roddy",
                        "Sheila Sheldon",
                        "George Anderson",
                        "Sylvia Andrew",
                        "William 'Billy' Benedict",
                        "Sammy Blum",
                        "Richard Carle",
                        "Ed Cassidy",
                        "Pauline Drake",
                        "William Edmunds",
                        "Betty Farrington",
                        "Byron Foulger",
                        "Duke Green",
                        "Harry Hayden",
                        "Lorimer Johnston",
                        "Charles McAvoy",
                        "Wanda McKay",
                        "George Melford",
                        "Charles R. Moore",
                        "Bert Moorhouse",
                        "Paul Newlan",
                        "Enrique Orona",
                        "Emory Parnell",
                        "Jean Phillips",
                        "Victor Potel",
                        "C.L. Sherwood",
                        "Lee Shumway",
                        "Walter Soderling",
                        "Larry Steers",
                        "Kay Stewart",
                        "Dorothy Vernon",
                        "Bess Wade",
                        "Robert Warwick",
                        "Pat West"
                    ],
                    "genres": [
                        "Comedy"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Russian"
                    ],
                    "runtime": 82,
                    "summary": [
                        "Dan McGinty has great success in his chosen field of crooked politics, but he endangers it all in one crazy moment of honesty.",
                        "Told in flashback, Depression-era bum Dan McGinty is recruited by the city's political machine to help with vote fraud. His great aptitude for this brings rapid promotion from "the boss,
                        " who finally decides he'd be ideal as a new, nominally "reform" mayor; but this candidacy requires marriage. His in-name-only marriage to honest Catherine proves the beginning of the end for dishonest Dan... —Rod Crawford <puffinus@u.washington.edu>",
                        "Tending bar in a seedy club in an out of the way banana republic, Daniel McGinty recounts his recent rise and fall to one of the club's chorus girls and a down on his luck American with suicidal thoughts. The rise began back in the United States where, as a tough guy hobo, he caught the attention of a man simply known as "the Boss" for his ingenuity and chutzpah. The Boss rigged elections for the sole purpose of political grafting, this election for mayor. The Boss hired McGinty to be his muscle, then moved him directly into the political realm when he needed a candidate with no name and thus no background to question. That political realm started as alderman then mayor the state governor. As part of his outward show of respectability, McGinty entered into a marriage of convenience with his secretary, Catherine, which included a built in family. McGinty's life with Catherine and his work for The Boss ended up being incompatible as McGinty, on Catherine's urging, wanted to go straight, while the law began to catch up with The Boss and anyone associated with him. —Huggo",
                        "In a dive south of the border, bartender Dan McGinty stops a young man from committing suicide after a moment of dishonesty, and relates how a moment of honesty brought him down in a flashback. As a young man, McGinty joins a crooked political boss and rises from extortionist to alderman. Urged by the boss to marry his secretary to give respectability to his run for mayor, McGinty agrees -- only to fall in love with his wife and decide to do an honest thing for once in his life. —Jwelch5742",
                        "Dan McGinty, originally just a hobo, proves his toughness to a mob boss who takes him in. He earns the position of alderman, and then mayor, in a corrupt city administration. Along the way he enters a marriage of convenience with Catherine. Good natured Catherine gives him the appearance of a family man which Dan rides to the Governorship. When Catherine convinces him to do some real good with his authority, the mob boss is not so agreeable... —Gary Jackson <garyjack5@cogeco.ca>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BY2ViZDdjOTgtOTkyMi00YTI3LWIxYmQtMzYyZWQ5ZjVhMzFkXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "32008",
                "_score": 15.654853,
                "_source": {
                    "title": "Draquila - L'Italia che trema",
                    "rating": 7.5,
                    "year": 2010,
                    "directors": [
                        "Sabina Guzzanti"
                    ],
                    "writers": [
                        "Sabina Guzzanti"
                    ],
                    "actors": [
                        "Silvio Berlusconi",
                        "Sabina Guzzanti"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 93,
                    "summary": [
                        "An investigation on the management of 2009 L'Aquila earthquake by Berlusconi government and his staff.",
                        "Sabina Guzzanti and her crew interview earthquake victims and experts, unveiling the myth of a perfect management of the emergence. Waste of money, propaganda, alleged corruption are underlined with an open eye on the backstage of a media success story - L'Aquila earthquake management. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTdlNWQ0OTUtMTNkNC00MTcxLThiZmEtNGE2MjYxNGYwNjM4XkEyXkFqcGdeQXVyNTA0OTU0OTQ@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "17983",
                "_score": 15.516539,
                "_source": {
                    "title": "Ladoni",
                    "rating": 7.7,
                    "year": 1994,
                    "directors": [
                        "Artour Aristakisian"
                    ],
                    "writers": [
                        "Artour Aristakisian"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "Russia",
                    "languages": [
                        "Russian"
                    ],
                    "runtime": 140,
                    "summary": [
                        ""My little son, it's me, your father..." The narrator tries to communicate with his unborn son and takes off on a journey were you see faces of apparitions of those outcasts, who find their solace of living only in the shadows; outside, but beside, the political and economical system; system that kills the individual and creates masses instead. These outcasts are bums, cripples, madmen, lunatics. They, in the eyes of the narrator, are the only ones, that know what it means to be human. They are not corrupt by the masses or the system; they are so overwhelmed by their madness or dreams, that they have lost the relationship with the world. They live in a world of their own, thus enabling freedom from the system. What they do, is wait. They quietly wait for the day the kingdom of God will descend upon earth. —DrStrangelife"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTcxOTk5ODI1MF5BMl5BanBnXkFtZTcwNjEzMDQ1MQ@@._V1_SY150_CR8,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "1478",
                "_score": 15.496818,
                "_source": {
                    "title": "The Angels Wash Their Faces",
                    "rating": 6,
                    "year": 1939,
                    "directors": [
                        "Ray Enright"
                    ],
                    "writers": [
                        "Michael Fessier",
                        "Niven Busch",
                        "Robert Buckner",
                        "Jonathan Finn"
                    ],
                    "actors": [
                        "Ann Sheridan",
                        "Billy Halop",
                        "Bernard Punsly",
                        "Leo Gorcey",
                        "Huntz Hall",
                        "Gabriel Dell",
                        "Bobby Jordan",
                        "Ronald Reagan",
                        "Bonita Granville",
                        "Frankie Thomas",
                        "Henry O'Neill",
                        "Eduardo Ciannelli",
                        "Berton Churchill",
                        "Bernard Nedell",
                        "Dick Rich",
                        "Jackie Searl",
                        "Margaret Hamilton",
                        "Marjorie Main",
                        "Minor Watson",
                        "Cy Kendall",
                        "Grady Sutton",
                        "Aldrich Bowker",
                        "Robert Strange",
                        "Egon Brecher",
                        "Sarah Padden",
                        "Nat Carr",
                        "Claude Wisberg",
                        "Ann Bupp",
                        "Frankie Burke",
                        "Glen Cavender",
                        "Eddy Chandler",
                        "Jack Rube Clifford",
                        "Frank Coghlan Jr.",
                        "Eddie Graham",
                        "John Hamilton",
                        "Sibyl Harris",
                        "John Harron",
                        "Howard Hickman",
                        "Max Hoffman Jr.",
                        "Stuart Holmes",
                        "William Hopper",
                        "Edward Keane",
                        "Jack Mower",
                        "Garry Owen",
                        "Paul Panzer",
                        "Lee Phelps",
                        "John J. Richardson",
                        "John Ridgely",
                        "Cliff Saum",
                        "Harry Strang",
                        "Charles Trowbridge",
                        "Jack Wagner",
                        "Tom Wilson"
                    ],
                    "genres": [
                        "Drama",
                        "Romance"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 86,
                    "summary": [
                        "A young man just released from a reformatory moves to a new neighborhood with his sister, intending to start a new life, but he gets mixed up with the local mob boss and corrupt politicians and soon finds himself being framed for an arson and murder he didn't commit. —frankfob2@yahoo.com"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzZlNDVkOWItMTMzYy00NDdhLWIzMDEtMTM1MzFmMTQ2N2NlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "18244",
                "_score": 15.107323,
                "_source": {
                    "title": "Traffic",
                    "rating": 7.6,
                    "year": 2000,
                    "directors": [
                        "Steven Soderbergh"
                    ],
                    "writers": [
                        "Simon Moore",
                        "Stephen Gaghan"
                    ],
                    "actors": [
                        "Benicio Del Toro",
                        "Jacob Vargas",
                        "Andrew Chavez",
                        "Michael Saucedo",
                        "Tomas Milian",
                        "J.R. Yenque",
                        "Emilio Rivera",
                        "Michael O'Neill",
                        "Michael Douglas",
                        "Russell G. Jones",
                        "Lorene Hetherington",
                        "Eric Collins",
                        "Beau Holden",
                        "Peter Stader",
                        "James Lew",
                        "Jeremy Fitzgerald",
                        "Russell Solberg",
                        "Luis Guzmán",
                        "Don Cheadle",
                        "Don Snell",
                        "Enrique Murciano",
                        "Gary Carlos Cervantes",
                        "Leticia Bombardier",
                        "Miguel Ferrer",
                        "Carl Ciarfalio",
                        "Steven Lambert",
                        "Gilbert Rosales",
                        "Rick Avery",
                        "Mario Roberts",
                        "Eileen Weisinger",
                        "Keii Johnston",
                        "Mike Watson",
                        "Kurt D. Lott",
                        "Lincoln Simonds",
                        "Steve Tomaski",
                        "Buck McDancer",
                        "John Callery",
                        "Ousaun Elam",
                        "Brian Avery",
                        "Corey Spears",
                        "Majandra Delfino",
                        "Topher Grace",
                        "Erika Christensen",
                        "Alec Roberts",
                        "Catherine Zeta-Jones",
                        "Rena Sofer",
                        "Stacey Travis",
                        "Jennifer Barker",
                        "Dean Faulkner",
                        "Albert Finney",
                        "D.W. Moffett",
                        "James Brolin",
                        "Daniella Kuhn",
                        "Brandon Keener",
                        "Bill Weld",
                        "George Blumenthal",
                        "Stephen Dunham",
                        "Don Nickles",
                        "Margaret Travolta",
                        "Harry Reid",
                        "Jeff Podolsky",
                        "Jewelle Bickford",
                        "Barbara Boxer",
                        "Orrin Hatch",
                        "Chuck Grassley",
                        "Dave Hager",
                        "Tucker Smallwood",
                        "Steven Bauer",
                        "Marisol Padilla Sánchez",
                        "Amy Irving",
                        "Dennis Quaid",
                        "Clifton Collins Jr.",
                        "Víctor Quintero",
                        "Toby Holguin",
                        "Ramiro González",
                        "Viola Davis",
                        "James Pickens Jr.",
                        "Peter Riegert",
                        "Elaine Kagan",
                        "John Slattery",
                        "Jimmy Ortega",
                        "Greg Boniface",
                        "Thomas Rosales Jr.",
                        "Rudy M. Camacho",
                        "Vonte Sweet",
                        "Ed Breving",
                        "Yul Vazquez",
                        "Jack Conley",
                        "Eddie Velez",
                        "Craig N. Chretien",
                        "John Brown",
                        "Mike Siegel",
                        "Joel Torres",
                        "Stephen J. Rose",
                        "Kimber Fritz",
                        "Harsh Nayyar",
                        "Mary Pat Gleason",
                        "Vincent M. Ward",
                        "Benjamin Bratt",
                        "Jsu Garcia",
                        "Gregory Estevane",
                        "Alex Procopio",
                        "Rita Gomez",
                        "Kaizaad Kotwal",
                        "David Jensen",
                        "Jay Krymis",
                        "Mike Malone",
                        "Rene Pereyra",
                        "Kymberly Newberry",
                        "Carroll Schumacher",
                        "Ben Scott",
                        "Michael Showers",
                        "Fred Anderson",
                        "David Bickford",
                        "Robert Randolph Caton",
                        "John Chapon",
                        "Cecile Cinco",
                        "Adam Clark",
                        "Chic Daniel",
                        "Sonia Debreczeni",
                        "Alan Easley",
                        "Choel Evans",
                        "Rod Fielder",
                        "Tony Guma",
                        "Valerie Hanna",
                        "Salma Hayek",
                        "Cathy Irons",
                        "Elizabeth Jarosz",
                        "Dominic Koulianos",
                        "Zachary Lindsey",
                        "Meagan Adele Lopez",
                        "Christie McNew",
                        "Ambrit Millhouse",
                        "Ken Miyamoto",
                        "David Pittinger",
                        "Darlynne Reyes Menkin",
                        "Lorenzo Rodriguez",
                        "Christopher Rogers",
                        "Leo Rogstad",
                        "Laurent Schwaar",
                        "Joey Sotello",
                        "William Christopher Stephens",
                        "Lynn Struiksma",
                        "John Michael Stubbins",
                        "Clyde Tull",
                        "Fairly Tull",
                        "Jim Cody Williams",
                        "Anthony Hawkins Woods",
                        "Jessica Yoshimura",
                        "William 'Shorty' Young"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Spanish"
                    ],
                    "runtime": 147,
                    "summary": " The film begins in Mexico, where police officer Javier Rodriguez Rodriguez (Del Toro) and his partner, Manolo, stop a drug transport and arrest the couriers. Their arrest is interrupted by General Salazar (Milian), a high-ranking Mexican official. The general decides to hire Javier and instructs him to locate and apprehend Frankie Flowers (Collins, Jr.) a notorious hit man for the Tijuana Obregón Drug Cartel.Meanwhile, Robert Wakefield (Douglas), a conservative Ohio Judge, is appointed to be head of the President's Office of National Drug Control, taking the title of Drug Czar. Wakefield is warned by his predecessor and several influential politicians that the war on drugs is unwinnable. Unbeknownst to Wakefield, his honor student daughter, Caroline (Christensen) is using cocaine and falls victim to drug addiction when she is introduced to freebase cocaine by her boyfriend, Seth (Grace). She and Seth are arrested when another student at her high school overdoses on drugs and they try to dump him anonymously at a nearby hospital. Robert finds out that his wife Barbara (Irving) has known about their daughter's involvement with drugs for over six months.In the third plot line, which is set in San Diego, an undercover Drug Enforcement Administration (DEA) investigation led by Montel Gordon (Cheadle) and Ray Castro (Guzmán), arrest Eduardo Ruiz (Ferrer), a high-stakes dealer posing as a fisherman. In the process, Ruiz is hospitalized and decides to risk the dangerous road to immunity by giving up his boss - drug lord Carlos Ayala (Bauer), the biggest distributor for the Óbregon brothers in the United States. Ayala is charged by a tough prosecutor, hand-selected by Wakefield in an attempt to send a message to the Mexican drug organizations through a conviction against the drug lord.Flowers is tortured and eventually gives Salazar the names of several important members of the Óbregon Drug Cartel, who are arrested in a large effort by police and army soldiers. Javier and Salazar's efforts start to cripple the Óbregon brothers cocaine outfit, but Javier and Manolo discover that Salazar is a pawn for the Juárez Cartel, the rival of the Óbregon brothers. The entire Mexican anti-drug campaign is a fraud, as Salazar is wiping out one cartel, not out of duty, but rather because he has aligned himself with another cartel for profit.Wakefield realizes that his daughter is a drug addict and finds himself caught between his demanding new position and his worrisome family life. When he heads to Mexico, he is encouraged by the successful efforts of Salazar against the Óbregon brothers. When he returns to Ohio, Robert learns that his efforts to see Caroline rehabilitated have failed, and she escaped into the city and no one knows her location. Secretly, she's forced to prostitute herself and rob her parents to procure money for drugs.As the trial against Carlos Ayala begins, Carlos' pregnant wife, Helena (Zeta-Jones) learns of her husband's true profession. With her husband facing life imprisonment, and death threats against her only child, she decides to hire Flowers to assassinate Eduardo Ruiz. She knows that killing Ruiz will effectively end the trial nolle prosequi.Javier's partner, Manolo, sells information to the DEA, but is killed for his betrayal. Javier, who can no longer stomach working for Salazar, decides to cut a deal with the only non-corrupt organization he has access to - the Federal Government of the United States and the Federal Bureau of Investigation. In exchange for his testimony, Javier requests electricity in his neighborhood, so that kids can play baseball at night rather than be tempted into street gangs and crime. General Salazar's secrets are revealed to the public. He is arrested and tortured to death shortly after.Wakefield begins a search for his daughter and drags along Seth after interrupting one of his classes. After being threatened and nearly killed by Caroline's regular dealer, he follows Seth to a seedy hotel room in Cincinnati and finds a semi-conscious Caroline prostituting herself to an older man. Wakefield returns to Washington, D.C., to give his prepared speech on a "10-point plan" to combat the war on drugs. In the middle of the speech, he falters, then tells the press that on a war on drugs is a war against many of our own family members, which he cannot endorse. He quits his job and heads home.Flowers' assassination attempt on Ruiz fails, when he himself is assassinated for his betrayal by a sniper working for the Óbregon Cartel. Helena, knowing that Ruiz is soon to testify, then makes a deal with Juan Óbregon (Bratt), lord of the drug cartel, who forgives the debt of the Ayala family. Helena gives Óbregon the formula and procedure to turn Óbregon cocaine into harmless-looking plastic rabbit dolls that are undetectable by DEA dogs and can be shipped across the Mexico/US border. Óbregon agrees to the deal and to the stipulation that Helena's husband will be the sole distributor of Óbregon cocaine in the United States. Óbregon also agrees to have Ruiz killed. Carlos Ayala is released, much to the discomfort of Montel Gordon, who lost his partner, Castro, when Frankie tried to assassinate Ruiz with a car bomb. Ruiz is eventually given poison-laced food in his hotel room and dies. Soon after, Montel bursts into the Ayala residence and illegally plants a microphone under one of the tables, before being kicked out.Robert and Barbara begin to go to Narcotics Anonymous meetings with their daughter, to support her and everyone else there. Javier takes the media to Mexico and explains what he can about the widespread corruption in the police force and army. The film concludes with him watching some Mexican children playing baseball at night, at their new stadium. ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDA2YjNkMjEtZjcwNy00ZTc5LWEzNDItMjE0ODlmMDAzNDFkXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "10090",
                "_score": 15.007812,
                "_source": {
                    "title": "Tres hermanos",
                    "rating": 7.1,
                    "year": 1981,
                    "directors": [
                        "Francesco Rosi"
                    ],
                    "writers": [
                        "Tonino Guerra",
                        "Francesco Rosi",
                        "Andrey Platonov"
                    ],
                    "actors": [
                        "Philippe Noiret",
                        "Michele Placido",
                        "Vittorio Mezzogiorno",
                        "Andréa Ferréol",
                        "Maddalena Crippa",
                        "Rosaria Tafuri",
                        "Marta Zoffoli",
                        "Tino Schirinzi",
                        "Simonetta Stefanelli",
                        "Pietro Biondi",
                        "Charles Vanel",
                        "Accursio Di Leo",
                        "Luigi Infantino",
                        "Girolamo Marzano",
                        "Gina Pontrelli",
                        "Ferdinando Greco",
                        "Cosimo Milone",
                        "Ferdinando Murolo",
                        "Maria Antonia Capotorto",
                        "Francesco Capotorto",
                        "Cristofaro Chiapparino",
                        "Sergio Castellitto"
                    ],
                    "genres": [
                        "Drama"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 113,
                    "summary": [
                        "Three men face their mother's death.",
                        "In a farmhouse in southern Italy, an old woman dies. Her husband summons their sons: from Rome, Raffaele, a judge facing a political case for which he risks assassination; from Naples, the religious and ideological Rocco, a counselor at a correctional institute for boys; from Turin, Nicola, a factory worker involved in labor disputes. Once home, each encounters the past and engages in reveries of what may come: Raffaele imagines his death, Rocco dreams of lifting the youth of Naples out of violence, drugs, and corruption, Nicola pictures embracing his estranged wife. Meanwhile, the old man and his young granddaughter explore the rhythms of the farm and grieve together. —<jhailey@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNmJkZjQ4ZDAtZmU1OS00NzM4LTg0ODItMWQ1OTRkYzhmMjBkXkEyXkFqcGdeQXVyMTAxMDQ0ODk@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "35945",
                "_score": 14.986338,
                "_source": {
                    "title": "Getting Back to Abnormal",
                    "rating": 7.6,
                    "year": 2013,
                    "directors": [
                        "Louis Alvarez",
                        "Andy Kolker",
                        "Peter Odabashian"
                    ],
                    "genres": [
                        "Documentary",
                        "Comedy",
                        "Drama"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": [
                        "'Getting Back To Abnormal' is an intimate look at race, politics and culture in post-Katrina New Orleans. Five years after the storm, New Orleans has changed. It is less black and less poor, and one polarizing white politician has become a lightning rod for all things racial. Councilperson Stacy Head, a self-styled corruption fighter, takes her sometimes jaw-droppingly politically incorrect style into the tribal world of New Orleans politics as she fights to maintain her seat in a black majority district. Weaved into the narrative are stories about housing, and commentary from only-in-New Orleans armchair philosophers. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTU3NzQyODIyM15BMl5BanBnXkFtZTcwMDgzOTM2OQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "7696",
                "_score": 14.833922,
                "_source": {
                    "title": "Otra vez al ataque, Dobermans",
                    "rating": 5.7,
                    "year": 1973,
                    "directors": [
                        "Byron Chudnow"
                    ],
                    "writers": [
                        "Alan Alch",
                        "Jack Kaplan"
                    ],
                    "actors": [
                        "Charles Robinson",
                        "Tim Considine",
                        "Joan Caulfield",
                        "David Moses",
                        "Claudio Martínez",
                        "Tom Dever",
                        "George 'Buck' Flower",
                        "Ancel Cook",
                        "Horace Irwin",
                        "Lance Hilliard",
                        "Don Maich",
                        "Dan Millington",
                        "Gale Jensen",
                        "Richard Stahl",
                        "John War Eagle",
                        "Diane Prior",
                        "David Somerville",
                        "Bill Dyer",
                        "Cory Brandon",
                        "Larry French"
                    ],
                    "genres": [
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": [
                        "Three men track down a pack of dobermans and along with a young Native American boy, train the dogs to rob the campaign funds of a politician.",
                        "With their custom-made bags crammed with cash after the incredible bank heist in The Doberman Gang (1972), the ferocious team of four-legged thieves is on the loose, heading to the countryside. As every police officer in town tries to track down the enormous loot, a trio of opportunists--Greg, Warren, and Steve--have come up with a plan to summon the dogs and train them to do their bidding. Now, a new mission involving dirty money from a corrupt politician awaits the trained canines, and, unknowingly, Billy, an animal-loving Native American boy, is going to help them. Can the daring Dobermans pull off yet another perfect robbery? —Nick Riganas"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjg4ZGQ2YzAtMzkzMi00NDFiLWE5NTYtZmQ0YjhhMjZmNzc5XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "27749",
                "_score": 14.730812,
                "_source": {
                    "title": "4 meses, 3 semanas, 2 días",
                    "rating": 7.9,
                    "year": 2007,
                    "directors": [
                        "Cristian Mungiu"
                    ],
                    "writers": [
                        "Cristian Mungiu"
                    ],
                    "actors": [
                        "Anamaria Marinca",
                        "Laura Vasiliu",
                        "Vlad Ivanov",
                        "Alexandru Potocean",
                        "Luminita Gheorghiu",
                        "Adi Carauleanu",
                        "Liliana Mocanu",
                        "Tania Popa",
                        "Teodor Corban",
                        "Cerasela Iosifescu",
                        "Doru Ana",
                        "Eugenia Bosânceanu",
                        "Ion Sapdaru",
                        "Cristina Burbuz",
                        "Marioara Sterian",
                        "Emil Coseru",
                        "Georgeta Paduraru Burdujan",
                        "Geo Dobre",
                        "Madalina Ghitescu",
                        "Catalina Harabagiu",
                        "Sanziana Tarta",
                        "Mihaela Alexandru",
                        "Hazim E'Layan",
                        "Monica Alexandrescu",
                        "Simona Stoicescu",
                        "Alexandru Conovaru",
                        "Ion Grosu",
                        "Traian Tudorica State",
                        "Cristian Ciuzan",
                        "Daniel Cristian Iancu",
                        "Robert Emanuel",
                        "Constantin Bojog",
                        "Cristina Iosif",
                        "Adina Cristescu",
                        "Calin Puia",
                        "Costica Babu"
                    ],
                    "genres": [
                        "Drama"
                    ],
                    "country": "Romania",
                    "languages": [
                        "Romanian"
                    ],
                    "runtime": 113,
                    "summary": [
                        "A woman assists her friend in arranging an illegal abortion in 1980s Romania.",
                        "Romania, 1987, the brutal Ceausescu communist regime is in place; birth control is illegal and abortion is a crime punishable by death. Gabita (Laura Vasliu) is almost five months into an unwanted pregnancy and in meek desperation turns to her friend and roommate, Otilia (Anamaria Marinca) for help in organizing an illegal termination. Unfortunate circumstances force the two women to use an unwanted male abortionist, Bebe (Vlad Ivanov). The bleakness of the storyline expresses a dark socio-political critique in the twilight years of a repressive dictatorship. —kwedgwood@hotmail.com",
                        "Romania 1987, the era of the repressive Communist regime. Gabita Dragut and Otilia Mihartescu are friends and college roommates, they living in the coed dorm. One day in their life is presented, this day when Gabita hopes to get an abortion, which is illegal in Romania. They have told no one beyond those that need to know, such as their friend Ramona, who recommended Mr. Bebe, a man they don't know and have yet to meet, to do the procedure. Otilia has not even told her bourgeois boyfriend, fellow student Adi Radu, despite Otilia borrowing money from him for the many expenses. Gabita has made most of the arrangements, such as talking to Mr. Bebe on the telephone, he who provided very strict instructions to her, and booking the hotel room at the Unireal where the procedure will be done, the reservation for three days just in case Gabita's recovery ends up being on the longer side, but Otilia, in Gabita's emotional descent, has to do much of the heavy lifting in preparation for the abortion today, such as checking into the hotel, ensuring the room is adequate and all the supplies needed are there (including some black market items, such as foreign cigarettes, just in case they need to bribe anyone), and picking up Mr. Bebe. The process is fraught with potential problems as they are required to show and surrender their ID to anyone in authority for the asking, even to the hotel receptionists in their coming and going. As the day progresses, Otilia and Gabita's friendship is tested as one problem arises after another, Otilia who has to decide how far she will go for her friend. And the goings-on of Otilia and Gabita's day will also make Otilia reflect on her relationship with Adi, from who she is receiving pressure to make an appearance at his mother's birthday dinner this evening, Adi's parents who she has yet to meet. —Huggo"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzU1YWUzNjYtNmVhZi00ODUyLTg4M2ItMTFlMmU1Mzc5OTE5XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "2996",
                "_score": 14.635834,
                "_source": {
                    "title": "The Reformer and the Redhead",
                    "rating": 6.2,
                    "year": 1950,
                    "directors": [
                        "Melvin Frank",
                        "Norman Panama"
                    ],
                    "writers": [
                        "Robert Carson",
                        "Melvin Frank",
                        "Norman Panama"
                    ],
                    "actors": [
                        "June Allyson",
                        "Dick Powell",
                        "David Wayne",
                        "Cecil Kellaway",
                        "Ray Collins",
                        "Robert Keith",
                        "Marvin Kaplan",
                        "Kathleen Freeman",
                        "Wally Maher",
                        "Alex Gerry",
                        "Charles Evans",
                        "Paul Maxey",
                        "Grace Albertson",
                        "Joel Allen",
                        "Frank Baker",
                        "Margaret Bert",
                        "Sven Hugo Borg",
                        "George Boyce",
                        "Paul Bradley",
                        "John Breen",
                        "Spring Byington",
                        "Bridget Carr",
                        "Spencer Chan",
                        "Michael Chapin",
                        "Peter Chong",
                        "Mae Clarke",
                        "James Conaty",
                        "Frances Dominguez",
                        "Ken DuMain",
                        "Helen Eby-Rock",
                        "Robert Espinoza",
                        "Nacho Galindo",
                        "Kenneth Garcia",
                        "Mickey Golden",
                        "A. Cameron Grant",
                        "John Hamilton",
                        "Lars Hensen",
                        "Gil Herman",
                        "Jane Howard",
                        "Marjorie Jackson",
                        "Tor Johnson",
                        "Marvin Jones",
                        "Kenner G. Kemp",
                        "Ralph Montgomery",
                        "Matt Moore",
                        "Jerry Paris",
                        "Edward Peil Sr.",
                        "Joe Ploski",
                        "Paul Regas",
                        "Danny Richards Jr.",
                        "Mario Siletti",
                        "Stuffy Singer",
                        "Cap Somers",
                        "Brick Sullivan",
                        "Frank Sully",
                        "Henry Sylvester",
                        "Arthur Tovey",
                        "Theodore von Eltz",
                        "Charles Wagenheim",
                        "Glen Walters",
                        "Kenny Washington",
                        "Gilbert Wilson",
                        "Wilson Wood"
                    ],
                    "genres": [
                        "Comedy",
                        "Romance"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": [
                        "Hot-tempered Kathleen Maguire enlists the services of a young attorney to help her zookeeper father get his job back after he is fired for political reasons. In the midst of uncovering local political corruption and dealing with a lion that's escaped from the zoo, the two manage to fall in love. —Daniel Bubbeo <dbubbeo@cmp.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNGU3MzM3OGEtYTc4OC00OTBiLTk1YTUtYWUyYzBjMTQwZWY0XkEyXkFqcGdeQXVyMTIxOTk5MzY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "8102",
                "_score": 14.568424,
                "_source": {
                    "title": "Por qué se asesina a un magistrado",
                    "rating": 6.6,
                    "year": 1975,
                    "directors": [
                        "Damiano Damiani"
                    ],
                    "writers": [
                        "Damiano Damiani",
                        "Fulvio Gicca Palli",
                        "Enrico Ribulsi"
                    ],
                    "actors": [
                        "Franco Nero",
                        "Françoise Fabian",
                        "Pierluigi Aprà",
                        "Giancarlo Badessi",
                        "Ennio Balbo",
                        "Luciano Catenacci",
                        "Giorgio Cerioni",
                        "Tano Cimarosa",
                        "Mico Cundari",
                        "Eva Czemerys",
                        "Enrico DiMarco",
                        "Claudio Gora",
                        "Marco Guglielmi",
                        "Salvatore Moscardini",
                        "Claudio Nicastro",
                        "Renzo Palmer",
                        "Elio Zamuto",
                        "Gianni Zavota",
                        "Giovanni Miceli",
                        "Michelangelo Di Benedetto",
                        "Sergio Valentini",
                        "Luigi Ursi",
                        "Elio Di Vincenzo",
                        "Sandro Arlotta",
                        "Andrea Busalacchi",
                        "Vincenzo Norvese",
                        "Vincenzo Patti",
                        "Maurizio Di Liberto",
                        "Giovanni Lo Cascio",
                        "Damiano Damiani"
                    ],
                    "genres": [
                        "Crime",
                        "Drama"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian"
                    ],
                    "runtime": 110,
                    "summary": [
                        "The latest success by film-maker Giacomo Solaris is a crime thriller about a judge who gets too friendly with the Mafia and is murdered. A resentful Sicilian magistrate orders the film seized, but then he winds up dead, in a fashion just like that in Solaris's movie. Solaris realizes that corrupt political forces are pulling strings, for his friends begin to die in grisly ways. Will he learn the truth about the murder of the judge in time? —Fiona Kelleghan <fkelleghan@aol.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZmY5MWJlMGItNTE0My00NWQ1LWE5MjctZGUxYjliZjMwZDhiXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "1143",
                "_score": 14.50248,
                "_source": {
                    "title": "El gran tipo",
                    "rating": 6.3,
                    "year": 1936,
                    "directors": [
                        "John G. Blystone"
                    ],
                    "writers": [
                        "James Edward Grant",
                        "Henry McCarty",
                        "Henry Johnson",
                        "Harry Ruskin"
                    ],
                    "actors": [
                        "James Cagney",
                        "Mae Clarke",
                        "James Burke",
                        "Edward Brophy",
                        "Henry Kolker",
                        "Bernadene Hayes",
                        "Edward McNamara",
                        "Robert Gleckler",
                        "Joe Sawyer",
                        "Edward Gargan",
                        "Matty Fain",
                        "Mary Gordon",
                        "Wallis Clark",
                        "Douglas Wood",
                        "Gertrude Astor",
                        "Bobby Barber",
                        "Sammy Blum",
                        "Lynton Brent",
                        "Jack Byron",
                        "Eddy Chandler",
                        "Hugh Chapman",
                        "Walter D. Clarke Jr.",
                        "Kernan Cripps",
                        "Patrick Cunning",
                        "John Dilson",
                        "Lester Dorr",
                        "Jim Farley",
                        "James Ford",
                        "Dwight Frye",
                        "Bud Geary",
                        "Gertrude Green",
                        "Carlton Griffin",
                        "Mildred Harris",
                        "Ben Hendricks Jr.",
                        "Al Herman",
                        "Arthur Hoyt",
                        "Bert Kalmar Jr.",
                        "Jane Keckley",
                        "Ethelreda Leopold",
                        "Robert Lowery",
                        "Murdock MacQuarrie",
                        "Wally Maher",
                        "Frank Mills",
                        "Bruce Mitchell",
                        "Edmund Mortimer",
                        "William H. O'Brien",
                        "Frank O'Connor",
                        "Dennis O'Keefe",
                        "Jack Pennick",
                        "Jack Perry",
                        "Kate Price",
                        "Henry Roquemore",
                        "Jeffrey Sayre",
                        "Dick Scott",
                        "Lee Shumway",
                        "Vera Steadman",
                        "Harry Tenbrook"
                    ],
                    "genres": [
                        "Crime",
                        "Drama",
                        "Film-Noir",
                        "Mystery"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 66,
                    "summary": [
                        "The adventures of an investigator (Cagney) for the Bureau of Weights and Measures.",
                        "It's the New York Department of Weights and Measures vs. a systematic effort to cheat the public by giving them less product than they pay for...organized by crooked city alderman Marty Cavanaugh, who put the last chief deputy inspector in the hospital. The new man, pugnacious Johnny Cave, steps on the toes of influential merchants and gets increasing pressure, both political and strong-arm, to desist. Will the luck (if not the pluck) of the Irish pull him through? —Rod Crawford <puffinus@u.washington.edu>",
                        "When Joel Green, head of the Department of Weights and Measures, is nearly killed in a car accident by corrupt politician Marty Cavanaugh, ex-prizefighter Johnny Cave replaces him. Facing a city-wide racket of faulty measures, Johnny fines merchants who are cheating the public and ignores the customary bribes and threats of Cavanaugh's men. The night after he refuses a job offer from Cavanaugh, Johnny is abducted. He wakes up, stinking of alcohol, in the gutter with his hair dyed red. In addition, Johnny is falsely accused of theft. Next, the mayor, in league with Cavanaugh, offers Johnny a high paying job, but he again refuses. When Johnny learns that Abel Canning, the boss of Johnny's fiancée, Janet Henry, has ordered that the matron of the local orphanage, Mrs. Ogilvie, be fired, Johnny visits her and learns that the orphanage has been receiving half-shipments of food. With evidence that Canning has been grafting state funds, Johnny has a newspaper headline printed that implicates Canning. Ex-wrestler Burton, posing as a city prosecutor, knocks Johnny out and steals his evidence in order to blackmail Canning. After Canning publicly accuses Johnny of blackmail, Janet breaks their engagement. That night, Canning pays Burton for the key to his apartment, and Canning and Cavanaugh locate the papers just as Johnny arrives. Thanks to Janet's call to the police, the two men are arrested before Canning can burn the evidence, and Johnny presents Janet her wedding ring. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTY5OWM0OGYtZThjNC00NTAyLTgzYWEtMjNjZGZlM2Y0ODA1XkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "32178",
                "_score": 14.300593,
                "_source": {
                    "title": "Marathon Boy",
                    "rating": 7.3,
                    "year": 2010,
                    "directors": [
                        "Gemma Atwal"
                    ],
                    "genres": [
                        "Documentary",
                        "Biography",
                        "Drama",
                        "Sport"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "Odia",
                        "English"
                    ],
                    "runtime": 98,
                    "summary": [
                        "Gemma Atwal's dynamic epic follows four-year-old Budhia, rescued from poverty by Biranchi Das, a larger-than-life judo coach and operator of an orphanage for slum children in the eastern Indian state of Orissa. When Budhia displays an uncommon talent for long-distance running, Biranchi nurtures his gift, heralding him as a folk hero for the impoverished masses, and maybe even for India itself. But after golden child Budhia breaks down during a world-record 65 kilometer run at the age of four, public opinion begins to turn on the guru and his disciple, and soon the two are swept up in a maelstrom of media controversy and political scandal. Following Budhia's roller-coaster journey over five years, Marathon Boy is a Dickensian tale of greed, corruption, and broken dreams set between the heart-racing world of marathon running, the poverty-stricken slums, and the political intrigue of a modernizing India. Nothing is what it seems in Budhia and Biranchi's story, and Atwal continually shifts viewer identification to tell both a shocking story of opportunism and exploitation, but also a touching portrait of an authentic bond between a parent and child. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjIwNDgwMTkxMV5BMl5BanBnXkFtZTcwMzA1NzMyNg@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "7137",
                "_score": 14.062007,
                "_source": {
                    "title": "En nombre del pueblo italiano",
                    "rating": 7.6,
                    "year": 1971,
                    "directors": [
                        "Dino Risi"
                    ],
                    "writers": [
                        "Agenore Incrocci",
                        "Agenore Incrocci",
                        "Furio Scarpelli",
                        "Furio Scarpelli"
                    ],
                    "actors": [
                        "Ugo Tognazzi",
                        "Vittorio Gassman",
                        "Ely Galleani",
                        "Yvonne Furneaux",
                        "Michele Cimarosa",
                        "Renato Baldini",
                        "Pietro Tordi",
                        "Maria Teresa Albani",
                        "Checco Durante",
                        "Simonetta Stefanelli",
                        "Edda Ferronao",
                        "Enrico Ragusa",
                        "Piero Nuti",
                        "Franco Angrisano",
                        "Gianfilippo Carcano",
                        "Claudio Trionfi",
                        "Francesco D'Adda",
                        "Vanni Castellani",
                        "Enrico Ameri",
                        "Marcello Di Falco",
                        "Paolo Paoloni",
                        "Franca Scagnetti",
                        "Rossella Bergamonti",
                        "Bruno Bertocci",
                        "Gillian Bray",
                        "Gianni Di Segni",
                        "Veriano Ginesi",
                        "Mario Ingrassia",
                        "Franco Magno",
                        "Giuseppe Marrocco",
                        "Ettore Mattia",
                        "Stefania Possamai",
                        "Alberto Postorino",
                        "Mario Silvestri",
                        "Antonio Spaccatini",
                        "Giò Stajano",
                        "Armando Tortorici"
                    ],
                    "genres": [
                        "Comedy",
                        "Crime",
                        "Mystery"
                    ],
                    "country": "Italy",
                    "languages": [
                        "Italian",
                        "English"
                    ],
                    "runtime": 103,
                    "summary": [
                        "A judge investigates the death of a young woman, possibly a murder. He suspects a famous industry tycoon with high political connections. But to what extent do the latter's lies and frauds influence the magistrate's opinion?",
                        "An obscure Italian magistrate suspects that a well-known industrialist commited murder, and decides to investigate him, and bring him to court, whatever it takes. But - will the magistrate have it in him to go against impossible odds, in the name of the Italian people he represents? —Artemis-9",
                        "An inflexible judge, politically inclined to the Left, Mariano Bonifazi (Ugo Tognazzi) investigates the cause of the death of a young woman, Silvana Lazzorini (Edy Galleani). The autopsy reveals that the cause of death is to be ascribed to an overdose of a drug which is only available on the German market. Moreover, Lazzorini's body shows bruises which could possibly infer she was beaten prior to her death. Investigating the woman's whereabouts, Bonifazi discovers the woman worked as a socialite and as an escort, often attending parties and being hired by an industry tycoon, Lorenzo Santonocito (Vittorio Gassman)to entertain his party and business guests. The judge knows well that Santonocito is a crook who has high political protection and who frauds the law in all possible ways and always ends up unpunished. Santonocito starts to feel afraid as he has got no alibi on the night of the murder and because he knows that Bonifazi is convinced of his responsibility. Nevertheless, he protests his innocence and tries to fabricate an alibi for that night, showing his ruthlessness and determination to achieve his purpose. He finally succeeds in fabricating an alibi with the help of a financially troubled friend but Bonifazi succeeds in demonstrating the fraud and issues an arrest warrant for Santonocito in order to bring him to trial. While Bonifazi is working on the warrants, the Police bring him Lazzorini's personal diary which brings in new elements. Now Bonifazi's conscience has the final word. —Cesare67"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYTIzMTMzNzItYjRlNy00YTIyLTk2ZGMtN2U2YjE0ODJkNDlkXkEyXkFqcGdeQXVyNjM3MTEwNTc@._V1_SY150_CR0,0,101,150_.jpg"
                }
            }
        ]
    }
}