{
    "took": 8,
    "timed_out": false,
    "_shards": {
        "total": 1,
        "successful": 1,
        "skipped": 0,
        "failed": 0
    },
    "hits": {
        "total": {
            "value": 641,
            "relation": "eq"
        },
        "max_score": 30.599104,
        "hits": [
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "28574",
                "_score": 30.599104,
                "_source": {
                    "title": "BloodRayne: El tercer Reich",
                    "rating": 3,
                    "year": 2011,
                    "directors": [
                        "Uwe Boll"
                    ],
                    "writers": [
                        "Michael Nachoff"
                    ],
                    "actors": [
                        "Natassia Malthe",
                        "Brendan Fletcher",
                        "Michael Paré",
                        "Willam Belli",
                        "Annett Culp",
                        "Clint Howard",
                        "Steffen Mennekes",
                        "Arved Birnbaum",
                        "Safiya Kaygin",
                        "Nik Goldman",
                        "Vili Matula",
                        "Boris Bakal",
                        "Davorka Tovilo",
                        "Dora Lipovcan",
                        "Katarina Brozincevic",
                        "Luka Peros",
                        "Goran Manic",
                        "Boris Balta",
                        "Dino More",
                        "Frank Raffel",
                        "Marco Dovsek",
                        "Branka Prislic",
                        "Slavika Kosca-Vrlazi",
                        "Petar Bencic",
                        "Sven Jakir",
                        "Dusan Bucan",
                        "Damir Poljicak",
                        "Mark Boldin",
                        "Miran Kurspahic",
                        "Slaven Spanovic",
                        "Michael Reed",
                        "Hrvoje Dokoza",
                        "Karlo Pervan",
                        "Dalibor Brkic",
                        "Natalie Burn",
                        "Fabrice Colson",
                        "Adolf Hitler",
                        "Vjekoslav Katusin"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Fantasy",
                        "Horror"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 79,
                    "summary": [
                        "Rayne joins a resistence group to fight against the Nazis during world war two.",
                        "Rayne fights against the Nazis in Europe during World War II, encountering Ekart Brand, a Nazi leader whose target is to inject Adolf Hitler with Rayne's blood in an attempt to transform him into a dhampir and attain immortality. —Michael Lauzon",
                        "In the World War II, the Damphir Rayne fights against Nazis and joins the group of resistance led by Nathaniel Gregor. When they attack a train expecting to find weapons, they find people that are going to a concentration camp. Rayne is shot by a soldier and her blood drops on the face of Commandant Ekart Brand. She kills him but he turns into a powerful vampire. Now Rayne needs to fix the problem, otherwise Hitler may achieve her power with the research of Doctor Mangler. —Claudio Carvalho, Rio de Janeiro, Brazil"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTM1OTEyODk4N15BMl5BanBnXkFtZTcwMDczODgzNQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "14474",
                "_score": 27.877617,
                "_source": {
                    "title": "Patria",
                    "rating": 6.4,
                    "year": 1994,
                    "directors": [
                        "Christopher Menaul"
                    ],
                    "writers": [
                        "Robert Harris",
                        "Stanley Weiser",
                        "Ron Hutchinson"
                    ],
                    "actors": [
                        "Rutger Hauer",
                        "Miranda Richardson",
                        "Peter Vaughan",
                        "Michael Kitchen",
                        "Jean Marsh",
                        "John Woodvine",
                        "John Shrapnel",
                        "Clive Russell",
                        "Clare Higgins",
                        "Pavel Andel",
                        "Petronella Barker",
                        "Sarah Berger",
                        "Jan Bidlas",
                        "Stuart Bunce",
                        "Charles De'Ath",
                        "Neil Dudgeon",
                        "Rudolph Fleischer",
                        "Garrick Hagon",
                        "David Hatton",
                        "Rupert Penry-Jones",
                        "Jan Kohout",
                        "Rory Jennings",
                        "Bob Mason",
                        "David McAlister",
                        "Petr Meissel",
                        "Patrick Opaterny",
                        "David Ryall",
                        "Zdenka Sajfertová",
                        "Michael Shannon",
                        "Milan Simácek",
                        "Marek Vasut",
                        "Jan Vlasák",
                        "Rupert Degas",
                        "Ivo Novák"
                    ],
                    "genres": [
                        "Drama",
                        "Romance",
                        "Sci-Fi",
                        "Thriller",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 106,
                    "summary": [
                        "In April 1964, more than twenty years after the Nazis won World War II, S.S. officer Xavier March uncovers a plot to eliminate the attendees of the Wannsee Conference so that Germany can establish better relations with the U.S.",
                        "In a world where the Nazis won World War II, Germany has corralled all European countries into a single state called "Germania", and continues fighting against the Soviet Union. It is now 1964 and Germany's war crimes against the Jews have so far been kept a secret. Germany believes that an alliance with the United States would finally beat the Soviet war machine. As his 75th birthday approaches, Adolf Hitler (Rudolph Fleischer) wants to talk peace with President Joseph Kennedy (Jan Kohout). An S.S. homicide detective and an American journalist stumble into a plot to destroy all evidence of the genocide; evidence that could destroy the peace process with America and evidence that Nazi and S.S. leaders will stop at nothing to keep hidden. —Rob Hartill",
                        "Alternate reality where Nazi Germany won World War II after repulsing the Allied invasion at Normandy. Now in 1964, Germany continues fighting a bitter guerilla war with the Soviet Union and desperately needs an alliance with the United States in order to finally beat Stalin's war machine. However, when S.S. homicide detective Xavier March (Rutger Hauer) begins investigating the mysterious death of a retired Nazi Party official, a cover-up is revealed involving the Jewish Holocaust of World War II. With the assistance of an American journalist, March probes deeper and discovers the full truth about what happened to the Jews; a truth that could destroy the peace process with America and a truth that Nazi and S.S. leaders will stop at nothing to keep hidden. —Anthony Hughes <husnock31@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTc2NGY3MTUtN2NkNC00ZWU5LWI1MjQtMTdjYTRkZGNiMzFlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "16259",
                "_score": 27.860744,
                "_source": {
                    "title": "The Long Way Home",
                    "rating": 7.6,
                    "year": 1997,
                    "directors": [
                        "Mark Jonathan Harris"
                    ],
                    "writers": [
                        "Mark Jonathan Harris"
                    ],
                    "actors": [
                        "Morgan Freeman",
                        "Israel Lau",
                        "Livia Shacter",
                        "Abraham Klausner",
                        "Winston Churchill",
                        "Ernest Bevin",
                        "Harry S. Truman",
                        "Clement Attlee",
                        "Dwight D. Eisenhower",
                        "George S. Patton",
                        "Herbert Friedman",
                        "Hermann Göring",
                        "Ruth Gruber",
                        "Harold Katz",
                        "James Byrnes",
                        "Yael Danieli",
                        "Abba Eban",
                        "Andrei Gromyko",
                        "Clark Clifford",
                        "Edward Asner",
                        "Sean Astin",
                        "Martin Landau",
                        "Miriam Margolyes",
                        "David Paymer",
                        "Nina Siemaszko",
                        "Helen Slater",
                        "Michael York",
                        "Rick Bandes",
                        "Christo Brock",
                        "Pablo Bryant",
                        "Aaron Cain",
                        "Robert Cait",
                        "Kat Cressida",
                        "Curt Lowens",
                        "Marc Lynn",
                        "Akiva Potok",
                        "Rich Amend",
                        "Menachem Begin",
                        "David Ben-Gurion",
                        "Alexander Cadogan",
                        "Walter Cronkite",
                        "Hans Frank",
                        "Wilhelm Frick",
                        "Ernst Kaltenbrunner",
                        "Wilhelm Keitel",
                        "Golda Meir",
                        "Alfred Rosenberg",
                        "Arthur Seyß-Inquart",
                        "Franz von Papen",
                        "Baldur von Schirach",
                        "Chaim Weizmann"
                    ],
                    "genres": [
                        "Documentary",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 120,
                    "summary": [
                        "The story of the post World War II Jewish refugee situation from liberation to the establishment of the modern state of Israel.",
                        "After WWII, Jewish Holocaust survivors are moved into Displaced Persons' camps. After delays, more physical hardship, and years of uncertainty, they are permitted to begin new lives in Israel and the U.S. —Eileen Berdon <eberdon@aol.com>",
                        "At the end of World War II, Holocaust survivors are freed from Nazi internment camps. For many of them, the joy quickly turns to despair, as most have no families and nowhere to go. Because of quotas imposed by the British, thousands are unable to legally immigrate to Palestine. Many are put into displaced persons camps to await relocation. Meanwhile, the world powers work toward the creation of Israel as a homeland for all Jews. Morgan Freeman narrates this moving documentary. —Jwelch5742",
                        "This documentary reports events for European Jews from the fall of the Third Reich in 1945 to the formation of the state of Israel in 1948, arguing that creating the Israeli state was necessary given the nature of post-war Europe for these survivors. We see death in concentration camps after liberation, from disease or even from eating too much. We learn of pogroms murdering those who return home. We see the squalor of displaced persons camps. Facing strict British immigration limits into Palestine, many sought passage illegally, often ending up in locked camps in Cyprus. Against this backdrop, Jews in Palestine, Truman in the White House, and UN delegates debate Israel's formation. —<jhailey@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYjkzNGJhYWMtMmUxMi00OTE0LTg0N2MtOTM5YTNmNWY1YmQyXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "34762",
                "_score": 27.474266,
                "_source": {
                    "title": "A Hand of Peace: Pope Pius XII and the Holocaust",
                    "rating": 7.4,
                    "year": 2008,
                    "directors": [
                        "David Naglieri"
                    ],
                    "writers": [
                        "David Naglieri"
                    ],
                    "actors": [
                        "Pope Pius XII"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English",
                        "French"
                    ],
                    "runtime": 55,
                    "summary": [
                        ""A Hand of Peace: Pope Pius XII and the Holocaust" offers valuable insights and contribution to the robust debate surrounding Pope Pius' wartime record. Featuring interviews with renowned Holocaust historian Sir Martin Gilbert; the Jesuit historian and postulator Fr. Peter Gumpel; author and ardent Pius defender Sr. Margherita Marchione, M.P.F., Ph.D., this gripping documentary explores the difficult choices Pius XII faced during the Second World War, and provides convincing proof that his bold, yet discreet, prophetic actions saved tens of thousands of Jewish lives and paved the way for a new era of Catholic-Jewish relations that have deepened over the past 50 years. —Salt and Light Television Productions [ca]",
                        "Pope Pius XII guided the Catholic Church through two tumultuous decades, firmly establishing himself as a champion of peace, and the moral voice of a world torn apart by war. However, shortly after his death in 1958, his heroic legacy has been called into question by some historians who claim that his alleged "silence" during the Nazi holocaust allowed Hitler to carry out his Final Solution against the Jews. Pope Pius XII protested vehemently the persecution of Jews. His was a prophecy in action, which saved the lives of countless victims of the neo-pagan Nazi reign of terror, rather than potentially counter-productive public statements. "A Hand of Peace: Pope Pius XII and the Holocaust" is an important contribution to the robust and timely debate that has arisen surrounding Pius's wartime record. Featuring interviews with world renowned Holocaust historian Sir Martin Gilbert; the Jesuit historian and postulator Fr. Peter Gumpel; author and ardent Pius defender Sr. Margherita Marchione, M.P.F., Ph.D., this gripping documentary explores the difficult choices Pius XII faced during the Second World War, and provides convincing proof that his bold, yet discreet, prophetic actions saved tens of thousands of Jewish lives and paved the way for a new era of Catholic-Jewish relations that have deepened over the past 50 years. —Salt and Light Catholic Media Foundation"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYmIwYWNjN2YtNTIwNC00NWFmLWJkOTgtNmYzYWNhMGQwNGQwXkEyXkFqcGdeQXVyNDgwMzI5MjU@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "39038",
                "_score": 27.147993,
                "_source": {
                    "title": "Operación Anthropoid",
                    "rating": 7.2,
                    "year": 2016,
                    "directors": [
                        "Sean Ellis"
                    ],
                    "writers": [
                        "Sean Ellis",
                        "Anthony Frewin"
                    ],
                    "actors": [
                        "Jamie Dornan",
                        "Cillian Murphy",
                        "Brian Caspe",
                        "Karel Hermánek Jr.",
                        "Sára Arnsteinová",
                        "Hana Frejková",
                        "Sean Mahon",
                        "Jan Hájek",
                        "Marcin Dorocinski",
                        "Toby Jones",
                        "Alena Mihulová",
                        "Bill Milner",
                        "Charlotte Le Bon",
                        "Pavel Reznícek",
                        "Anna Geislerová",
                        "Vaclav Marek and his Blue Star",
                        "Justin Svoboda",
                        "Harry Lloyd",
                        "Václav Neuzil",
                        "Jirí Simek",
                        "Jan Jankovský",
                        "Jaroslav Psenicka",
                        "Detlef Bothe",
                        "John Martin",
                        "Frantisek Stupka",
                        "Martin Hofmann",
                        "David Bredin",
                        "Igor Bares",
                        "Roman Zach",
                        "Andrej Polák",
                        "Mish Boyko",
                        "Sam Keeley",
                        "Alexander von der Groeben",
                        "Marek Motlicek",
                        "Petr Kotík",
                        "Patrick Kalupa",
                        "Jan Budar",
                        "Marek Pospíchal",
                        "Ondrej Malý",
                        "Nicolai Borger",
                        "Miroslav Lhotka",
                        "Neville Chamberlain",
                        "Reinhard Heydrich",
                        "Heinrich Himmler",
                        "Adolf Hitler",
                        "Benito Mussolini",
                        "Zdenek Spitálník"
                    ],
                    "genres": [
                        "Action",
                        "Biography",
                        "Drama",
                        "History",
                        "Romance",
                        "Thriller",
                        "War"
                    ],
                    "country": "Czechia",
                    "languages": [
                        "English",
                        "Czech",
                        "German"
                    ],
                    "runtime": 120,
                    "summary": [
                        "Based on the extraordinary true story of Operation Anthropoid, the WWII mission to assassinate SS General Reinhard Heydrich, the main architect behind the Final Solution and the Reich's third in command after Hitler and Himmler.",
                        "ANTHROPOID is based on the extraordinary true story of Operation Anthropoid, the World War II mission to assassinate SS General Reinhard Heydrich. The Reich's third in command after Hitler and Himmler, Heydrich was the main architect behind the Final Solution and the leader of occupying Nazi forces in Czechoslovakia whose reign of terror prompted self-exiled Czech and Slovak soldiers (played by Cillian Murphy and Jamie Dornan) to hatch a top-secret mission that would change the face of Europe forever.i —Bleecker Street",
                        "1942. German-occupied Czechoslovakia is ruled by the brutal SS General Reinhard Heydrich, the third highest member of the Nazi government. Two Czech exiles are parachuted into Czechoslovakia as part of an operation known as Anthropoid. Their mission: assassinate Heydrich. —grantss"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNzE0NjY1Nl5BMl5BanBnXkFtZTgwNjYzOTkxOTE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20397",
                "_score": 26.65984,
                "_source": {
                    "title": "Amén.",
                    "rating": 7.2,
                    "year": 2002,
                    "directors": [
                        "Costa-Gavras"
                    ],
                    "writers": [
                        "Costa-Gavras",
                        "Jean-Claude Grumberg",
                        "Rolf Hochhuth"
                    ],
                    "actors": [
                        "Mathieu Kassovitz",
                        "Ulrich Tukur",
                        "Ulrich Mühe",
                        "Michel Duchaussoy",
                        "Ion Caramitru",
                        "Marcel Iures",
                        "Friedrich von Thun",
                        "Antje Schmidt",
                        "Hanns Zischler",
                        "Sebastian Koch",
                        "Erich Hallhuber",
                        "Burkhard Heyl",
                        "Angus MacInnes",
                        "Bernd Fischerauer",
                        "Pierre Franckh",
                        "Richard Durden",
                        "Monica Bleibtreu",
                        "Justus von Dohnányi",
                        "Günther Maria Halmer",
                        "August Zirner",
                        "Horatiu Malaele",
                        "Ovidiu Cuncea",
                        "Markus Hering",
                        "Susanne Lothar",
                        "Alex Geringas",
                        "Theodor Danetti",
                        "Radu Bânzaru",
                        "Constantin Alexandrov",
                        "Heinz Gerhard Lück",
                        "Marina Berti",
                        "Michael Mendl",
                        "Niels Hansen",
                        "Matthias Koeberlin",
                        "Nina Proll",
                        "Marin Moraru",
                        "Hinnerk Schönemann",
                        "Ion Haiduc",
                        "Maria Rotaru",
                        "Dorina Chiriac",
                        "Cornelia Pavlovici",
                        "Cornel Ciupercescu",
                        "Robinson Reichel",
                        "Lilly Tukur",
                        "Charles Brian",
                        "Sophie Parea",
                        "Laurentiu Cizmas",
                        "George Ivascu",
                        "Ion Pavlescu",
                        "Constantin Cotimanis",
                        "Valentin Teodosiu",
                        "Rodica Lazar",
                        "Stefania Zamfirescu",
                        "Doru Badiu",
                        "Andreea Macelaru",
                        "Rudy Rosenfeld",
                        "Costin Anghel",
                        "Alexandru Repan",
                        "Ion Siminie",
                        "Sandu Mihai Gruia",
                        "Florin Kevorkian",
                        "Valeriu Crisan",
                        "Cristian Ieremia",
                        "Natasa Raab",
                        "Andriana Andronache",
                        "Andrei Finti",
                        "Andrei Boncea",
                        "Zoltan Butuc",
                        "Laurentiu Bobalca",
                        "Nicolae Calugarita",
                        "Karina Bobe",
                        "Christine Georgescu",
                        "Cici Caraman",
                        "Lucia Maier",
                        "Andrei Duban",
                        "Andrei Gheorghe",
                        "Bogdan Uritescu",
                        "Fred Wesson",
                        "Cornel Vulpe",
                        "Petre Moraru",
                        "Mihai Niculescu",
                        "Mircea Stoian",
                        "Geo Dobre",
                        "Viorel Comanici",
                        "Mihai Calin",
                        "Marius Galea",
                        "Gabriel Spahiu",
                        "Nicodim Ungureanu",
                        "Stefan Potzolli",
                        "Emil Hostina",
                        "Bogdan Florea",
                        "Alex Jitea",
                        "Marian Râlea",
                        "Florin Busuioc",
                        "Florin Dobrovici",
                        "Eugen Cristian Motriuc",
                        "Alin Panc",
                        "Pavel Bartos",
                        "Dorina Lazar",
                        "Anca Sigartau",
                        "Oana Ioachim",
                        "Tamara Popescu",
                        "Nicolae Borza",
                        "Adrian Plopeanu",
                        "Daniel Iordan",
                        "Dan Astileanu",
                        "Mihai Razus",
                        "Doru Stan",
                        "Ioana Picos",
                        "Rodrig Andrisan",
                        "Diana Angelson",
                        "Sergiu Cepleanu"
                    ],
                    "genres": [
                        "Biography",
                        "Crime",
                        "Drama",
                        "War"
                    ],
                    "country": "France",
                    "languages": [
                        "English",
                        "French",
                        "Italian",
                        "German"
                    ],
                    "runtime": 132,
                    "summary": [
                        "During WWII SS officer Kurt Gerstein tries to inform Pope Pius XII about Jews being sent to extermination camps. Young Jesuit priest Riccardo Fontana helps him in the difficult mission to inform the world.",
                        "In World War II, the sanitation engineer and family man Kurt Gerstein is assigned by SS to be the Head of the Institute for Hygiene to purify the water for the German Army in the front. Later, he is invited to participate in termination of plagues in the concentration camps and he develops the lethal gas Zyklon-B. When he witnesses that the SS is killing Jews instead, he decides to denounce the genocide to the Pope to expose to the world and save the Jewish families. The idealist Jesuit priest Riccardo Fontana from an influent Italian family gives his best efforts being the liaison of Gerstein and the leaders of the Vatican. —Claudio Carvalho, Rio de Janeiro, Brazil",
                        "Two systems: the Nazi machine versus the Vatican and Allied diplomacy. Two men struggling from the inside. On one side, Kurt Gerstein, a real-life chemist and SS officer, supplied the death camps with Zyklon B while he tirelessly denounced the crimes and alerted the Allies, the Pope, the Germans and their churches at his family's and his own risk. On the other, Ricardo Fontana, a young Jesuit, a fictitious character who represents all the priests who had the heart to struggle against savagery, often paying for their courage with their lives. Countless priests, some known, others anonymous, who simply were not content to live with the silence of their church's hierarchy. —Sujit R. Varma",
                        "Kurt Gerstein, a brilliant German scientist, is recruited into the SS during the opening years of the Second World War. Assigned as a sanitation engineer, Gerstein is sent to the Eastern Front to supervise water purification for the German Army. Soon after, however, he is asked to help with a "special project" involving fumigation of "vermin infested" areas behind the front lines. Gerstein develops Zyklon-B, a deadly chemical gas which Gerstein believes will be put to use killing rats, lice, and other disease carrying creatures. However, when Gerstein realizes that his invention will be used to kill not animals but people, he begins an emotional search of his Christian values and ultimately decides to betray the SS by attempting to expose the Holocaust by way of informing the Catholic Church. —Anthony Hughes {husnock31@hotmail.com}"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTcyMzQ1NzktMDhlZi00YzEwLWEyNGMtMDQ2MWNjZDg3ZjdlXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "21187",
                "_score": 25.595495,
                "_source": {
                    "title": "Im toten Winkel - Hitlers Sekretärin",
                    "rating": 7.3,
                    "year": 2002,
                    "directors": [
                        "André Heller",
                        "Othmar Schmiderer"
                    ],
                    "writers": [
                        "André Heller",
                        "Othmar Schmiderer"
                    ],
                    "actors": [
                        "Traudl Junge"
                    ],
                    "genres": [
                        "Documentary",
                        "Biography",
                        "War"
                    ],
                    "country": "Austria",
                    "languages": [
                        "German"
                    ],
                    "runtime": 90,
                    "summary": [
                        "Documentary featuring interview footage with Traudl Junge, one of Hitler's personal secretaries during WWII.",
                        "Traudl Junge was Adolf Hitler's private secretary, from Autumn 1942 until the collapse of the Nazi regime. She worked for him at the Wolfsschanze in Obersalzberg, on his private train and, finally, in his bunker in the besieged capital. It was Traudl Junge to whom Hitler dictated his final testament. In her first ever on-camera interview, 81-year-old Junge talks about her unique life. In the spring of 2001, Andre Heller succeeded in convincing Traudl Junge how valuable it is to record her unique memories. Fifty-six years after the end of the Second World War, an important eyewitness reveals her experiences to us. What she saw and heard turned her into an furious opponent of National Socialism; an opponent, moreover, who is still painfully aware and seems incapable of forgiving the young girl she once was--for her naivete, ignorance, and her liking for Hitler. —Sujit R. Varma"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNjQwODk0MTIyMF5BMl5BanBnXkFtZTcwMzk0MzQyMQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "15338",
                "_score": 24.475214,
                "_source": {
                    "title": "Escuadrón de combate 332",
                    "rating": 7.1,
                    "year": 1995,
                    "directors": [
                        "Robert Markowitz"
                    ],
                    "writers": [
                        "Paris Qualles",
                        "Trey Ellis",
                        "Ron Hutchinson",
                        "R. Wayland Williams",
                        "T.S. Cook"
                    ],
                    "actors": [
                        "Laurence Fishburne",
                        "Allen Payne",
                        "Malcolm-Jamal Warner",
                        "Courtney B. Vance",
                        "Andre Braugher",
                        "Christopher McDonald",
                        "Daniel Hugh Kelly",
                        "John Lithgow",
                        "Cuba Gooding Jr.",
                        "Mekhi Phifer",
                        "Christopher Bevins",
                        "Eddie Braun",
                        "Max Daniels",
                        "Jack Dwyer",
                        "James Field",
                        "Vivica A. Fox",
                        "Bennet Guillory",
                        "David Harrod",
                        "Brett A. Jones",
                        "Johnny Judkins",
                        "Tim Kelleher",
                        "Doug Kruse",
                        "Ed Lauter",
                        "Barry Lehman",
                        "Janet MacLachlan",
                        "Allen McCormick",
                        "Willie Minor",
                        "Perry Moore",
                        "Rosemary Murphy",
                        "Marco Perella",
                        "David Pickens",
                        "William Earl Ray",
                        "Rick Snyder",
                        "Allen R. Stokes",
                        "Ned Vaughn",
                        "Graham Jarvis",
                        "John Lizzi"
                    ],
                    "genres": [
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 106,
                    "summary": [
                        "The true story of how a group of African American pilots overcame racist opposition to become one of the finest US fighter groups in World War II",
                        "During the Second World War, a special project is begun by the US Army Air Corps to integrate African American pilots into the Fighter Pilot Program. Known as the "Tuskegee Airman" for the name of the airbase at which they were trained, these men were forced to constantly endure harassement, prejudice, and much behind the scenes politics until at last they were able to prove themselves in combat. —Anthony Hughes <husnock31@hotmail.com>",
                        "Historical drama about the first Africa-American pilots in the US military. In 1942, a group of college graduates are selected for training as pilots in Army Air Corps at the Tuskegee training base. In what is billed by everyone as an "experiment", the men face not only the institutionalized prejudice of their white officers but that generally found in the US South at the time. There are clearly those who would like to see this fail, including the Major in charge of training and a US Senator. Even when they distinguish themselves in North Africa, there is an attempt to disband them. In the end, they served their country with distinction and bravery, flying missions in Europe include providing bomber escort for the bombing of Berlin. Based on a true story. —garykmcd",
                        "A semi-fictionalized account of the Tuskegee Airmen, the first all-African-American Air Force squadron during World War II, the film centers on ambitious young pilot Hannibal Lee. Despite initial reticence by higher ranking white officers, Lee, along with Walter Peoples, Leroy Cappy, and others, are deployed into combat. As the successful missions mount, the Tuskegee Airmen develop a reputation as an able, fearsome group of pilots. —Jwelch5742",
                        "In WWII, the Tuskegee army airfield was where the first 'colored' army fighter pilots were trained. This dramatization of real events follows one man, Hannibal Lee, through training to impossibly high standards, Congressional maneuvering, months of no air-combat action, and finally acceptance and decoration as one of the 332nd Fighter Group, who never lost a bomber to enemy action. —Kathy Li"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMDYyYTdhZjktZmZjZi00YzU2LWExZDktZDQ4ZTdmNjUzZWUxL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "17644",
                "_score": 24.005589,
                "_source": {
                    "title": "Enigma",
                    "rating": 6.4,
                    "year": 2001,
                    "directors": [
                        "Michael Apted"
                    ],
                    "writers": [
                        "Robert Harris",
                        "Tom Stoppard"
                    ],
                    "actors": [
                        "Dougray Scott",
                        "Kate Winslet",
                        "Saffron Burrows",
                        "Jeremy Northam",
                        "Nikolaj Coster-Waldau",
                        "Tom Hollander",
                        "Donald Sumpter",
                        "Matthew Macfadyen",
                        "Richard Leaf",
                        "Ian Felce",
                        "Bo Poraj",
                        "Paul Rattray",
                        "Richard Katz",
                        "Tom Fisher",
                        "Robert Pugh",
                        "Corin Redgrave",
                        "Nicholas Rowe",
                        "Angus MacInnes",
                        "Mary MacLeod",
                        "Michael Troughton",
                        "Edward Hardwicke",
                        "Anne-Marie Duff",
                        "Tim Bentinck",
                        "Rosie Thomson",
                        "Emma Buckley",
                        "Mirjam de Rooij",
                        "Adrian Preater",
                        "Edward Woodall",
                        "Hywel Simons",
                        "Emma Davies",
                        "Martin Glyn Murray",
                        "Wilhelm Brückner",
                        "Gary Bunn",
                        "Wayne Docksey",
                        "Tracy Gardener",
                        "Joseph Goebbels",
                        "Adolf Hitler",
                        "Mick Jagger",
                        "Mark Kleuskens",
                        "Viktor Lutze",
                        "Lee Montague",
                        "Tim Pruce",
                        "Julius Schaub",
                        "Jane Staiano",
                        "Werner von Blomberg",
                        "Werner von Fritsch",
                        "Bevan Walsh",
                        "Paul Woodadge"
                    ],
                    "genres": [
                        "Drama",
                        "Mystery",
                        "Romance",
                        "Thriller",
                        "War"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 119,
                    "summary": [
                        "A young genius frantically races against time to crack an enemy code and solve the mystery surrounding the woman he loves.",
                        "During the heart of World War II, in March of 1943, cryptoanalysts at Britain's code-breaking center have discovered to their horror that Nazi U-boats have changed their Enigma Code. Authorities enlist the help of a brilliant young man named Tom Jericho to help them break the code again. The possibility of a spy within the British code-breakers' ranks looms and Tom's love, Claire, has disappeared. To solve the mysteries, Tom recruits Claire's best friend, Hester Wallace. In investigating Claire's personal life, the pair discovers personal and international betrayals. —Anna <dimenxia@yahoo.com>",
                        "During the Second World War, a team of genius is put together near to London to study means of breaking the German code used in the communication. Tom Jericho broke this code in the past and had a break-down. Now his passion Claire Romilly is missing and the British counter-espionage system believes she is a German spy. Tom becomes closer the Claire's best girl-friend Hester Wallace and together they try to resolve the mystery of the disappearance of Claire in an war environment surrounded by suspicion and stress. —Claudio Carvalho, Rio de Janeiro, Brazil",
                        "During World War Two, the British authorities discover that Nazi U-boats have unexpectedly changed the code of their Enigma machines - thus endangering the lives of thousands of Allied sailors. They enlist the help of Tom Jericho (Scott), a brilliant young code breaker. But Tom also needs to solve the mystery surrounding the woman (Winslet) he loves, who is suspected of being a spy."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNTI5ODU3N2UtM2QzNS00NjM1LWExNzMtNjgzYWQ5MWNkYTJmXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "25272",
                "_score": 22.828138,
                "_source": {
                    "title": "El hombre sin edad",
                    "rating": 6.1,
                    "year": 2007,
                    "directors": [
                        "Francis Ford Coppola"
                    ],
                    "writers": [
                        "Mircea Eliade",
                        "Francis Ford Coppola"
                    ],
                    "actors": [
                        "Tim Roth",
                        "Alexandra Maria Lara",
                        "Bruno Ganz",
                        "André Hennicke",
                        "Marcel Iures",
                        "Alexandra Pirici",
                        "Adrian Pintea",
                        "Florin Piersic Jr.",
                        "Mircea Albulescu",
                        "Dan Astileanu",
                        "Cristian Balint",
                        "Dragos Bucur",
                        "Zoltan Butuc",
                        "Theodor Danetti",
                        "Andrei Gheorghe",
                        "Roxana Guttman",
                        "Lucian Iancu",
                        "Dorina Lazar",
                        "Rodica Lazar",
                        "Anamaria Marinca",
                        "Hodorog Anton Mihail",
                        "Mihai Niculescu",
                        "Gelu Nitu",
                        "Mirela Oprisor",
                        "Alexandru Repan",
                        "Rudy Rosenfeld",
                        "Dan Sandulescu",
                        "Adriana Titieni",
                        "Ana Ularu",
                        "Andi Vasluianu",
                        "Matt Damon"
                    ],
                    "genres": [
                        "Drama",
                        "Fantasy",
                        "Mystery",
                        "Romance",
                        "Sci-Fi"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Sanskrit",
                        "German",
                        "French",
                        "Italian",
                        "Russian",
                        "Romanian",
                        "Mandarin",
                        "Latin",
                        "Armenian"
                    ],
                    "runtime": 124,
                    "summary": [
                        "A love story wrapped in a mystery. Set in World War II Europe, a professor is changed by a cataclysmic event and explores the mysteries of life.",
                        "Christmas Eve, 1937, Piatra Neamt, Romania: Dominic Matei, a 70-year-old professor, contemplates suicide. The love of his life is dead, and he remains unable to complete his life's work on the origins of language. On April 24th 1938, Easter Sunday, he takes a train to Bucharest to kill himself, but suddenly he's struck by lightning. After a slow recovery, he miraculously grows younger and gains superhuman powers. WWII breaks out and Romania's fascist dictator Ion Antonescu cooperates with Adolf Hitler. Matei must escape to Switzerland, because Nazi scientists want to use his powers...Some years later, he meets a woman who has her own passage through a lightning storm. Not only does Dominic find love again, but her new abilities hold the key to his research...Coppola's adaptation of Mircea Eliade's surreal novella is a mysterious, romantic, melancholic and humorous journey to the outer limits of space, time and identity. Dreams become reality and reality feels like a dream... —<jhailey@hotmail.com>",
                        "Professor of linguistics Dominic Matei survives a cataclysmic event and finds his youth restored. However, his intellect attracts the attention of Nazi scientists, forcing him into exile. While on the run, he reunites with his lost love and works to complete his research on the origins of language. —yusufpiskin"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGU0Yjg5NWQtMmVjMy00YTk3LWJlMGMtNGJlMDAyYjMyODViXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "25273",
                "_score": 22.828138,
                "_source": {
                    "title": "El hombre sin edad",
                    "rating": 6.1,
                    "year": 2007,
                    "directors": [
                        "Francis Ford Coppola"
                    ],
                    "writers": [
                        "Mircea Eliade",
                        "Francis Ford Coppola"
                    ],
                    "actors": [
                        "Tim Roth",
                        "Alexandra Maria Lara",
                        "Bruno Ganz",
                        "André Hennicke",
                        "Marcel Iures",
                        "Alexandra Pirici",
                        "Adrian Pintea",
                        "Florin Piersic Jr.",
                        "Mircea Albulescu",
                        "Dan Astileanu",
                        "Cristian Balint",
                        "Dragos Bucur",
                        "Zoltan Butuc",
                        "Theodor Danetti",
                        "Andrei Gheorghe",
                        "Roxana Guttman",
                        "Lucian Iancu",
                        "Dorina Lazar",
                        "Rodica Lazar",
                        "Anamaria Marinca",
                        "Hodorog Anton Mihail",
                        "Mihai Niculescu",
                        "Gelu Nitu",
                        "Mirela Oprisor",
                        "Alexandru Repan",
                        "Rudy Rosenfeld",
                        "Dan Sandulescu",
                        "Adriana Titieni",
                        "Ana Ularu",
                        "Andi Vasluianu",
                        "Matt Damon"
                    ],
                    "genres": [
                        "Drama",
                        "Fantasy",
                        "Mystery",
                        "Romance",
                        "Sci-Fi"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Sanskrit",
                        "German",
                        "French",
                        "Italian",
                        "Russian",
                        "Romanian",
                        "Mandarin",
                        "Latin",
                        "Armenian"
                    ],
                    "runtime": 124,
                    "summary": [
                        "A love story wrapped in a mystery. Set in World War II Europe, a professor is changed by a cataclysmic event and explores the mysteries of life.",
                        "Christmas Eve, 1937, Piatra Neamt, Romania: Dominic Matei, a 70-year-old professor, contemplates suicide. The love of his life is dead, and he remains unable to complete his life's work on the origins of language. On April 24th 1938, Easter Sunday, he takes a train to Bucharest to kill himself, but suddenly he's struck by lightning. After a slow recovery, he miraculously grows younger and gains superhuman powers. WWII breaks out and Romania's fascist dictator Ion Antonescu cooperates with Adolf Hitler. Matei must escape to Switzerland, because Nazi scientists want to use his powers...Some years later, he meets a woman who has her own passage through a lightning storm. Not only does Dominic find love again, but her new abilities hold the key to his research...Coppola's adaptation of Mircea Eliade's surreal novella is a mysterious, romantic, melancholic and humorous journey to the outer limits of space, time and identity. Dreams become reality and reality feels like a dream... —<jhailey@hotmail.com>",
                        "Professor of linguistics Dominic Matei survives a cataclysmic event and finds his youth restored. However, his intellect attracts the attention of Nazi scientists, forcing him into exile. While on the run, he reunites with his lost love and works to complete his research on the origins of language. —yusufpiskin"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGU0Yjg5NWQtMmVjMy00YTk3LWJlMGMtNGJlMDAyYjMyODViXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "23999",
                "_score": 22.658512,
                "_source": {
                    "title": "Leningrado",
                    "rating": 6,
                    "year": 2009,
                    "directors": [
                        "Aleksandr Buravskiy"
                    ],
                    "writers": [
                        "Aleksandr Buravskiy",
                        "Chris Solimine"
                    ],
                    "actors": [
                        "Mira Sorvino",
                        "Armin Mueller-Stahl",
                        "Olga Sutulova",
                        "Gabriel Byrne",
                        "Mikhail Efremov",
                        "Aleksandr Abdulov",
                        "Vladimir Ilin",
                        "Alyona Stebunova",
                        "Sergey Koltakov",
                        "David Verrey",
                        "Viktor Smirnov",
                        "Vadim Loginov",
                        "Marat Basharov",
                        "Zhanna Nesterenko",
                        "Aleksandra Kulikova",
                        "Luiza Mosendz",
                        "Aleksandr Polovtsev",
                        "Valentina Talyzina",
                        "Mariya Golubkina",
                        "Evgeniy Stychkin",
                        "Sergey Gorobchenko",
                        "Marina Rokina",
                        "Pavel Derevyanko",
                        "Evgeniy Sidikhin",
                        "Mikhail Trukhin",
                        "Aleksandr Sirin",
                        "Eckehard Hoffmann",
                        "Alexander Beyer",
                        "Aleksandr Filippenko",
                        "Nikolay Olyalin",
                        "Helen Lindsay",
                        "Sergey Nikonenko",
                        "Valentin Gaft",
                        "Kirill Lavrov",
                        "Aleksandr Bashirov",
                        "Christian Berkel",
                        "Igor Lifanov",
                        "Yuri Kolokolnikov",
                        "Boris Smolkin",
                        "Aleksey Melikhov",
                        "Roman Ageev",
                        "Aleksandr Orlovskiy",
                        "Andrey Noskov",
                        "Vyacheslav Karpov",
                        "Ilya Mozgovoy",
                        "Aleksandr Levit",
                        "Vera Milovskaya",
                        "Nataliya Kadochnikova",
                        "Marina Ivanova",
                        "Elena Yarema",
                        "Aleksandr Pavlov",
                        "Liya Kuzmina",
                        "Vera Bykova-Pizhel",
                        "Nelli Molchanova",
                        "Aleksey Osipov",
                        "Kseniya Buravskaya",
                        "Natalya Pivovarova",
                        "Nataliya Lomakina",
                        "Aleksey Ispolatov",
                        "Yuriy Teterin",
                        "V. Kiselyova",
                        "R. Shebeko",
                        "Lidiya Dorotenko",
                        "Inna Slobodskaya",
                        "Tatyana Rogozina",
                        "M. Gorbatskiy",
                        "Aleksey Fedkin",
                        "A. Maksimov",
                        "A. Baranov",
                        "Konstantin Demidov",
                        "Pavel Gryaznov",
                        "Vladimir Chernyshov",
                        "Aleksandr Ryazantsev",
                        "Roman Pavlushev",
                        "Aleksandr Eremin",
                        "M. Vasilev",
                        "Vladimir Maslakov",
                        "Olga Belyavskaya",
                        "E. Letyagina",
                        "Natalya Burmistrova",
                        "Sergey Kudryavtsev",
                        "S. Volkova",
                        "Anna Nestertsova",
                        "Yaroslav Ivanov",
                        "Vladimir Maryanov",
                        "V. Maslov",
                        "Olga Filimonova",
                        "Donatas Banionis",
                        "Yuri Kondratyuk",
                        "Aleksandr Pashutin",
                        "Yekaterina Rednikova",
                        "Natalya Terekhova"
                    ],
                    "genres": [
                        "Drama",
                        "War"
                    ],
                    "country": "Russia",
                    "languages": [
                        "Russian",
                        "English",
                        "German"
                    ],
                    "runtime": 110,
                    "summary": [
                        "Winter, 1941. World War II rages on as Nazi troops invade the Soviet Union and besiege the devastated city of Leningrad. Foreign journalists are quickly evacuated, but in the chaos that ensues, Kate Davies is left behind.",
                        "When in 1941 Nazi Germany invaded the Soviet Union, their troops quickly besieged Leningrad. Foreign journalists are evacuated but one of them, Kate Davies, is presumed dead and misses the plane. Alone in the city she is helped by Nina Tsvetnova a young and idealist police officer and together they will fight for their own survival and the survival of the people in the besieged Leningrad. —Marcio Eduardo",
                        "It is 1941, and World War II rages on; the Nazis succeeded in taking over half of Europe and part of Russia until they reached Leningrad. Hitler fails to take Leningrad after a four-month-long offensive in 1941. Hitler realizes that Leningrad could not be taken by force, and now he will surround the city for three years, and starve three million people to death. In the midst of this horrific siege, a young English journalist, Kate Davis, finds herself among surviving Russians within the famished city of Leningrad. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjEzNzQwMjYwOV5BMl5BanBnXkFtZTcwMDQ4MzgxMw@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "19519",
                "_score": 22.605785,
                "_source": {
                    "title": "How Hitler Lost the War",
                    "rating": 7.5,
                    "year": 1989,
                    "directors": [
                        "Robert Denny",
                        "David Hoffman"
                    ],
                    "writers": [
                        "Robert Denny"
                    ],
                    "actors": [
                        "Norman Rose",
                        "Adolf Galland",
                        "Hans Adolf Jakobson",
                        "Johannes Steinhoff",
                        "J.A. Graf von Kielmannsegg",
                        "Geoffrey Page",
                        "Christopher Foxley Norris",
                        "R.V. Jones",
                        "Trevor DuPree",
                        "Charles W. Sydnor Junior",
                        "Winston Churchill",
                        "Dwight D. Eisenhower",
                        "Heinz Guderian",
                        "Hermann Göring",
                        "Adolf Hitler",
                        "Franklin D. Roosevelt",
                        "Charles von Luttichau",
                        "Erich von Manstein"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 67,
                    "summary": [
                        "Through interviews with former World War II fighter aces, "How Hitler Lost the War" examines the theory that the German Armed Forces substantially won and then lost the war in Europe before 1942. That had it not been for the political and military mistakes of Adolf Hitler, the United States would have had to stand alone against a Nazi Europe allied with an even more powerful Japan, and face a future that is barely imaginable. —Anthony Hughes <husnock31@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2MTAyNTI5NF5BMl5BanBnXkFtZTgwNzI0OTk1MDE@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "11819",
                "_score": 22.349955,
                "_source": {
                    "title": "Esperanza y gloria",
                    "rating": 7.3,
                    "year": 1987,
                    "directors": [
                        "John Boorman"
                    ],
                    "writers": [
                        "John Boorman"
                    ],
                    "actors": [
                        "Sebastian Rice-Edwards",
                        "Geraldine Muir",
                        "Sarah Miles",
                        "David Hayman",
                        "Sammi Davis",
                        "Derrick O'Connor",
                        "Susan Wooldridge",
                        "Jean-Marc Barr",
                        "Ian Bannen",
                        "Annie Leon",
                        "Jill Baker",
                        "Amelda Brown",
                        "Katrine Boorman",
                        "Colin Higgins",
                        "Shelagh Fraser",
                        "Gerald James",
                        "Barbara Pierson",
                        "Nicky Taylor",
                        "Jodie Andrews",
                        "Nicholas Askew",
                        "Jamie Bowman",
                        "Colin Dale",
                        "David Parkin",
                        "Carlton Taylor",
                        "Sara Langton",
                        "Imogen Cawrse",
                        "Susan Brown",
                        "Charley Boorman",
                        "Peter Hughes",
                        "Ann Thornton",
                        "Andrew Bicknell",
                        "Christine Croshaw",
                        "William Armstrong",
                        "Arthur Cox",
                        "John Boorman",
                        "Neville Chamberlain",
                        "Graham Cole",
                        "Susie Duffy",
                        "Vic Flick",
                        "King George VI",
                        "Tina Simmons",
                        "Guy Standeven"
                    ],
                    "genres": [
                        "Comedy",
                        "Drama",
                        "Romance"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 113,
                    "summary": [
                        "Bill, a young boy living on the outskirts of London experiences the exhilaration of World War II. During this period, Bill learns about sex, death, love, hypocrisy, and the faults of adults as he prowls the ruins of bombed houses.",
                        "A semi-autobiographical project by John Boorman about a nine year old boy called Bill as he grows up in London during the blitz of World War II. For a young boy, this time in history was more of an adventure, a total upheaval of order, restrictions and discipline. The liberating effect of the war on the women left behind. And the joy when Hitler blows up your school. —Colin Tinto <cst@imdb.com>",
                        "Bill Rohan, a young boy living on the outskirts of London experiences the exhilaration of World War II, as seen through the eyes of director John Boorman, who also wrote and produced the autobiographical film. During this period, Bill learns about sex, death, love, hypocrisy, and the faults of adults as he prowls the ruins of bombed houses on Rosehill Avenue. His childlike father is off chasing patriotic dreams of glory from behind a military clerk's typewriter; his teenage sister runs wild; his mother can't cope; and everything in the end will eventually turn out all right. —alfiehitchie",
                        "Now on the far side of middle age, Bill Rowan remembers back to his growing up period in suburban London during WWII, he ten years old when the war broke out. Beyond his father Clive enlisting and what his absence meant, Bill saw the war as an adventure, the specific events more anticlimactic for him compared to the fear driven into the populace of what could happen. Even with the nightly German air raids and bombs actually dropped in their neighborhood, he saw the bomb sites as a playground from which to collect shrapnel and with his newfound friends to destroy whatever survived the bombs. While his younger sister Susie was too young to comprehend fully what the war meant, his mid-teen sister Dawn went on as a teenage girl with raging hormones is apt to focus on, namely boys, or in wartime young men of the military variety, she often feigning the option of death compared to not being with someone, most specifically a Canadian soldier training nearby. And while Bill's mother Grace was ill-prepared emotionally to be without Clive, she had to grow up quickly to deal with leading the family through the changing times. With Dawn, Grace could see her own teen period a bit more clearly due to the war and what she would have done differently if she had to do it all over again. —Huggo",
                        "Bill is your average young boy, living in London with his parents and two sisters. His should be a conventional childhood but it is September 1939 and the UK is at war with Germany. In the next few years Bill will grow up with the fear and devastation of war, but also some fond memories. —grantss"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMTRiNWMtNmVmNS00YWIxLTg2NmItYWI3YWYzM2JhZTUwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "18835",
                "_score": 22.349955,
                "_source": {
                    "title": "Los juicios de Nuremberg",
                    "rating": 7.3,
                    "year": 2000,
                    "actors": [
                        "Alec Baldwin",
                        "Brian Cox",
                        "Christopher Plummer",
                        "Jill Hennessy",
                        "Christopher Heyerdahl",
                        "Roger Dunn",
                        "David McIlwraith",
                        "Christopher Shyer",
                        "Hrothgar Mathews",
                        "Herbert Knaup",
                        "Frank Moore",
                        "Frank Fontaine",
                        "Raymond Cloutier",
                        "Bill Corday",
                        "Ken Kramer",
                        "Sam Stone",
                        "Douglas O'Keeffe",
                        "Benoît Girard",
                        "James Bradford",
                        "Frank Burns",
                        "Erwin Potitt",
                        "Tom Rack",
                        "Roc Lafortune",
                        "Dennis St John",
                        "Griffith Brewer",
                        "Gabriel Gascon",
                        "Julien Poulin",
                        "Alain Fournier",
                        "René Gagnon",
                        "Len Cariou",
                        "David Francis",
                        "Len Doncheff",
                        "Paul Hébert",
                        "Colm Feore",
                        "Charlotte Gainsbourg",
                        "Robert Joy",
                        "Michael Ironside",
                        "Matt Craven",
                        "Geoffrey Pounsett",
                        "Scott Gibson",
                        "Steve Adams",
                        "Paul Hopkins",
                        "Mark Walker",
                        "Howard Bilerman",
                        "Max von Sydow",
                        "Alain Goulem",
                        "Robert Burns",
                        "Guy Sprung",
                        "Mark Houghton",
                        "Rebecca Jenkins"
                    ],
                    "genres": [
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 180,
                    "summary": [
                        "The dramatized account of the war crime trials following the defeat of Nazi Germany in World War II.",
                        "Following the defeat of Germany in WWII, the Allies determine that there must be an accounting of German war crimes. Twenty-four Nazis, representative of all sections of military and civilian life are chosen to stand trial for the crimes of conspiracy to commit aggression, commission of aggression, crimes during war and crimes against humanity. The preparations for the trial, the trial itself and its aftermath are shown through the eyes of Chief Prosecutor Robert Jackson and through the eyes of Reichsmarshal Hermann Goering, the ranking Nazi defendant. —Jason A. Cormier",
                        "In 1945, after the end of the World War II with the defeat of a ruined Germany, the Allies decide to give a fair trial to twenty-one Nazi leaders POW as an example of intolerance of the governments against hideous atrocities in war. The defendants are accused crimes of war and against humanity, and the American Chief Prosecutor Robert Jackson is assigned to organize an international tribunal at Nuremberg with representatives from France, Russia and England. The prisoners under the leadership of Hitler's second-in-command Marshall Hermann Goering dispute the control in a juridical battle in the courtroom. —Claudio Carvalho, Rio de Janeiro, Brazil",
                        "This fact-based courtroom drama examines the international tribunal that assembled in war-torn Nuremberg, Germany following World War II to try various German officer for war crimes and atrocities. Led by American Justice Robert Jackson, the assembled team must first put together the courtroom, then question captured Nazis to determine who should be tried, and ultimately select 21 individuals to stand trial. Initially opposed to execution, Jackson became more accepting of the sentence as he learned of the severity of the heinous acts that occurred. The 21 Nazis, led by Hitler's second-in-command, Hermann Göring, try to take control of the courtroom. However, their bravado fails as the graphic films show the heinous acts that had occurred. Some of the film's dialog is taken directly from court transcripts. The film shows much graphic footage from the concentration camps that is not for the squeamish. —John Sacksteder <jsackste@bellsouth.net>",
                        "It is May of 1945 and Germany stands ruined and defeated after the unconditional surrender to the Allies. However, Hitler lies dead in his Berlin bunker by suicide and the world calls out for justice. In an attempt to bring reconciliation to the crime that was Nazi Germany, American Justice Robert Jackson establishes an International War Crimes Tribunal at Nuremburg. The first of several such trials, the court will hear cases on two dozen leaders of the Nazi Party and the German military. "Nuremberg" tells this story with points of view from Justice Jackson as well as the unrepentant Hermann Goring and also Albert Speer; one of the very few who admitted to the terrible crimes in which he was a part. —Anthony Hughes <husnock31@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzg5ZmE0OGQtOTA1MC00MDQzLTliOTktMTBkZDVmYWY0NjljXkEyXkFqcGdeQXVyMTczNjQwOTY@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "21893",
                "_score": 22.181908,
                "_source": {
                    "title": "Hitler: El reinado del mal",
                    "rating": 7.2,
                    "year": 2003,
                    "actors": [
                        "Peter Stormare",
                        "Friedrich von Thun",
                        "Peter O'Toole",
                        "Zoe Telford",
                        "Terence Harvey",
                        "Justin Salinger",
                        "Chris Larkin",
                        "James Babson",
                        "Patricia Netzer",
                        "Harvey Friedman",
                        "Nicole Marischka",
                        "Julie-Ann Hassett",
                        "Thomas Brodie-Sangster",
                        "Simon Sullivan",
                        "Robert Glenister",
                        "Ian Hogg",
                        "Filip Hes",
                        "Brendan Hughes",
                        "Howard Lotker",
                        "Robert Russell",
                        "David Fisher",
                        "Hana Frejková",
                        "Wolfgang Müller",
                        "Christopher Ettridge",
                        "Jena Malone",
                        "Matthew Modine",
                        "Julianna Margulies",
                        "Robert Carlyle",
                        "Liev Schreiber",
                        "Stockard Channing",
                        "David Calder",
                        "Marek Vasut",
                        "Bruce Byron",
                        "George Pensotti",
                        "Joel Kirby",
                        "Julian Wadham",
                        "Richard Haas",
                        "Richard Katz",
                        "Laurence Kennedy",
                        "Simon Chandler",
                        "Ned Vukovic",
                        "David O'Kelly",
                        "Gavin Stewart",
                        "Rod Grover",
                        "Richard Rowlands",
                        "John Comer",
                        "Terence Longdon",
                        "Christopher Bowen",
                        "Liliana Komorowska",
                        "Todd Kramer"
                    ],
                    "genres": [
                        "Biography",
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English"
                    ],
                    "runtime": 130,
                    "summary": [
                        "A unique slant, profiling the life of Adolf Hitler as a child and his rise through the ranks of the National Socialist German Workers' Party prior to World War II.",
                        "This movie describes the life of Adolf Hitler from childhood to manhood, and how he became so powerful. It describes his poor childhood in Austria, it describes World War I from his point of view, and how he became the strongest man in Germany. This movie shows us how Hitler turned from a poor soldier into the leader of the Nazis, and how he survived the attempts to kill him. It describes his relationship with his mistress Eva Braun, and his decisions and enemies inside Germany and inside the Nazi party. —rsilberman"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjE1ODY4NzI0M15BMl5BanBnXkFtZTcwNzUxNzM1MQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "23174",
                "_score": 22.103115,
                "_source": {
                    "title": "Island at War",
                    "rating": 7.6,
                    "year": 2004,
                    "actors": [
                        "Saskia Reeves",
                        "Owen Teale",
                        "Julia Ford",
                        "Clare Holman",
                        "James Wilby",
                        "Sean Gallagher",
                        "Joanne Froggatt",
                        "Samantha Robinson",
                        "Ann Rye",
                        "Philip Glenister",
                        "Daniel Flynn",
                        "Conor Mullen",
                        "Benjamin Whitrow",
                        "Caroline Strong",
                        "Sean Ward",
                        "Sam Heughan",
                        "Laurence Fox",
                        "Louisa Clein",
                        "Stephen Mallatratt",
                        "Andrew Havill",
                        "Colin Tierney",
                        "Richard Dempsey",
                        "Nick Roud",
                        "Sarah Kirkman",
                        "Cara Chase",
                        "Malcolm Raeburn",
                        "Marshall Griffin",
                        "Rupert Young",
                        "Geoffrey Beevers",
                        "Jeremy Beckham",
                        "Jimmy Nickerson",
                        "David de Keyser",
                        "Julian Wadham",
                        "Richard Cottier",
                        "John Tallents",
                        "Sarah Parks",
                        "Eamonn Riley",
                        "Amy Ginsburg",
                        "Brian Southwood",
                        "Kate-Lynn Hocking",
                        "Ian Blower",
                        "Joan Blackham",
                        "Mark Stratton",
                        "Ryan Ellsworth",
                        "Ralph Gassmann",
                        "Bill Champion",
                        "Cyriack Stevenson",
                        "Leigh Jones",
                        "Stephen Tomlin",
                        "Seamus O'Neill"
                    ],
                    "genres": [
                        "Drama",
                        "War"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 540,
                    "summary": [
                        "During the Second World War, a quiet channel island community is thrown into turmoil by the invasion forces of Nazi Germany.",
                        "Set during the occupation of the Channel Islands during World War II. The story shows how Island life changed overnight after a German invasion. Islanders were restricted to walking and cycling, town names were changed to German names, clocks were set to continental time, and no society could meet without the permission of German High Command. The focus is on three families, the Dorrs, the Jonases and the Mahys, as they struggle on with day to day life under the restrictive new system. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYzg4NDBhODQtYmJjZS00NzcxLThmYTktNDZlNWE5NzQzZTlkXkEyXkFqcGdeQXVyNjUwMTQ4NjE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "14255",
                "_score": 21.972279,
                "_source": {
                    "title": "Rebeldes del swing",
                    "rating": 6.7,
                    "year": 1993,
                    "directors": [
                        "Thomas Carter"
                    ],
                    "writers": [
                        "Jonathan Marc Feldman"
                    ],
                    "actors": [
                        "Robert Sean Leonard",
                        "Christian Bale",
                        "Frank Whaley",
                        "Barbara Hershey",
                        "Tushka Bergen",
                        "David Tom",
                        "Julia Stemberger",
                        "Jayce Bartok",
                        "Noah Wyle",
                        "Johan Leysen",
                        "Douglas Roberts",
                        "Martin Clunes",
                        "Jessica Hynes",
                        "Carl Brincat",
                        "Mary Fogarty",
                        "Karel Belohradský",
                        "Peter Baikie",
                        "Jennifer Chamberlain",
                        "Lucie Vackárová",
                        "Katerina Danková",
                        "Magdaléna Chrzová",
                        "Jirí Málek",
                        "Metin Yenal",
                        "Arthur White",
                        "Marek Libert",
                        "Nada Konvalinková",
                        "Petr Jákl",
                        "David Robb",
                        "Ciaran Madden",
                        "John Streitburger",
                        "Hana Cízková",
                        "Petr Lepsa",
                        "Warnar Van Eeden",
                        "Andrew Kitchen",
                        "Jeremy Bulloch",
                        "Joseph Bennett",
                        "Roman Janousek",
                        "Richard Hanson",
                        "Sean Pertwee",
                        "Sarka Horcikova",
                        "Jochen Horst",
                        "Vladimír Matejcek",
                        "John Pirkis",
                        "Marie Vorlova",
                        "Eliza Clark",
                        "Kate Buffery",
                        "Sabine Skalla",
                        "Liam Burke",
                        "Sven Daum",
                        "Gregorey Garrison",
                        "Ulf Garritzmann",
                        "Ideal Getinkaya",
                        "Ines Goritz",
                        "Bettina Heyroth",
                        "Dita Kalibova",
                        "Dana Kopacova",
                        "Britta Krause",
                        "Ivan Landa",
                        "Tomas Mesner",
                        "Anna Montanaro",
                        "Cathy Murdoch",
                        "Vaclav Muska",
                        "Melinda O'Connor",
                        "Julie Oram",
                        "Tessa Pattani",
                        "Lenka Pesatova",
                        "Simon Shelton",
                        "Tini Stoll",
                        "Pavel Svoboda",
                        "Freya Trampert",
                        "Klara Vejvodova",
                        "Mickey Blaine",
                        "Kenneth Branagh",
                        "Paul Covington",
                        "Christopher Yohe"
                    ],
                    "genres": [
                        "Drama",
                        "Music"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 112,
                    "summary": [
                        "A group of teens adores forbidden music in Nazi Germany just before the outbreak of World War II.",
                        "A close-knit group of young kids in Nazi Germany listen to banned swing music from the U.S. Soon, dancing and fun lead to more difficult choices, as the Nazis begin tightening their grip on Germany. Each member of the group is forced to face some tough choices about right, wrong, and survival. —Susan Southall <stobchatay@aol.com>",
                        "In pre-World War II Germany, Swing music becomes the underground movement of young people. Two engineering students attempt to be Swing Kids by night, and Hitler Youth by day. The impact of this decision is felt acutely by their friends and families. A charming S.S. officer complicates matters for Peter, whose father was taken away for defending his Jewish colleagues at the University. —Dave Smith <dave@stat.colostate.edu>",
                        "Kids all over the world, and all through time want to rebel. Peter Muller (Robert Sean Leonard) and Thomas Berger (Christian Bale) are two such young men whose rebellion against the conformity of Nazi Germany took the form of a love of American swing music, British fashion, and Harlem slang. But when an innocent prank forces Peter into the Hitler Youth, their friendship and their loyalties are put to the test against the seductive power of Naziism. —Jack Gambol <gambja00@dons.ac.usfca.edu>",
                        "In Nazi Germany, the youth of the nation were pressed into joining the pro-Nazi Youth League called the "Hitlerjugend", or "Hitler Youth". A group of rebel teenagers, however, chose to defy Nazi directives and grew their hair long and listened to American music while calling themselves the "Swing Kids". This is the story of one group of Swing Kids and how Nazi rule and persuasion tore them apart and set them against each other. —Anthony Hughes <husnock31@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNmM2YTg5MjctZmJjNy00YWVjLTgyMjMtOWYxYzZlYjNiMDk3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY150_CR5,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "39419",
                "_score": 21.90667,
                "_source": {
                    "title": "Flight World War II",
                    "rating": 4.3,
                    "year": 2015,
                    "directors": [
                        "Emile Edwin Smith"
                    ],
                    "writers": [
                        "Jacob Cooney",
                        "Bill Hanstock"
                    ],
                    "actors": [
                        "Faran Tahir",
                        "Robbie Kay",
                        "Aqueela Zoll",
                        "Matias Ponce",
                        "Howard Gordon",
                        "Alberto Barros Jr.",
                        "Adam Blake",
                        "David Campfield",
                        "Angie Teodora Dick",
                        "Daniel Fieber",
                        "Vi Flaten",
                        "Blaine Gray",
                        "Radmar Agana Jao",
                        "Erik MacRay",
                        "Daniel Mentz",
                        "Tyler Messner",
                        "Jonathan Nation",
                        "Mike Quirk",
                        "Rebecca Reaney",
                        "Trista Robinson",
                        "Thaddeus Shafer",
                        "Hamish Sturgeon",
                        "Jodi Taylor",
                        "Meredith Thomas",
                        "Jason Wesley",
                        "Angela Whitworth",
                        "Ali Zahiri",
                        "Eric Schowengerdt",
                        "Sandell Stangl",
                        "Ben Archer",
                        "Gary Archer",
                        "Adam Blake",
                        "Angie Dick",
                        "Daniel Fieber",
                        "Danny French",
                        "Harwood Gordon",
                        "Blaine Gray",
                        "Michael Hussey",
                        "Erik Macray",
                        "Susee Villasenor",
                        "Ryan Walker"
                    ],
                    "genres": [
                        "Action",
                        "Adventure",
                        "Sci-Fi",
                        "Thriller",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "German"
                    ],
                    "runtime": 85,
                    "summary": [
                        "After Flight 42 travels through a storm they find themselves in France, 1940, during World war II.",
                        "Flight 42 was on its way, when it comes across an unidentifiable storm. Realizing they must go through, find themselves in France, 1940, World war II. A young soldier (Robbie Kay) tells them they are in the middle of a war zone. Dodging bullets and bombs the flight will attempt to make it back to modern day, without changing history too much. —emilyh9817",
                        "On a journey that will change their lives forever, the passengers aboard Flight 42 are forced to fight in one of the greatest battles in history, World War Two. Trouble is, this is one struggle they could have never predicted... having taken off in 2015.",
                        "Flight 42 was on its way, when it comes across a weird electromagnetic storm. Realizing they must go through, they find themselves in France, 1940, [[World War II]]. A history professor tells them they are in the middle of a war zone. Dodging bullets and bombs the flight will attempt to make it back to modern day, without changing history too much. —Edmundo Arizabal Jr."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk5NTY4ODkxMV5BMl5BanBnXkFtZTgwNTY1NDgyNjE@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "22653",
                "_score": 21.718342,
                "_source": {
                    "title": "Hollywood y el holocausto",
                    "rating": 7.5,
                    "year": 2004,
                    "directors": [
                        "Daniel Anker"
                    ],
                    "actors": [
                        "Gene Hackman",
                        "Norma Barzman",
                        "Jack Benny",
                        "Michael Berenbaum",
                        "Robert Berger",
                        "Humphrey Bogart",
                        "Tom Brokaw",
                        "LeVar Burton",
                        "James Cagney",
                        "Charles Chaplin",
                        "Robert Clary",
                        "Montgomery Clift",
                        "Bud Cort",
                        "Dan Curtis",
                        "Michael Dunn",
                        "Ralph Edwards",
                        "Ralph Fiennes",
                        "Eva Herzberg Florsheim",
                        "Stanley Frazen",
                        "Neal Gabler",
                        "John Garfield",
                        "Ruth Gordon",
                        "Oliver Hardy",
                        "Rosemary Harris",
                        "Adolf Hitler",
                        "Annette Insdorf",
                        "Martin Luther King",
                        "Ben Kingsley",
                        "Kevin Kline",
                        "Hanna Bloch Kohner",
                        "Carl Laemmle",
                        "Stan Laurel",
                        "Carole Lombard",
                        "Sidney Lumet",
                        "Branko Lustig",
                        "Peter MacNicol",
                        "Abby Mann",
                        "Liam Neeson",
                        "Gerald P. Nye",
                        "Jack Oakie",
                        "Moyshe Oysher",
                        "Gregory Peck",
                        "Millie Perkins",
                        "Gene Reynolds",
                        "Sharon Rivo",
                        "Thane Rosenbaum",
                        "Heinz Rühmann",
                        "Irene Sachs",
                        "Maximilian Schell",
                        "Vincent Sherman",
                        "Steven Spielberg",
                        "Martin Starger",
                        "Rod Steiger",
                        "George Stevens Jr.",
                        "James Stewart",
                        "Meryl Streep",
                        "Margaret Sullavan",
                        "Hannah Taylor Gordon",
                        "Spencer Tracy",
                        "Malvin Wald",
                        "Harry M. Warner",
                        "Fritz Weaver",
                        "Richard Widmark",
                        "Jade Williams",
                        "James Woods"
                    ],
                    "genres": [
                        "Documentary",
                        "History"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 92,
                    "summary": [
                        "The history of Hollywood's handling of the Nazis and its later depiction of the Holocaust they perpetrated.",
                        "Of recent historical events, few events have been so searing, and thus so difficult to depict faithfully both in nature and scope in film, than the Holocaust perpetrated by the Nazis. This film tells the story of Hollywood's approach to the subject, starting with its initial pre-war reluctance to alienate the lucrative German market. With World War II, and the discovery of the Nazi horrors, we follow Hollywood's reaction over the decades to the atrocity. Challenged with a tragedy that beggared the imagination of artists and audiences, Hollywood grew from trying to keep it in the abstract to striving to depict it head-on in ways that would be both truthful and respectful with the proper humanity. —Kenneth Chisholm (kchishol@rogers.com)"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTMyMTMwOTEzMl5BMl5BanBnXkFtZTcwNjUzNTkyMg@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "29110",
                "_score": 21.641403,
                "_source": {
                    "title": "Tobruk",
                    "rating": 5.9,
                    "year": 2008,
                    "directors": [
                        "Václav Marhoul"
                    ],
                    "writers": [
                        "Václav Marhoul",
                        "Stephen Crane"
                    ],
                    "actors": [
                        "Jan Meduna",
                        "Petr Vanek",
                        "Robert Nebrenský",
                        "Michal Novotný",
                        "Martin Nahálka",
                        "Matús Krátky",
                        "Krystof Rímský",
                        "Petr Lnenicka",
                        "Andrej Polák",
                        "Petr Stach",
                        "Radim Fiala",
                        "Matej Hádek",
                        "Karel Klinovsky",
                        "Petr Halberstadt",
                        "Petr Vrsek",
                        "Elaine Cristina Weissova",
                        "Ashley White",
                        "Daniel Margolius",
                        "Václav Valtera",
                        "Jacob Erftemeijer",
                        "Tomas Michalek",
                        "Norman Birse",
                        "Julian Martin",
                        "Andreas Riegler",
                        "Ghazi Somai",
                        "Stepán Benoni",
                        "Frantisek Mesícek",
                        "Vojtech Kotek",
                        "Jaromír Meduna",
                        "Jim High",
                        "Felix Meadowsweet",
                        "Martin Fratric",
                        "Jan Monczka"
                    ],
                    "genres": [
                        "History",
                        "War"
                    ],
                    "country": "Czechia",
                    "languages": [
                        "Czech",
                        "Slovak",
                        "Portuguese"
                    ],
                    "runtime": 102,
                    "summary": [
                        "Set in the Libyan Desert in WW2 a battalion of Czech soldiers face the siege of Tobruk.",
                        "It is the story of Jiri and Jan, two Czech soldiers, battling alongside the allied forces against the Germans, during World War II in Tobruk, Libya. Jiri Pospichal, eighteen years old, signs up as a volunteer in the Czechoslovak army. His naive ideas about heroism are rawly confronted with the hell of the African desert, complicated relationships in his unit and the ubiquitous threat of death. —AnonymousB"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTI3NDU5OTU3M15BMl5BanBnXkFtZTcwNTgyMjMzMg@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "10095",
                "_score": 21.596834,
                "_source": {
                    "title": "Los unos y los otros",
                    "rating": 7.3,
                    "year": 1981,
                    "directors": [
                        "Claude Lelouch"
                    ],
                    "writers": [
                        "Claude Lelouch"
                    ],
                    "actors": [
                        "Robert Hossein",
                        "Nicole Garcia",
                        "Geraldine Chaplin",
                        "Daniel Olbrychski",
                        "Jorge Donn",
                        "Rita Poelvoorde",
                        "Macha Méril",
                        "Evelyne Bouix",
                        "Francis Huster",
                        "Raymond Pellegrin",
                        "Paul Préboist",
                        "Jean-Claude Brialy",
                        "Marthe Villalonga",
                        "Fanny Ardant",
                        "Jacques Villeret",
                        "Jean-Claude Bouttier",
                        "Richard Bohringer",
                        "Nicole Croisille",
                        "Ginette Garcin",
                        "Jean-Pierre Kalfon",
                        "Geneviève Mnich",
                        "Alexandra Stewart",
                        "Éva Darlan",
                        "Manuel Gélin",
                        "Candice Patou",
                        "Maïa Simon",
                        "James Caan",
                        "Sarah Abrell",
                        "Féodor Atkine",
                        "Mireille Audibert",
                        "Jean-Claude Bourbault",
                        "Christophe Bourseiller",
                        "Jean-Pierre Castaldi",
                        "Anne Caudry",
                        "Louise Chevalier",
                        "Véronique Coquet",
                        "Thérèse Crémieux",
                        "Katalin Csarny",
                        "Dan Daes",
                        "Nicole Daresco",
                        "Andrée Delair",
                        "Linda Dingwall",
                        "Bernard-Pierre Donnadieu",
                        "Maxime Dufeu",
                        "Andy Fenwick",
                        "Farmer Fuller",
                        "Ernie Garrett",
                        "Charles Gérard",
                        "Evelyne Hue",
                        "Gérard Ismaël",
                        "Philippe Jacques",
                        "Lyle Joyce",
                        "Evelyne Ker",
                        "Jerry Kilgore",
                        "Jeffrey Kime",
                        "Jean Lescot",
                        "Michèle Moretti",
                        "Jean-Paul Muel",
                        "Durrell Nelson",
                        "Barry Primus",
                        "Valérie Quennessen",
                        "Georges Rabol",
                        "Brigitte Roüan",
                        "Fanny Roy",
                        "Frank Runyeon",
                        "Paulita Sedgwick",
                        "Pierre Semmler",
                        "Raymond Serra",
                        "Tom Signorelli",
                        "Arch Taylor",
                        "Martin Trévières",
                        "Paul Vincent",
                        "Hattie Winston",
                        "Simon Lelouch",
                        "Sharon Stone",
                        "Webster Whinery"
                    ],
                    "genres": [
                        "Drama",
                        "Music"
                    ],
                    "country": "France",
                    "languages": [
                        "French",
                        "English",
                        "German",
                        "Russian"
                    ],
                    "runtime": 184,
                    "summary": [
                        "Trough fabulous music, this movie tracks three generations of musicians and dancers from Russia, Germany, France and the U.S., from before World War II through the war and the Holocaust, to the 1980s. Their lives become intertwined through the historical circumstances, and the culmination is the presence of several, including a former Nazi pianist and a French Jewish Holocaust survivor at an anti-famine concert. —Ed Cannon <ecannon@mail.utexas.edu>",
                        "Along three generations, the lives of different families in Russia, France, Germany and United States of America, all of them connected to music and dance, are affected by the World War II. In Russia, the Bolshoi ballerina Tatiana Itovitch loses her husband, the musician Boris Itovitch, in the Russian front. She raises alone their son, the professional dancer Sergei, who escapes from Soviet Union and coming to have a daughter, the also ballerina Tania. In France, the Jewish violinist Anne Meyer marries the pianist Simon Meyer, and both are sent to a concentration camp, where Simon dies. On the train travel to the camp, Simon leaves their baby son on the trails and he is raised by a priest, becoming the lawyer Robert Prat, who has a professional singer son. Also in France, in Paris after the war, the singer Evelyne is accused of sleeping with the enemy, and moves to Dijon, where she has a daughter, Edith. In Germany, the pianist and conductor Karl Kremer leaves his wife Magda Kremer and their son to fight in the war. In USA, the famous pop singer Jack Glenn leaves his wife Suzan Glenn to join the army and entertain the troops in London. Their gay son Jason Glenn and daughter, the singer Sara Glenn become important persons in the show business. Their lives are entwined in a Red Cross presentation of the Ravel's Bolero in Paris. —Claudio Carvalho, Rio de Janeiro, Brazil"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNDA5MGYyN2ItODdhNi00YjFjLTg0MzktNmExYWM5ODhlZDljXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR5,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "30990",
                "_score": 21.593258,
                "_source": {
                    "title": "Puppet Master: Axis of Evil",
                    "rating": 4.1,
                    "year": 2010,
                    "directors": [
                        "David DeCoteau"
                    ],
                    "writers": [
                        "Domonic Muir",
                        "David Schmoeller"
                    ],
                    "actors": [
                        "Levi Fiehler",
                        "Jenna Gallaher",
                        "Taylor M. Graham",
                        "Tom Sandoval",
                        "Jerry Hoffman",
                        "Erica Shaffer",
                        "Ada Chao",
                        "Mike Brooks",
                        "Aaron Riber",
                        "Xiangfu Zhang",
                        "Gu Yingfeng",
                        "Peter Frankland",
                        "William Hickey",
                        "Andrew Kimbrough"
                    ],
                    "genres": [
                        "Fantasy",
                        "Horror",
                        "Sci-Fi",
                        "Thriller",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 83,
                    "summary": [
                        "During the Second World War, a young man, with the help of some animated puppets, must stop the Nazis who attacked his family and kidnapped his girlfriend.",
                        "In a Stateside hotel during the height of World War II, young Danny Coogan dreams of joining the war effort. Following the murder of hotel guest Mr. Toulon by Nazi assassins, Danny finds the old man's crate of mysterious puppets and is suddenly thrust into a battle all his own. He discovers that Nazis Max and Klaus, along with beautiful Japanese saboteur Ozu, plan to attack a secret American manufacturing plant. After his family is attacked and his girlfriend Beth is kidnapped, it is up to Danny and the living deadly Puppets to stop this Axis of Evil. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTc2MjM1MzE0M15BMl5BanBnXkFtZTcwNjE0NTYzNQ@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "14242",
                "_score": 21.510397,
                "_source": {
                    "title": "Evasión número 24",
                    "rating": 6.6,
                    "year": 1993,
                    "directors": [
                        "Adrian Shergold"
                    ],
                    "writers": [
                        "David Nobbs"
                    ],
                    "actors": [
                        "Stephen Fry",
                        "Nicholas Lyndhurst",
                        "Geoffrey Palmer",
                        "Sam Kelly",
                        "David Bamber",
                        "Hugh Bonneville",
                        "Marston Bloom",
                        "Todd Boyce",
                        "Roger Hyams",
                        "Wayne Cater",
                        "Benedick Blythe",
                        "Simon Donald",
                        "Tim McMullan",
                        "Henry Webster",
                        "Pavel Bavolets",
                        "Steffan Boje",
                        "Robert Packham",
                        "John Pirkis",
                        "Carl Duering",
                        "Michael Mellinger",
                        "Paul Humpoletz",
                        "Sarah Helen Buckley",
                        "Joerg Stadler"
                    ],
                    "genres": [
                        "Comedy",
                        "Drama",
                        "War"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 103,
                    "summary": [
                        "During WW2, after the 'ingenious' desertion of the German guards, the Allied prisoners of a POW camp decide to remain in the camp, some masquerading as German guards, in order to fool the frequent SS inspections.",
                        "During World War II, some Commonwealth prisoners are trying to escape from a German prison camp. Because they are old and weak, the Germans decide to escape with them. Just after the Germans are outside, the prisoners take control of the camp. Some will act as prisoners, some as Germans. —Pierre Côté <pbcote@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzE2NzY2NjIwMl5BMl5BanBnXkFtZTcwMjg5MzAzMQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "25203",
                "_score": 21.27369,
                "_source": {
                    "title": "Adam resucitado",
                    "rating": 6.2,
                    "year": 2008,
                    "directors": [
                        "Paul Schrader"
                    ],
                    "writers": [
                        "Yoram Kaniuk",
                        "Noah Stollman"
                    ],
                    "actors": [
                        "Jeff Goldblum",
                        "Willem Dafoe",
                        "Derek Jacobi",
                        "Ayelet Zurer",
                        "Hana Laslo",
                        "Joachim Król",
                        "Evgenia Dodina",
                        "Tudor Rapiteanu",
                        "Veronica Ferres",
                        "Idan Alterman",
                        "Juliane Köhler",
                        "Dror Keren",
                        "Shmuel Edelman",
                        "Yoram Toledano",
                        "Miki Leon",
                        "Moritz Bleibtreu",
                        "Benjamin Jagendorf",
                        "Theodor Danetti",
                        "Gabriel Spahiu",
                        "Luana Stoica",
                        "Coca Bloos",
                        "Ioana Abur",
                        "Ozana Oancea",
                        "Maria Chiran",
                        "Ana Benea",
                        "Cristian Motiu",
                        "George Remes",
                        "Constantin Florescu",
                        "Ion Arcudeanu",
                        "Mohamad",
                        "Moti Rozentsvaig",
                        "Ilan Aviv",
                        "Berivan Laura Haj Abdo",
                        "Ana Geoanna",
                        "Amina Abu Shanab",
                        "Hanelore Bauer",
                        "Mihaela Denisa Mallat",
                        "Cristina Anghel",
                        "Ehud Bleiberg",
                        "Alexandra Savu",
                        "Mirela Dranga",
                        "Alexa Paraschiva",
                        "Georgeta Radu",
                        "Maria Dumitru",
                        "Vatafu Alina",
                        "Teodora Bencea",
                        "Alexandra Vasilescu",
                        "Mircea Ilioara",
                        "Biet Gica",
                        "Dan Chiriac",
                        "Marilena Botis",
                        "Mihaela Jaglau",
                        "Giorgiana Voicu",
                        "Luiza Anatal",
                        "Gina Burlacu",
                        "Marian Marinov",
                        "Rodica Marinof",
                        "Diana Poran",
                        "Constantin Rotaru",
                        "Vanda Rotaru",
                        "Lucian Gavriluta",
                        "Eugenia Leau",
                        "Gladiola Lamatic",
                        "Mircea Luculescu",
                        "Laurentiu Grigorescu",
                        "Liviu Popa",
                        "Constantin Urziceanu",
                        "Liana Margineanu",
                        "Vasile Albinet",
                        "Andrei Preorocu",
                        "Lionte Sergiu",
                        "Ionut Mereuta",
                        "Dinu Mereuta",
                        "Vlad Theodor Cacinschi",
                        "Robert Cazan",
                        "Rolf Bitler",
                        "Yakov Broomberg",
                        "Michel Vazana",
                        "Rammy Zrog",
                        "Sam",
                        "Andrei Ciopec",
                        "Yoram Kaniuk"
                    ],
                    "genres": [
                        "Drama",
                        "War"
                    ],
                    "country": "Germany",
                    "languages": [
                        "English"
                    ],
                    "runtime": 106,
                    "summary": [
                        "In the aftermath of World War II, a former circus entertainer who was spared from the gas chamber becomes the ringleader at an asylum for Holocaust survivors.",
                        "This movie follows the story of Adam Stein, a charismatic patient at a mental institution for Holocaust survivors in Israel, 1961. He reads minds and confounds his doctors, lead by Nathan Gross. Before the war, in Berlin, Adam was an entertainer - cabaret impresario, circus owner, magician, musician - loved by audiences and Nazis alike until he finds himself in a concentration camp, confronted by Commandant Klein. Adam survives the camp by becoming the Commandant's "dog", entertaining him while his wife and daughter are sent off to die. Years later, we find him at the Institute. One day, Adam smells something, hears a sound. "Who brought a dog in here?" he asks Gross. Gross denies there is a dog, but Adam finds him, a young boy raised in a basement on a chain. Adam and the boy see and recognize each other as dogs, and their journey begins. This movie is the story of a man who once was a dog who meets a dog who once was a boy.",
                        "In Berlin, the Jewish Adam Stein is a successful artist that works with his wife and two daughters in a cabaret. During the World War II, Adam and his family are sent to a concentration camp and the cruel Commandant Klein, who was his fan, assigns Adam to become his "dog" to entertain him. Adam has to live like a dog with another dog, Rex, while tries to convince Klein to save his wife and his little daughter that are sent to the ovens. After the war, Adam is sent to a mental institution in Israel for Survivors of the Holocaust under the care of the psychiatric Dr. Nathan Gross and becomes a leader among the patients. He also has a mistress, the nurse Gina Grey, who loves kinky sex. One day, Adam smells a dog in the institute, which is forbidden, and he finds a boy that was raised chained in a basement and behaves like a dog. Adam recalls his period as a dog in the concentration camp and gets close to the dog-like boy and their journey together begins. —Claudio Carvalho, Rio de Janeiro, Brazil"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BY2VlNDlmNmMtYzQxZS00ZmU5LWJhNTctYjRlYjZmMDZkNWFjXkEyXkFqcGdeQXVyNzIzMTc2Mw@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "27050",
                "_score": 21.126665,
                "_source": {
                    "title": "Jackboots on Whitehall",
                    "rating": 5.2,
                    "year": 2010,
                    "directors": [
                        "Edward McHenry",
                        "Rory McHenry"
                    ],
                    "writers": [
                        "Edward McHenry",
                        "Rory McHenry"
                    ],
                    "actors": [
                        "Hugh Fraser",
                        "Alexander Armstrong",
                        "Rory McHenry",
                        "Ewan McGregor",
                        "Stephen Merchant",
                        "Richard E. Grant",
                        "Tom Wilkinson",
                        "Tobias Menzies",
                        "Caroline Duff",
                        "Charlotte Moore",
                        "Rosamund Pike",
                        "Martyn Ellis",
                        "James Hicks",
                        "Pam Ferris",
                        "Brian Conley",
                        "Richard Griffiths",
                        "Richard O'Brien",
                        "Dominic West",
                        "Timothy Spall",
                        "Jimmy Boyle",
                        "Edward McHenry",
                        "Sanjeev Bhaskar",
                        "Neil Newbon",
                        "Benedick Blythe",
                        "Alan Cumming",
                        "Stephen Lord",
                        "Jonathan Barlow",
                        "Jana Agnew",
                        "Karl Richards",
                        "Mark Taylor"
                    ],
                    "genres": [
                        "Animation",
                        "Comedy",
                        "Sci-Fi",
                        "War"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 91,
                    "summary": [
                        "A satirical alternative history of World War II where the Nazis seize London and England must band together to prevent a full-on invasion.",
                        "World War II: What if Nazis seized London and all of England had to band together? When scarily campy Nazi leaders invade by drilling under the English Channel and up through the cobblestones on Whitehall, Churchill leaves his quiet retirement with a cat that looks like Hitler to issue a call to arms from his bunker under Downing Street. Chris, a young farm worker with large hands, rallies the village to fight the good fight -- including an alcoholic Vicar, the oldest man in the town, several idiots, a random Frenchman and Bobby Fiske, a swearing American who believes he's battling Russia. The world's future is in their tiny plastic hands. Innovative puppeteering animatronics from Scottish brothers Edward and Rory McHenry combine with the larger-than-life voices of Ewan McGregor, Alan Cumming, Dominic West, Rosamund Pike, Tom Wilkinson, Timothy Spall and Richard E. Grant. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZDFjNTg0ZWUtOTE4YS00NTljLTg1MzAtNWEwOGRkMzA1NTQxL2ltYWdlXkEyXkFqcGdeQXVyNzM0MDQ1Mw@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "15704",
                "_score": 20.94941,
                "_source": {
                    "title": "La caza de Eichmann",
                    "rating": 6.5,
                    "year": 1996,
                    "directors": [
                        "William A. Graham"
                    ],
                    "writers": [
                        "Peter Z. Malkin",
                        "Harry Stein",
                        "Lionel Chetwynd"
                    ],
                    "actors": [
                        "Robert Duvall",
                        "Arliss Howard",
                        "Jeffrey Tambor",
                        "Jack Laufer",
                        "Nicolas Surovy",
                        "Joel Brooks",
                        "Michael Laskin",
                        "Sam Robards",
                        "Michael Tucci",
                        "Rusty Schwimmer",
                        "Rita Zohar",
                        "Jean Pierre Reguerraz",
                        "Celina Font",
                        "Erika Wallner",
                        "Kevin Schiele",
                        "Gregory Dayton",
                        "Marcelo Sycz",
                        "Brian Hussey",
                        "David Masajnik",
                        "John Ominiyi",
                        "Marco Failoni",
                        "Alex Wagner",
                        "Marcos Woinsky",
                        "Fabián Stratas"
                    ],
                    "genres": [
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Spanish",
                        "Hebrew"
                    ],
                    "runtime": 96,
                    "summary": [
                        "The story of the 1960 hostile extraction of the Nazi war criminal, Adolf Eichmann, by the Mossad to Israeli justice.",
                        "In 1960, the Israeli Secret Service learns that former SS-Lietuenant Colonel Adolf Eichmann, who was one of the key figures in the Jewish holocaust of World War II, is living under the assumed name Ricardo Clement in Argentina. The film thus explores the Isreali effort to capture Eichmann, as seen from the perspective of the leading agent of the project, as well as giving focus to Eichmann's own explanations as to the crimes he commited. —Anthony Hughes <husnock31@hotmail.com>",
                        "In the opening scene, cows are herded onto a cattle car, and the train begins its trip; in the next scene, former Nazi officer Adolf Eichmann and his young son watch from a window of their Buenos Aires home as the train passes. Thus the underlying theme of the movie is revealed: the Jewish Holocaust. This is a tense reenactment of the capture of Eichmann, posing as Ricardo Klement, by the Israeli Mossad in Argentina in 1960. —Jeff Hole <jeffhole@aol.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTk5NjU1NTYxMV5BMl5BanBnXkFtZTcwMzk1MjIyMQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "13069",
                "_score": 20.758003,
                "_source": {
                    "title": "Skinheads",
                    "rating": 3.3,
                    "year": 1989,
                    "directors": [
                        "Greydon Clark"
                    ],
                    "writers": [
                        "Greydon Clark",
                        "David Reskin"
                    ],
                    "actors": [
                        "Chuck Connors",
                        "Barbara Bain",
                        "Jason Culp",
                        "Brian Brophy",
                        "Liz Sagal",
                        "Bill Kohne",
                        "Lynna Hopwood",
                        "Gene Mitchell",
                        "Frank Noon",
                        "Dennis Ott",
                        "James A. Stunden",
                        "Michael Fox",
                        "Bunny Summers",
                        "Jadili Johnson",
                        "Cynthia Cheston",
                        "Duane Davis",
                        "Clark Corkum",
                        "Trevor Clark"
                    ],
                    "genres": [
                        "Thriller"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": [
                        "A group of students traveling to California are menaced by a vicious group of skin-heads in the Colorado mountains. A WW2 vet living in the mountains comes to their rescue.",
                        "A gang of skinheads is wanted by the police after committing a series of brutal crimes in their hometown. While trying to lay low in a more rural area, they get into a fight with the owner of a truck stop. When two witness run off into the woods, the gang follows, intent on silencing them for good. Fortunately for the fleeing pair, they stumbling upon a survivalist (and World War II veteran) with no fondness for Nazis, traditional or Neo. —Jean-Marc Rocher <rocher@fiberbit.net>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTNlNDM5NDUtNTliMC00ODUyLWExYzEtY2RhYzQyMTQwMjAzXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_SY150_CR6,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "25394",
                "_score": 20.645853,
                "_source": {
                    "title": "Obsession: Radical Islam's War Against the West",
                    "rating": 6.5,
                    "year": 2005,
                    "directors": [
                        "Wayne Kopping"
                    ],
                    "writers": [
                        "Wayne Kopping",
                        "Raphael Shore"
                    ],
                    "actors": [
                        "Nonie Darwish",
                        "Alan Dershowitz",
                        "Steve Emerson",
                        "Brigitte Gabriel",
                        "Martin Gilbert",
                        "Caroline Glick",
                        "Alfons Heck",
                        "Glen Jenvey",
                        "John Loftus",
                        "Salim Mansur",
                        "Itamar Marcus",
                        "Khaleel Mohammed",
                        "Daniel Pipes",
                        "Tashbih Sayyed",
                        "Walid Shoebat",
                        "Khaled Abu Toameh",
                        "Robert Wistrich"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "Arabic",
                        "Parsee",
                        "English"
                    ],
                    "runtime": 77,
                    "summary": [
                        "Obsession is a film about the threat of Radical Islam to Western civilization. Using unique footage from Arab television, it reveals an 'insider's view' of the hatred the Radicals are teaching, their incitement of global jihad, and their goal of world domination. The film also traces the parallels between the Nazi movement of World War II, the Radicals of today, and the Western world's response to both threats. Featuring interviews with Daniel Pipes, Steve Emerson, Alan Dershowitz, a former PLO terrorist, and a former Hitler Youth Commander. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTk3ODAyNTIyM15BMl5BanBnXkFtZTcwOTE3NDU0MQ@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "20976",
                "_score": 20.644047,
                "_source": {
                    "title": "Estamos solos pero unidos",
                    "rating": 8.6,
                    "year": 2001,
                    "directors": [
                        "Mark Cowen"
                    ],
                    "writers": [
                        "William Richter"
                    ],
                    "actors": [
                        "James Alley Jr.",
                        "Roderick Bain",
                        "Lynn 'Buck' Compton",
                        "Antonio García de Pedro",
                        "William Guarnere",
                        "Forrest Guth",
                        "Lester Hashey",
                        "Edward 'Babe' Heffron",
                        "Moose Heyliger",
                        "Margo Johnson",
                        "Don King",
                        "Joe Lesniewski",
                        "C. Carwood Lipton",
                        "Donald Malarkey",
                        "John Martin",
                        "Bill Maynard",
                        "Earl McClung",
                        "Norm Nietzke",
                        "Patrick O'Keefe",
                        "Roy Pickel",
                        "Darrell 'Shifty' Powers",
                        "Wayne Powers",
                        "Denver 'Bull' Randleman",
                        "Paul Rogers",
                        "J.B. Stokes",
                        "Robert Strayer",
                        "Rod Strohl",
                        "Herb Suerth",
                        "Buck Taylor",
                        "Ed Tipper",
                        "Kerry Tipper",
                        "Pete Toye",
                        "William Wingett",
                        "Richard D. Winters",
                        "Robert 'Popeye' Wynn",
                        "Henry C. Zimmerman",
                        "Wilhelm Brückner",
                        "Dwight D. Eisenhower",
                        "Adolf Hitler"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 78,
                    "summary": [
                        "Compiled over two years, an 'on-camera oral history' of Easy Company, told by the veterans themselves. Accompanies the mini-series Band of Brothers.",
                        "Over a period of two years, Mark Cowen and his crew travelled to 30 U.S. and ten European cities, to interview the veterans of Easy Co. The stories, told by the veterans themselves, create a history of the Second World War from the point of view of this heroic company of men, made famous in the mini-series Band of Brothers. —Anonymous",
                        "A companion piece to Band of Brothers (2001) this documentary interviews many of the surviving members of Easy Company who recall their campaigns in World War II. They discuss their training in Georgia, leaving the US for England, D Day action, Operation Market Garden, holding the line at Bastogne and being the first Allied troops in Berchtesgaden. They reminisce about their comrades-in-arms, both the survivors and those who didn't make it home. —garykmcd"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYmEyZmY1MTUtMmEwNy00ZmFmLWEwNGEtZTg1YzMzZWZkNjE1XkEyXkFqcGdeQXVyNzQzNzQxNzI@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "12897",
                "_score": 20.590145,
                "_source": {
                    "title": "God afton, herr Wallenberg",
                    "rating": 6.5,
                    "year": 1990,
                    "directors": [
                        "Kjell Grede"
                    ],
                    "writers": [
                        "Kjell Grede"
                    ],
                    "actors": [
                        "Stellan Skarsgård",
                        "Katharina Thalbach",
                        "Károly Eperjes",
                        "Miklós Székely B.",
                        "Erland Josephson",
                        "Franciszek Pieczka",
                        "Jesper Christensen",
                        "Ivan Desny",
                        "Géza Balkay",
                        "Percy Brandt",
                        "Tamás Jordán",
                        "Andor Lukáts",
                        "Gábor Reviczky",
                        "László Soós",
                        "Franciska Györy",
                        "Zsuzsa Szabó",
                        "László Csákányi",
                        "István Mészáros",
                        "Katalin Eröss",
                        "István Holl",
                        "Vera Venczel",
                        "András Bálint",
                        "Imre Antal",
                        "Enikó Kovách",
                        "Ferenc Dávid Kiss",
                        "Anikó Gruiz",
                        "Balázs Galkó",
                        "Gábor Ferenczi",
                        "Edit Soós",
                        "László F. Kiss",
                        "Imre Kamondi",
                        "Tomas Norström",
                        "Lars Lindström",
                        "István Oltyán",
                        "Bengt Eklund"
                    ],
                    "genres": [
                        "Biography",
                        "Drama",
                        "War"
                    ],
                    "country": "Sweden",
                    "languages": [
                        "Swedish",
                        "Hungarian",
                        "German"
                    ],
                    "runtime": 118,
                    "summary": [
                        "A story of how a Swedish diplomat saved thousands of Hungarian Jews during the final months of World War II.",
                        "Swedish national Raoul Wallenberg, newcomer to politics and international machinations, travels to German-occupied Budapest during WWII in order to effectively intervene in the fate of trapped Hungarian Jews, by providing them with safe passage to Sweden. Based on a true story. —Eileen Berdon <eberdon@aol.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTUyMzYzNzE3Ml5BMl5BanBnXkFtZTcwMjcyNDIyMQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "11758",
                "_score": 20.519325,
                "_source": {
                    "title": "Yuki yukite, shingun",
                    "rating": 8.2,
                    "year": 1987,
                    "directors": [
                        "Kazuo Hara"
                    ],
                    "actors": [
                        "Kenzo Okuzaki",
                        "Riichi Aikawa",
                        "Masaichi Hamaguchi",
                        "Toshio Hara",
                        "Shichiro Kojima",
                        "Masao Koshimizu",
                        "Taro Maruyama",
                        "Toshiya Nomura",
                        "Shizumi Okuzaki",
                        "Eizaburo Oshima",
                        "Rinko Sakimoto",
                        "Yukio Seo",
                        "Iseko Shimamoto",
                        "Minoru Takami",
                        "Kichitaro Yamada"
                    ],
                    "genres": [
                        "Documentary",
                        "War"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese"
                    ],
                    "runtime": 122,
                    "summary": [
                        "A documentary following Kenzo Okuzaki, a 62-year-old WW2 veteran notorious for his protests against Emperor Hirohito, as he tries to expose the needless executions of two Japanese soldiers during the war.",
                        "This documentary was five years in the making, and revolves around 62-year-old Okuzaki Kenzo, a survivor of the battlefields of New Guinea in World War II who gained notoriety by slingshooting steel pinballs at Emperor Showa to protest against what he considered to be the ruler's war crimes. Setting out to conduct interviews with survivors and relatives, he finds the truth of the past to be elusive, achieving a breakthrough only when he confronts ex-Sergeant Yamada, who grudgingly admits the occurrence and instructional source of certain atrocities. —L.H.Wong <as9401k56@ntuvax.ntu.ac.sg>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzIwMDQ4NTk3MV5BMl5BanBnXkFtZTcwOTUxNDE0MQ@@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "11759",
                "_score": 20.519325,
                "_source": {
                    "title": "Yuki yukite, shingun",
                    "rating": 8.2,
                    "year": 1987,
                    "directors": [
                        "Kazuo Hara"
                    ],
                    "actors": [
                        "Kenzo Okuzaki",
                        "Riichi Aikawa",
                        "Masaichi Hamaguchi",
                        "Toshio Hara",
                        "Shichiro Kojima",
                        "Masao Koshimizu",
                        "Taro Maruyama",
                        "Toshiya Nomura",
                        "Shizumi Okuzaki",
                        "Eizaburo Oshima",
                        "Rinko Sakimoto",
                        "Yukio Seo",
                        "Iseko Shimamoto",
                        "Minoru Takami",
                        "Kichitaro Yamada"
                    ],
                    "genres": [
                        "Documentary",
                        "War"
                    ],
                    "country": "Japan",
                    "languages": [
                        "Japanese"
                    ],
                    "runtime": 122,
                    "summary": [
                        "A documentary following Kenzo Okuzaki, a 62-year-old WW2 veteran notorious for his protests against Emperor Hirohito, as he tries to expose the needless executions of two Japanese soldiers during the war.",
                        "This documentary was five years in the making, and revolves around 62-year-old Okuzaki Kenzo, a survivor of the battlefields of New Guinea in World War II who gained notoriety by slingshooting steel pinballs at Emperor Showa to protest against what he considered to be the ruler's war crimes. Setting out to conduct interviews with survivors and relatives, he finds the truth of the past to be elusive, achieving a breakthrough only when he confronts ex-Sergeant Yamada, who grudgingly admits the occurrence and instructional source of certain atrocities. —L.H.Wong <as9401k56@ntuvax.ntu.ac.sg>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMzIwMDQ4NTk3MV5BMl5BanBnXkFtZTcwOTUxNDE0MQ@@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "12973",
                "_score": 20.461735,
                "_source": {
                    "title": "A Man Called Sarge",
                    "rating": 4.4,
                    "year": 1990,
                    "directors": [
                        "Stuart Gillard"
                    ],
                    "writers": [
                        "Stuart Gillard"
                    ],
                    "actors": [
                        "Gary Kroeger",
                        "Gretchen German",
                        "Marc Singer",
                        "Jennifer Runyon",
                        "Andy Greenhalgh",
                        "Michael Mears",
                        "Bobby Di Cicco",
                        "Howard Busgang",
                        "Travis McKenna",
                        "Andy Bumatai",
                        "Chris England",
                        "Jeffry Wickham",
                        "Peter Dennis",
                        "Caitlyn Jenner",
                        "Yehuda Efroni",
                        "Aviva Marks",
                        "Lior Hashin",
                        "Zafrir Kochanovsky",
                        "Josef Bee",
                        "Natasha Lyonne",
                        "Tomer Yoseph",
                        "Alexander Peleg",
                        "Amikam Levi",
                        "Yuval Vill",
                        "Gabi Shoshan",
                        "Don LaFontaine",
                        "Ofer Shikartsi"
                    ],
                    "genres": [
                        "Comedy",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 88,
                    "summary": [
                        "The French Foreign Legion will never be the same after the uproarious World War II exploits of Sgt. Duke Roscoe and his band of military misfits. It's a hilarious "war movie" that will leave you shell-shocked with laughter.",
                        "In the midst of WWII, a group of half-witted soldiers led by a slightly smarter sergeant, battle the Germans and especially Von Kraut in the desert. —Steve Richer <sricher@sympatico.ca>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMGZjMDA1NTktNDA2MS00MzNkLTg3ZWUtMzE3N2ViYTlkZDZjXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_SX101_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "12471",
                "_score": 20.415257,
                "_source": {
                    "title": "Day One",
                    "rating": 7.4,
                    "year": 1989,
                    "directors": [
                        "Joseph Sargent"
                    ],
                    "writers": [
                        "Peter Wyden",
                        "David W. Rintels"
                    ],
                    "actors": [
                        "Brian Dennehy",
                        "David Strathairn",
                        "Michael Tucker",
                        "Hume Cronyn",
                        "Richard Dysart",
                        "Hal Holbrook",
                        "Barnard Hughes",
                        "John McMartin",
                        "David Ogden Stiers",
                        "Anne Twomey",
                        "Lawrence Dane",
                        "Ron Frazier",
                        "Olek Krupa",
                        "Bernie McInerney",
                        "John Pielmeier",
                        "Ken Pogue",
                        "Gary Reineke",
                        "Alan Scarfe",
                        "John Seitz",
                        "Tony Shalhoub",
                        "Ester Spitz",
                        "Ron White",
                        "István Bálint",
                        "Peter Boretski",
                        "Patrick Breen",
                        "Vlasta Vrana",
                        "George Popovich",
                        "Lorne Brass",
                        "Michael Sinelnikoff",
                        "Graham Haley",
                        "Fritz Buchinger",
                        "Kliment Denchev",
                        "Diana Fajrajsl",
                        "Timothy Webber",
                        "Harry Standjofski",
                        "Lia Sargent",
                        "David Gow",
                        "Michael Farrell",
                        "Isabelle Mejias",
                        "Jonathan Wise",
                        "George R. Robertson",
                        "Dee McCafferty",
                        "Tom Butler",
                        "Robert Morelli",
                        "Jon Baggaley",
                        "David Bolt",
                        "David Ferry",
                        "Heinar Piller",
                        "François Klanfer",
                        "Joel Miller",
                        "Michael J. Reynolds",
                        "Ed McGibbon",
                        "Nicholas Kilbertus",
                        "Joe Cazalet",
                        "Scott Thomson",
                        "Bob Clout",
                        "Roland Hewgill",
                        "Stan Gibbons",
                        "Terrence Labrosse",
                        "Delise Alison",
                        "Alex Guard",
                        "Philip Spensley",
                        "Frederick Neumann",
                        "Norris Domingue",
                        "Steve Barry",
                        "Lex Gord",
                        "Arthur Holden",
                        "Romano Orzari"
                    ],
                    "genres": [
                        "Drama",
                        "History"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 141,
                    "summary": [
                        "The use of the atomic bomb to end WWII was one of the most controversial events in human history. This Emmy-winning 1989 miniseries brings the conflicts to life in wrenching performances by a stellar cast.",
                        "The complicated relationship between physicist Leo Szilard, scientist J. Robert Oppenheimer and General Leslie Groves. Assigned to oversee the project, Groves chooses Oppenheimer to build the historic bomb. However, when World War II inspires the government to use the weapon, Szilard reconsiders his opinions about atomic warfare. —Jwelch5742",
                        "Hungarian physicist Leo Szilard leaves Europe, eventually arriving in the United States. With the help of Einstein, he persuades the government to build an atomic bomb. The project is given to no-nonsense Gen. Leslie Groves who selects physicist J. Robert Oppenheimer to head the Los Alamos Laboratory in New Mexico, where the bomb is built. As World War II draws to a close, Szilard has second thoughts about atomic weapons, and policy makers debate how and when to use the bomb. —Allen Brown <browna@ohsu.edu>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BODIxNTUzNDAzOV5BMl5BanBnXkFtZTcwNzI5MTI1MQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "29930",
                "_score": 20.272945,
                "_source": {
                    "title": "Harlan - Im Schatten von Jud Süß",
                    "rating": 6.9,
                    "year": 2008,
                    "directors": [
                        "Felix Moeller"
                    ],
                    "writers": [
                        "Felix Moeller"
                    ],
                    "actors": [
                        "August Zirner",
                        "Alice Harlan",
                        "Lotte Harlan",
                        "Nele Harlan",
                        "Lena Harlan",
                        "Thomas Harlan",
                        "Kristian Harlan",
                        "Caspar Harlan",
                        "Maria Körber",
                        "Veit Harlan",
                        "Jan Harlan",
                        "Christiane Kubrick",
                        "Hilde Körber",
                        "Kristina Söderbaum",
                        "Susanne Körber-Harlan",
                        "Jessica Jacoby",
                        "Chester Harlan",
                        "Stefan Drössler"
                    ],
                    "genres": [
                        "Documentary"
                    ],
                    "country": "Germany",
                    "languages": [
                        "German",
                        "French",
                        "Italian"
                    ],
                    "runtime": 100,
                    "summary": [
                        "Though almost forgotten today, Veit Harlan was one of Nazi Germany's most notorious filmmakers. His most perfidious film was the treacherous anti-Semitic propaganda film Jud Süß (1940) - required viewing for all SS members. An unrepentant and blindly obsessive craftsman, no figure - save for Leni Riefenstahl - is as closely associated with the cinema of the Holocaust years. (Harlan's epic Kolberg (1945) was the basis for Inglourious Basterds (2009)'s pivotal film-within-a-film Stolz Der Nation.) This documentary is an eye-opening examination of World War II film history as well as the story of a German family from the Third Reich to the present; one that is marked by reckoning, denial and liberation. —Zeitgeist Films and Jeffrey Prawdiuk-Spurr"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTY3Mjg4MzMzMl5BMl5BanBnXkFtZTcwMTA1MDIyMw@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "29838",
                "_score": 20.201515,
                "_source": {
                    "title": "Glorious 39",
                    "rating": 6.4,
                    "year": 2009,
                    "directors": [
                        "Stephen Poliakoff"
                    ],
                    "writers": [
                        "Stephen Poliakoff"
                    ],
                    "actors": [
                        "Romola Garai",
                        "Eddie Redmayne",
                        "Juno Temple",
                        "Toby Regbo",
                        "Christopher Lee",
                        "Corin Redgrave",
                        "Charlie Cox",
                        "David Tennant",
                        "Bill Nighy",
                        "Jeremy Northam",
                        "Katharine Burford",
                        "Jenny Agutter",
                        "Julie Christie",
                        "Hugh Bonneville",
                        "Asier Newman",
                        "Nicholas Blane",
                        "Jane Fowler",
                        "Sam Kubrick-Finney",
                        "Angela Terence",
                        "Jason White",
                        "Tom Goodman-Hill",
                        "Anthony Flanagan",
                        "Ryan Kiggell",
                        "Sarah Woodruff",
                        "Suzanne Burden",
                        "Richard Cordery",
                        "Joy McBrinn",
                        "Sharon Bower",
                        "Muriel Pavlow",
                        "George Anderson",
                        "Barry Ashton",
                        "Anna Bailey",
                        "Catherine Balavage",
                        "James Bartholomew",
                        "Alyn Gwyndaf",
                        "Sam Heydon",
                        "David Norfolk"
                    ],
                    "genres": [
                        "Drama",
                        "History",
                        "Mystery",
                        "Thriller",
                        "War"
                    ],
                    "country": "United Kingdom",
                    "languages": [
                        "English"
                    ],
                    "runtime": 129,
                    "summary": [
                        "The adopted daughter of a privileged British politician uncovers a family secret in the weeks leading up to World War II.",
                        "1939 is set between present-day London and the idyllic British countryside in the time before the beginning of the Second World War. At a time of uncertainty and high tension, the story revolves around the formidable Keyes family, who are keen to uphold and preserve their very traditional way of life. The eldest sibling Anne is a budding young actress who is in love with Foreign Office official Lawrence, but her seemingly perfect life begins to dramatically unravel when she stumbles across secret recordings of the pro-appeasement movement. While trying to discover the origin of these recordings, dark secrets are revealed which lead to the death of a great friend. As war breaks out Anne discovers the truth and flees to London to try to confirm her suspicions, but she is caught and imprisoned and only then does she finally begin to discover how badly she has been betrayed. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNjcyMDA2Mzk4M15BMl5BanBnXkFtZTcwNjUxNTE0NA@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "30235",
                "_score": 20.086416,
                "_source": {
                    "title": "Simon och ekarna",
                    "rating": 6.5,
                    "year": 2011,
                    "directors": [
                        "Lisa Ohlin"
                    ],
                    "writers": [
                        "Marnie Blok",
                        "Marianne Fredriksson",
                        "Lisa Ohlin",
                        "Oskar Söderlund"
                    ],
                    "actors": [
                        "Bill Skarsgård",
                        "Helen Sjöholm",
                        "Jan Josef Liefers",
                        "Stefan Gödicke",
                        "Karl Linnertorp",
                        "Jonatan S. Wächter",
                        "Karl Martin Eriksson",
                        "Erica Löfgren",
                        "Katharina Schüttler",
                        "Josefin Neldén",
                        "Lena Nylén",
                        "Cecilia Nilsson",
                        "Jan-Erik Emretsson",
                        "Pär Brundin",
                        "Frederik Nilsson",
                        "Hermann Beyer",
                        "Sven-Åke Gustavsson",
                        "Jan Holmquist",
                        "Iwar Wiklander",
                        "Peter Borenstein",
                        "Dellie Kamijo",
                        "Johanna Malmsten",
                        "Tage Wirenhed",
                        "Hanna Hedin Hillberg",
                        "Tom Lidgard",
                        "Raphaël Niba",
                        "Johan Marenius Nordahl",
                        "Marcus Standoft"
                    ],
                    "genres": [
                        "Drama"
                    ],
                    "country": "Sweden",
                    "languages": [
                        "Swedish",
                        "German",
                        "Hebrew",
                        "English"
                    ],
                    "runtime": 122,
                    "summary": [
                        "Two boys come of age in Sweden during World War II.",
                        "Epic story about two families and their friendship and common destiny in Sweden's Gothenburg in the 1940s and 1950s. Told from the perspective of young Simon Larsson, who learns that he's an adopted child who has a Jewish father from Germany. After WWII Simon travels to explore his roots - a journey that leads to the basic mysteries of the human life. After the bestselling novel by Marianne Fredriksson. —Schmidtz Katze Filmkollektiv"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTM4MjI5NF5BMl5BanBnXkFtZTcwNjcxMTEzOA@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "13393",
                "_score": 19.844143,
                "_source": {
                    "title": "La Venganza De Los Muñecos 2",
                    "rating": 5.9,
                    "year": 1991,
                    "directors": [
                        "David DeCoteau"
                    ],
                    "writers": [
                        "Charles Band",
                        "C. Courtney Joyner",
                        "David Schmoeller"
                    ],
                    "actors": [
                        "Guy Rolfe",
                        "Richard Lynch",
                        "Ian Abercrombie",
                        "Kristopher Logan",
                        "Aron Eisenberg",
                        "Walter Gotell",
                        "Sarah Douglas",
                        "Matthew Faison",
                        "Michelle Bauer",
                        "Jasmine Totschek",
                        "Eduard Will",
                        "John Regis",
                        "Neal Parrow",
                        "Kenneth Cortland",
                        "Lenny Rose",
                        "Laurie Mateyko",
                        "Rhonda Britten",
                        "Michael Lowry",
                        "Michael LeRoy Rhodes",
                        "John Cann",
                        "Michael Todd",
                        "Albert Band",
                        "Conrad Brooks",
                        "Gino Colbert",
                        "Michael Deak",
                        "Landon Hall",
                        "Kevin O'Hara",
                        "Ivan J. Rado",
                        "J.D. Walters"
                    ],
                    "genres": [
                        "Fantasy",
                        "Horror",
                        "Sci-Fi",
                        "Thriller",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 82,
                    "summary": [
                        "A puppeteer's ability to bring inanimate objects to life attracts the attention of the Nazis during World War II.",
                        "Set in Berlin during WWII, the Nazi regime is attempting to develop a drug that will animate the dead, in order to use in the war effort. Toulon arouses suspicion as a Nazi dissident, and his secret is discovered. During a Nazi raid on his home, Toulon's beautiful wife is murdered. Toulon vows revenge, with the help of his animated puppets. This movie gives a new perspective on Toulon and his "friends". —Craig West <cwest@teleport.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BZWY1Y2E1OTQtZDYyMC00ZTY3LWI1MTQtYTc1NWNjYmFiYzdiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "38033",
                "_score": 19.78965,
                "_source": {
                    "title": "Adolf Hitler: The Greatest Story Never Told",
                    "rating": 7.3,
                    "year": 2013,
                    "directors": [
                        "Dennis Wise"
                    ],
                    "writers": [
                        "Dennis Wise"
                    ],
                    "actors": [
                        "Eva Braun",
                        "Winston Churchill",
                        "Charles de Gaulle",
                        "Adolf Galland",
                        "Hermann Göring",
                        "Heinrich Himmler",
                        "Hirohito",
                        "Adolf Hitler",
                        "Benito Mussolini",
                        "George S. Patton",
                        "Hanna Reitsch",
                        "Franklin D. Roosevelt",
                        "Iosif Stalin"
                    ],
                    "genres": [
                        "Documentary",
                        "Biography",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "German",
                        "English",
                        "Russian"
                    ],
                    "runtime": 350,
                    "summary": [
                        "Adolf Hitler, born in Braunau, one man who will change the history of the world forever. It follows his childhood to the death of his mother and his broken ambition to become an artist, then further to his entry into politics. His service in the army, accolades, his writing Mein Kampf, politics and most importantly Germany's revival are well explained followed by WW2. It also covers the effect on Germany's after the WW2 defeat up until the fall of the Berlin Wall. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTU4Mzk4Njc3OV5BMl5BanBnXkFtZTgwOTgxODc3MTE@._V1_SY150_CR4,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "23638",
                "_score": 19.778486,
                "_source": {
                    "title": "Eighteen",
                    "rating": 6.3,
                    "year": 2005,
                    "directors": [
                        "Richard Bell"
                    ],
                    "writers": [
                        "Richard Bell"
                    ],
                    "actors": [
                        "Paul Anthony",
                        "Brendan Fletcher",
                        "Clarence Sponagle",
                        "Mark Hildreth",
                        "Carly Pope",
                        "David Beazely",
                        "Thea Gill",
                        "Alan Cumming",
                        "Ian McKellen",
                        "Serge Houde",
                        "Adrien Dorval",
                        "Gabrielle Rose",
                        "Paul Dzenkiw",
                        "Ryan McDonell",
                        "Kevan Ohtsji",
                        "Jesai Jayhmes",
                        "Crystal Heidrick",
                        "Brenda Crichlow",
                        "Randal Edwards",
                        "Matt Fentiman",
                        "Lawrence Jacob Milman",
                        "Sebastian Stewart",
                        "Jano Frandsen",
                        "Joe Costa",
                        "John Ziros"
                    ],
                    "genres": [
                        "Drama"
                    ],
                    "country": "Canada",
                    "languages": [
                        "English"
                    ],
                    "runtime": 106,
                    "summary": [
                        "On his eighteenth birthday, Pip receives his grandfather's Second World War memoirs on audio cassette, a gift that awakens the ghosts of the past.",
                        "Pip is a street kid who's meeting life head-on in the big city. On his eighteenth birthday he receives his grandfather's World War II memoirs on audio cassette, a gift that awakens the ghost of the long lost world. His grandfather relates the story of the day he turned eighteen, fleeing German forces through the woods of France with a dying comrade hanging on for life. In Pip's own and contemporary way, he begins to live the parallel life of his grandfather, both lost in their environments and generations. Along Pip's path he stumbles into an unlikely alliance with Clark, a gay street hustler on the make, and Jenny, an aspiring social worker who tempts Pip with feelings of love and domesticity. He also forges a small but important relationship with a local priest, in whom he confides his deepest secret: the death of his brother and the heinous act his father committed against him before his death. —Long Tale Entertainment"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNjg0NjM4Ml5BMl5BanBnXkFtZTcwNDg2NjM4OA@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "36214",
                "_score": 19.607943,
                "_source": {
                    "title": "Against the Sun",
                    "rating": 6.5,
                    "year": 2014,
                    "directors": [
                        "Brian Peter Falk"
                    ],
                    "writers": [
                        "Brian Peter Falk",
                        "Mark David Keegan"
                    ],
                    "actors": [
                        "Garret Dillahunt",
                        "Tom Felton",
                        "Jake Abel",
                        "Nadia Parra",
                        "Quinton Flynn"
                    ],
                    "genres": [
                        "Biography",
                        "Drama",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 100,
                    "summary": [
                        "A WWII pilot, bombardier, and radioman find themselves adrift on a lifeboat without food or water after being forced to ditch their plane during a scouting mission.",
                        "In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation - and each other - as they try to sail more than a thousand miles to safety. —The American Film Company"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BOTk5MjU0NTg3Nl5BMl5BanBnXkFtZTgwNTI3NTUzMzE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "33620",
                "_score": 19.362646,
                "_source": {
                    "title": "Frankenstein's Army",
                    "rating": 5.3,
                    "year": 2013,
                    "directors": [
                        "Richard Raaphorst"
                    ],
                    "writers": [
                        "Richard Raaphorst",
                        "Richard Raaphorst",
                        "Miguel Tejada-Flores",
                        "Chris W. Mitchell",
                        "Miguel Tejada-Flores",
                        "Mary Shelley"
                    ],
                    "actors": [
                        "Robert Gwilym",
                        "Hon Ping Tang",
                        "Alexander Terentyev",
                        "Luke Newberry",
                        "Joshua Sasse",
                        "Mark Stevenson",
                        "Andrei Zayats",
                        "Karel Roden",
                        "Klaus Lucas",
                        "Cristina Catalina",
                        "Jan de Lukowicz",
                        "Zdenek Barinka",
                        "Jan Mrkvicka",
                        "Linda Balabanova",
                        "Tereza Slavickova",
                        "Ivana Lokajová",
                        "Boris Bocev",
                        "Izabella Kisova",
                        "Emanuela Marie Maslova",
                        "Emma Cerná",
                        "Klemens Patijn",
                        "Ondrej Dolista",
                        "Radovan Korytiak",
                        "Jan Mendlik",
                        "Roman Prochazka",
                        "Jaroslav Tomascin",
                        "Michael Krass",
                        "René van Zinnicq Bergman",
                        "Valentine Berning",
                        "Martin David",
                        "Martin Basta",
                        "Miroslav Lhotka",
                        "Michael Malios",
                        "Vojtech Sulc",
                        "Marie Hornakova",
                        "Tomas Tomas",
                        "Bas Schwarz",
                        "Karel Belohradský",
                        "Stanislav Narovec",
                        "Samuel Slaby",
                        "Nikolas Domin",
                        "Petr Koza",
                        "Pavel Vaclavic",
                        "Xander Forterie",
                        "Jirí Hejbal",
                        "Carola Broekhoff",
                        "Azb Dahal"
                    ],
                    "genres": [
                        "Horror",
                        "Sci-Fi"
                    ],
                    "country": "Netherlands",
                    "languages": [
                        "English"
                    ],
                    "runtime": 84,
                    "summary": [
                        "In the dying days of WWII, a battalion of Russian soldiers is lured into the secret lab of a deranged scientist and forced to face off against an army of horrific flesh-and-metal war machines.",
                        "Toward the end of World War II, Russian soldiers pushing into eastern Germany stumble across a secret Nazi lab, one that has unearthed and begun experimenting with the journal of one Dr. Victor Frankenstein. The scientists have used the legendary Frankenstein's work to assemble an army of super-soldiers stitched together from the body parts of their fallen comrades -- a desperate Hitler's last ghastly ploy to escape defeat. —Production",
                        "During the World War II, a Russian troop in Germany receives a distress call in the radio from a group of Russian soldiers under siege by the Germans with the respective coordinates. The leader Sergeant Novikov decides to seek out the soldiers through the countryside of Germany. The soldier Dimitri is filming the troop to make a documentary and while they walk, they find weird bodies, slaughtered nuns in a convent burnt to the ground and open graves in a cemetery. They arrive at a deserted church where they meet a lethal army of undead with implanted weapons and tools. Soon they learn that the deranged but brilliant grandson of Dr. Viktor Frankenstein with the same name has a secret laboratory in the church and is responsible for those monstrosities. Further, they discover that their troop has been secretly assigned by the government to find and kill or bring the mad scientist to Moscow. —Claudio Carvalho, Rio de Janeiro, Brazil",
                        "In the waning days of World War II, Dimitri, a Red Army documentarian, and a small team of brothers-in-arms come across a bizarre Nazi laboratory run by the mad scientist Viktor: a direct descendant of the notorious Dr Frankenstein. But, there, in the dark dungeon rife with abominable, flesh-and-metal hybrids, no one is safe. Is there an escape from Adolf Hitler's plan for world domination and the deadly Zom-bot trap? —Nick Riganas"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjA1NDE0MzcyMF5BMl5BanBnXkFtZTcwNTU2MzA3OQ@@._V1_SY150_CR2,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "11457",
                "_score": 19.18814,
                "_source": {
                    "title": "Masacre",
                    "rating": 8.4,
                    "year": 1985,
                    "directors": [
                        "Elem Klimov"
                    ],
                    "writers": [
                        "Ales Adamovich",
                        "Ales Adamovich",
                        "Elem Klimov"
                    ],
                    "actors": [
                        "Aleksey Kravchenko",
                        "Olga Mironova",
                        "Liubomiras Laucevicius",
                        "Vladas Bagdonas",
                        "Jüri Lumiste",
                        "Viktors Lorencs",
                        "Kazimir Rabetsky",
                        "Evgeniy Tilicheev",
                        "G. Velts",
                        "V. Vasilyev",
                        "Aleksandr Berda",
                        "Vasiliy Domrachyov",
                        "Nina Evdokimova",
                        "Igor Gnevashev",
                        "Adolf Hitler",
                        "Valery Kravchenko",
                        "Evgeniy Kryzhanovskiy",
                        "N. Lisichenok",
                        "Viktor Manaev",
                        "Gennadiy Matytsky",
                        "Takhir Matyullin",
                        "Pyotr Merkurev",
                        "Valentin Mishatkin",
                        "Yevgeniya Polyakova",
                        "Aleksandra Ravenskikh",
                        "Oleg Shapko",
                        "Tatyana Shestakova",
                        "Anatoly Slivnikov",
                        "Aleksandr Solopov",
                        "Georgiy Strokov",
                        "G. Yelkin",
                        "Igor Bezyayev",
                        "Yakov Ovchukov-Suvorov",
                        "Svetlana Zelenkovskaya"
                    ],
                    "genres": [
                        "Drama",
                        "Thriller",
                        "War"
                    ],
                    "country": "Soviet Union",
                    "languages": [
                        "Russian",
                        "Belarusian",
                        "German"
                    ],
                    "runtime": 142,
                    "summary": [
                        "After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
                        "The feature film directed by Elem Klimov, shot in the genre of military drama. The action takes place on the territory of Belarus in 1943. In the center of the story is a Belarusian boy, who witnesses the horrors of the Nazi punitive action, turning from a cheerful teenager into a gray-haired old man for two days. —Peter-Patrick76 (peter-patrick@mail.com)",
                        "Belarus, 1943. More than anything, young Flyora, the only son of an impoverished peasant family, wants to take up arms and do his part in defending the homeland from the invading Nazis. However, there's nothing romantic about World War II. Indeed, by the time the inexperienced teenager joined a local unit of battle-tested partisans, the all-out German invasion of Belarus had already begun. Now, unspeakable horrors lie hidden in the fog of war, crushing Flyora's juvenile oblivion. And as the unsettling, irrefutable evidence of war disfigures Flyora's once-rosy, youthful face, the urgent plea for peace becomes timeless. —Nick Riganas",
                        "During WWII, a Belarusian boy is thrust into the atrocities of war, fighting with a hopelessly unequipped Soviet resistance movement against ruthless German forces. Witnessing scenes of abject terror and surviving horrifying situations, he loses his innocence and then his mind. —TheDistantPanic"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BNzU3OTI1MjItYTJiZC00NDI0LWFlNGYtOTQ1OTVhNDgwM2U3XkEyXkFqcGdeQXVyNTc2MDU0NDE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "28471",
                "_score": 18.933584,
                "_source": {
                    "title": "Sonny Boy",
                    "rating": 6.7,
                    "year": 2011,
                    "directors": [
                        "Maria Peters"
                    ],
                    "writers": [
                        "Annejet van der Zijl",
                        "Maria Peters",
                        "Pieter Van de Waterbeemd"
                    ],
                    "actors": [
                        "Ricky Koole",
                        "Sergio Hasselbaink",
                        "Angelo Arnhem",
                        "Eliyha Altena",
                        "Daniel van Wijk",
                        "Marcel Hensema",
                        "Micha Hulshof",
                        "Frits Lambrechts",
                        "Ole Kroes",
                        "Mees Wielinga",
                        "Sido Vrieswijk",
                        "Charlie Leuken",
                        "Martijn Lakemeier",
                        "Claire Veldkamp",
                        "Gaite Jansen",
                        "Gijs Blom",
                        "Ko Zandvliet",
                        "Leny Breederveld",
                        "Bert Geurkink",
                        "Roosmarijn Luyten",
                        "Manoushka Zeegelaar Breeveld",
                        "Dennis Rudge",
                        "Lois Moget",
                        "Joy Wielkens",
                        "Shamiro van der Geld",
                        "Rogier Komproe",
                        "Liesbeth Groenwold",
                        "Raymond Thiry",
                        "Martijn Nieuwerf",
                        "Stijn Westenend",
                        "Mike Reus",
                        "Thomas Cammaert",
                        "Ruben Brinkman",
                        "Wouter Zweers",
                        "Monic Hendrickx",
                        "Katja Herbers",
                        "Anneke Blok",
                        "Jaap Spijkers",
                        "Juda Goslinga",
                        "Nigel Person",
                        "Kaene Marica",
                        "Tycho Plooyer",
                        "Joss Flühr",
                        "Agaath Meulenbroek",
                        "Peter Drost",
                        "Franc Veeger",
                        "Levi Meijer",
                        "Henriette Koch",
                        "Judith Bovenberg",
                        "Marijn Bekkink",
                        "Sam Peetz",
                        "Marie-Louise Stheins",
                        "Herman Egbers",
                        "Leonoor Pauw",
                        "Reinier Noordzij",
                        "Wim Serlie",
                        "Marinus Vroom",
                        "Frank Meijers",
                        "Jaap ten Holt",
                        "Milian Krijgsman",
                        "Frank Witteveen",
                        "Tarzan Rutgers",
                        "Jan Bok",
                        "Pien Nods",
                        "Dave Mantel",
                        "Lotte Verbeek",
                        "Mick de Lint",
                        "Chris Bolczek",
                        "Gerard Meijler",
                        "Maiko Kemper",
                        "Boris Saran",
                        "Manon Nieuweboer",
                        "Alexander van Bergen",
                        "Jairi Terpstra",
                        "Kelly Lee Steen",
                        "Stef Feld",
                        "Annemarike Ruitenbeek",
                        "Nigel Gerritsen",
                        "Emma Vrieswijk",
                        "Alfred van der Poll",
                        "Niels van den Berg",
                        "Noah Helssloot",
                        "Jos van Hulst",
                        "Arent-Jan Linde",
                        "Sharelyah Emanuels",
                        "Lyric Nora Marica",
                        "Milaniyo Mota",
                        "Charissa Vliese",
                        "Caroline Korendijk",
                        "Junadry Leocaria",
                        "Hortence Hoogdorp",
                        "Lucille Beekman",
                        "Kenneth Cyrus",
                        "Danny Da Costa",
                        "Nico Meijer",
                        "Arno Bouts",
                        "Jos van den Berg",
                        "Willem Kaptein",
                        "Louis Schlaghecke",
                        "Astrid Overbroek",
                        "Leo de Jong",
                        "Frans Prins",
                        "Ben Appel",
                        "Nadia van den Berg",
                        "Rosalie Kreisky",
                        "Ron Sleeswijk",
                        "Bob van Rutten",
                        "Rene Blaeser",
                        "Tom Gilein",
                        "Ephraim Feves",
                        "Polle Vrienten",
                        "Benny van den Bijl",
                        "Rein Mulder",
                        "Ron Veugelaers",
                        "Ina Bergin",
                        "Corinne Carton",
                        "Annemiek Suijkerbuijk",
                        "Ingrid Jansen",
                        "Natacha Pierart",
                        "Marije Way",
                        "Robbert Blokland",
                        "Ydwer Bosma",
                        "Peter in 't Hout",
                        "Sander Jan Klerk",
                        "Ella Krings",
                        "Michele Rocco Smeets",
                        "Dani Stauder",
                        "Annejet van der Zijl",
                        "Tommy Van Leuken"
                    ],
                    "genres": [
                        "Biography",
                        "Drama",
                        "Romance",
                        "War"
                    ],
                    "country": "Netherlands",
                    "languages": [
                        "Dutch",
                        "English"
                    ],
                    "runtime": 130,
                    "summary": [
                        "A Dutch woman and a young man 17 years her junior from Suriname, struggle to make their relationship work in spite of the social and economic obstacles they face.",
                        "Waldemar, a young man from Suriname, meets middle-aged Dutch Rika and they fall in love. In pre-WWII Netherlands they could not be more different. The one Black, the other white, 17 years between them, and she already has four children by another man--but they love each other. When she falls pregnant by Waldemar, they choose each other despite the high price they must pay. They have a son, Waldy, their own 'Sonny Boy.' Then World War II breaks out and they risk their lives to save people in hiding--but not without major consequences. —Wiki"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjIxMjA4MTg4M15BMl5BanBnXkFtZTcwMTEwODYwNA@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "19559",
                "_score": 18.928497,
                "_source": {
                    "title": "Windtalkers",
                    "rating": 6.1,
                    "year": 2002,
                    "directors": [
                        "John Woo"
                    ],
                    "writers": [
                        "John Rice",
                        "Joe Batteer"
                    ],
                    "actors": [
                        "Nicolas Cage",
                        "Adam Beach",
                        "Peter Stormare",
                        "Noah Emmerich",
                        "Mark Ruffalo",
                        "Brian Van Holt",
                        "Martin Henderson",
                        "Roger Willie",
                        "Frances O'Connor",
                        "Christian Slater",
                        "Jason Isaacs",
                        "William Morts",
                        "Cameron Thor",
                        "Kevin Cooney",
                        "Holmes Osborne",
                        "Keith Campbell",
                        "Clayton J. Barber",
                        "Scott Atkinson",
                        "Jeremy Davidson",
                        "Brian Maynard",
                        "Albert Smith",
                        "James D. Dever",
                        "Vincent Whipple",
                        "Jim Morse",
                        "Chris Devlin",
                        "Jf Davis",
                        "Glen Begay",
                        "Ross Lasi Tanoai",
                        "Brian Kasai",
                        "Hiroshi Mori",
                        "John Takeshi Ichikawa",
                        "Christopher T. Yamamoto",
                        "Marc McClellan",
                        "Steve Tanizaki",
                        "Malcolm Dohi",
                        "Darrel Guilbeau",
                        "Aaron Yamagata",
                        "Victoria Chen",
                        "Jon Michael Souza",
                        "Carissa Jung",
                        "Wataru Yoshida",
                        "Junya Oishi",
                        "Jiro Koga",
                        "Lynn Kawailele Allen",
                        "Tina Leialoha Gube",
                        "Alewa T. Olotoa",
                        "Ilima Pumphrey",
                        "Lena Savaiinaea",
                        "Kaliko Scott",
                        "John Steven Rocha",
                        "Robert Aguilar Jr.",
                        "Job Alonso",
                        "Louis Per Bruno",
                        "Jim Carretta",
                        "Matty Castano",
                        "Toshiro Cinemasen",
                        "Paul Cowboy Jr.",
                        "Jerry DeCapua",
                        "Timothy Di Pri",
                        "Paul Edney",
                        "Christopher Gilbertson",
                        "David L. Hall",
                        "Matt Hall",
                        "Shannon Holzer",
                        "Yoshio Iizuka",
                        "Aaron Ikeda",
                        "Christopher Illing",
                        "Keii Johnston",
                        "Jordan Kirkwood",
                        "John Kirsch",
                        "Ender Lee",
                        "Steve Lindsay",
                        "Cazimir Milostan",
                        "Michael Ng",
                        "Nils Oliveto",
                        "Paul Parker",
                        "Denney Pierce",
                        "Simon Rhee",
                        "Charles Sans",
                        "Chadwick Shimomura",
                        "Bobby Silva",
                        "Douglas Dean Taylor",
                        "John Thomas",
                        "Ren Urano",
                        "Dixon White",
                        "Reese Williams",
                        "Jimmy Zerda"
                    ],
                    "genres": [
                        "Action",
                        "Drama",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English",
                        "Navajo",
                        "Japanese"
                    ],
                    "runtime": 134,
                    "summary": [
                        "Two U.S. Marines in World War II are assigned to protect Navajo Marines, who use their native language as an unbreakable radio cypher.",
                        "During World War II when the Americans needed to find a secure method of communicating they devised a code using the Navajo language. So Navajos were recruited to become what they call code talkers. They would be assigned to a unit and would communicate with other units using the code so that even though the enemy could listen they couldn't understand what they were saying. And to insure that the code is protected men are assigned to protect it at all costs. One of these men is Joe Enders, a man who sustained an injury that can make him unfit for duty but he manages to avoid it and is told of his duty and that the man he is suppose to protect is Ben Yahzee. Initially there is tension but the two men learn to get along. —rcs0411@yahoo.com",
                        "WWII. Joe Enders, a decorated Marine who is by-the-book to a fault, is just coming back on duty (by cheating on his medical tests). "Ox" Anderson, much greener, is also getting the same new task: Protect the Navajo codetalkers (Ben Yahzee and Charles Whitehorse, respectively). While Enders is initially frustrated with his assignment, his respect grows as the codetalkers prove their worth in the brutal battle to take Saipan. —Jon Reeves <jreeves@imdb.com>",
                        "In the close quarters and brutal fighting of the World War II Pacific Theater, the U.S. Intelligence services desperately seek a fool-proof encryption code, immune to the code breakers of the Japanese. The answer is soon discovered in the ancient language of the Navajo. Enlisted into the Marine Corps are several "Windtalkers" who are deployed to frontline areas in the Pacific, to use their language as an impossible-to-crack secret code. A drawback, however, is that the U.S. military soon puts forth a directive that the Windtalkers must never be captured alive by the enemy, so additional Marines are assigned to make certain that this directive is carried out to the letter. —Anthony Hughes <husnock31@hotmail.com>"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BYWU3NmIzMmQtZjE2Mi00NDlkLWI2NDMtZWZmYjUxZWRiZDZiL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR1,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "33996",
                "_score": 18.719532,
                "_source": {
                    "title": "Closer to the Moon",
                    "rating": 6.8,
                    "year": 2014,
                    "directors": [
                        "Nae Caranfil"
                    ],
                    "writers": [
                        "Nae Caranfil"
                    ],
                    "actors": [
                        "Vera Farmiga",
                        "Mark Strong",
                        "Harry Lloyd",
                        "Anton Lesser",
                        "Joe Armstrong",
                        "Christian McKay",
                        "Tim Plester",
                        "Darrell D'Silva",
                        "David de Keyser",
                        "Frances Cuka",
                        "Marcin Walewski",
                        "Allan Corduner",
                        "Monica Barladeanu",
                        "Paul Jesson",
                        "John Henshaw",
                        "Martin Hancock",
                        "Ed Gaughan",
                        "Martin McDougall",
                        "Stuart McQuarrie",
                        "Andrew Buckley",
                        "Ionut Grama",
                        "Smaranda Luna",
                        "Laura Cosac",
                        "Serban Pavlu",
                        "Ionut Burlan",
                        "Radu Caranfil",
                        "Orlando Petriceanu",
                        "Cosmin Nedelcu",
                        "George Remes",
                        "Ioan Cortea",
                        "Alan O'Silva",
                        "Relu Poalelungi",
                        "Silviu Geamanu",
                        "Daniel Popa",
                        "Felix Dumitrescu",
                        "Augustin Pop",
                        "Sorin Godi",
                        "Marius Damian",
                        "Gabriel Constantin",
                        "Corneliu Ulici",
                        "Radu Iacoban",
                        "Andrei Mateiu",
                        "Dan Radulescu",
                        "Laurentiu Bãnescu",
                        "Cosmin Dominte",
                        "Simona Pop",
                        "Silviu Biris",
                        "Irina-Halina Cornisteanu",
                        "Gheorghe Ifrim",
                        "Gabriela Butuc",
                        "Tudor Caranfil",
                        "Vlad Zamfirescu",
                        "Corneliu Jipa",
                        "Radu Bânzaru",
                        "Mihai Niculescu",
                        "Andreea Vulpe",
                        "Liudmila Anton",
                        "Marius Florea Vizante",
                        "John Riley",
                        "Eduard-Mihai Carlan",
                        "Edgar Nistor",
                        "Florin Penisoara",
                        "Conrad Mericoffer",
                        "Ioana Chitu",
                        "Bogdan Cotlet",
                        "Paul Ipate",
                        "Stefan Huluba",
                        "Lorena Luchian",
                        "Julian Vasile",
                        "Marius Dinca",
                        "Vlad Jipa",
                        "Theodor Delciu",
                        "Cristian Bota",
                        "George Burcea",
                        "Mihai Cojocaru",
                        "Grant Gillespie",
                        "Gwyneth Keyworth",
                        "Isaiah Michalski"
                    ],
                    "genres": [
                        "Comedy",
                        "Crime",
                        "Drama"
                    ],
                    "country": "Romania",
                    "languages": [
                        "English"
                    ],
                    "runtime": 112,
                    "summary": [
                        "A Romanian police officer teams up with a small crew of old friends from the World War II Jewish Resistance to pull off a heist by convincing everyone at the scene of the crime that they are only filming a movie.",
                        "In 1959 Bucharest, a spectacular bank heist has the country in an uproar. In post-war Communist Romania, this is an unimaginable slap in the face to the iron-fisted authorities. Four men and a woman are arrested, tried, and convicted, and while they wait for their execution, they are--forced to star in a propaganda film about the crime. All five protagonists were heroes of the Resistance during WWII and highly-placed members of Romanian society. They clearly knew they would be caught and executed. —Anonymous"
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTU3NjAzOTAxOF5BMl5BanBnXkFtZTgwNjE5MTUxNTE@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "9935",
                "_score": 18.618952,
                "_source": {
                    "title": "Genocide",
                    "rating": 7.3,
                    "year": 1982,
                    "directors": [
                        "Arnold Schwartzman"
                    ],
                    "writers": [
                        "Martin Gilbert",
                        "Marvin Hier",
                        "Arnold Schwartzman"
                    ],
                    "actors": [
                        "Elizabeth Taylor",
                        "Orson Welles",
                        "Simon Wiesenthal",
                        "Neville Chamberlain",
                        "Winston Churchill",
                        "Dwight D. Eisenhower",
                        "Joseph Goebbels",
                        "Hermann Göring",
                        "Rudolf Hess",
                        "Heinrich Himmler",
                        "Adolf Hitler",
                        "Ralph Metcalfe",
                        "Martinus Osendarp",
                        "Jesse Owens",
                        "Pope Pius XII",
                        "Franklin D. Roosevelt",
                        "Joachim von Ribbentrop",
                        "Erich Borchmeyer",
                        "Charles de Gaulle",
                        "King George VI",
                        "Queen Elizabeth II",
                        "Queen Elizabeth the Queen Mother",
                        "Iosif Stalin",
                        "Paul von Hindenburg",
                        "Frank Wykoff"
                    ],
                    "genres": [
                        "Documentary",
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "United States",
                    "languages": [
                        "English"
                    ],
                    "runtime": 90,
                    "summary": " Simon Wiesenthal stands outside the Mauthausen concentration camp, lamenting the desire of some to forget the Holocaust, and others to deny that it ever happened. As the only surviving member of his family, Simon can never forget, and fears that it may happen again.In the late nineteenth century, most of the world's Jewish population lived in more than 10,000 small communities called "shtetls,
                    " scattered throughout central Europe and the Russian Empire. Though many lived in poverty, these communities produced scholars, poets, and philosophers. Because of their unique traditions and style of dress, they were often treated with suspicion by their gentile neighbors, and were resented by religious leaders for their rejection of Christianity.Following World War I, Europe's 9,500,000 Jews looked forward to a more peaceful, democratic, and just world, but the economic depression of the 1920s destroyed such hopes. Many Europeans took their frustration out on the Jews, especially in Germany, where Nazi Party leader Adolph Hitler called for the removal of all "non-Aryan" ethnic groups. Hitler's vision of a German "master race" appealed to a people devastated by economic hardship, and following his rise to power, Hitler proceeded to remove people he determined to be "inferior,
                    " such as Jews, Slavs, Gypsies, and the disabled, from German society.Dachau, the first German concentration camp, opened in March 1933, as a prison for political dissidents, homosexuals, Jehovah's Witnesses, and prominent Jews. The government ordered a boycott of Jewish businesses, and banned the works of Jewish musicians, artists, scientists, writers, and entertainers. Jews were driven from their homes, and German children were indoctrinated with anti-Semitic propaganda. Germany hosted the 1936 Summer Olympic Games, which Hitler saw as an opportunity to demonstrate the superiority of his "master race." He was proven wrong, however, when African American Jesse Owens won four gold medals.In 1938, thirty-two nations discussed the possibility of offering asylum to German refugees, but none would expand their immigration quotas to accommodate them. Later that year, Jewish communities were devastated as Hitler's Storm Troopers committed acts of vandalism, rape, and violence as retribution for the assassination of a German diplomat by a Polish Jew. As Germany expanded its borders into Austria and Czechoslovakia, more Jews became victims of Hitler's oppression, yet no other nation offered them asylum.In 1939, a ship loaded with Jewish refugees sailed to Cuba, then to the United States, but neither country allowed the passengers entry, and they were returned to Germany. Following the invasion of Poland in September 1939, the Jewish population was quarantined in ghettos. Meanwhile, the Hitler regime ordered the execution of 70,000 disabled Germans for being "unfit to live."With World War II underway, Germany invaded the neutral nations of Holland, Belgium, and Luxembourg, followed by their occupation of France, which placed 500,000 more Jews under Nazi rule. However, the persecution of Jews and other minorities was often delegated to citizens of occupied nations, with few offering aid to the victims.In 1941, Germany invaded its former ally, the Union of Soviet Socialist Republics (USSR). As the Nazis advanced eastward, task forces, called "einsatzgruppen,
                    " massacred Jewish villagers, disposing of the bodies in mass graves. Although many Jews resisted, many more succumbed, either because they were weak from starvation, unarmed, unwilling to abandon their children and elderly relatives, or could find no refuge. In the course of 15 months, einsatzgruppen killed one million Jews, yet the German government sought a more efficient system.The first "death camp" opened late in 1941, and in January 1942, fifteen German officials held a summit to determine methodology. They planned to separate the prisoners by gender and place them in labor details, where most would likely die through "natural reduction." The survivors would then be executed to prevent re-population. Euphemisms were created to assure prisoners that they were not in danger: "deportation" became "resettlement"; "selection for death" became "special treatment"; "gas chamber" became "shower." News of the camps received little attention from Germany's enemies, and in October 1943, as Jews were deported from Rome, Italy, Pope Pius XII made no public protest.As the western allies invaded Europe, they ignored pleas from Jewish leaders to bomb the gas chambers, choosing instead to destroy nearby factories. A Hungarian survivor recalls the efforts of Swedish diplomat Raoul Wallenberg, who rescued 30,000 Jews bound for the Auschwitz death camp, by allowing them entrance to Sweden.Leon Kahn, a Polish Jew who witnessed the slaughter of several family members, discusses the dilemma he faced when his mother refused to escape their village. Aware that she would likely die in a concentration camp, Mrs. Kahn still insisted on staying with her elderly mother. She absolved Leon of any responsibility and allowed him to escape to safety, but he still regrets his decision.The few remaining residents of the ghetto in Warsaw, Poland, staged an armed revolt during the spring of 1944, though none survived. A young Auschwitz inmate named Roza Robota smuggled explosives to a resistance group inside the camp. The group sabotaged a crematorium, killing five German officers and freeing several prisoners. Roza was later tortured and executed, but never betrayed her comrades. As Soviet troops approached Auschwitz, prisoners were transported to other camps. Among them was author Anne Frank, who later died at Bergen-Belsen.When the Ohrdruf camp was liberated by American troops in April 1945, General Dwight Eisenhower was so horrified, he invited twelve leaders of Congress and twelve prominent newspaper editors to witness the carnage. British reporter Richard Dimbleby described the open graves and decaying bodies to radio audiences in England. Despite German efforts to conceal the genocide, the liberating armies found numerous artifacts left behind by the victims, such as luggage, clothing, eyeglasses, and toys. Thousands of Nazis were arrested at the end of the war, but none took responsibility for the Holocaust, nor did any of the religious leaders or heads of state who might have been able to stop it.In the final scene, at the Western Wall in Jerusalem, Simon Wiesenthal places a note in a crevice between two stones, which reads, "I am my brother's keeper." ",
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjA0NjU5MzE1MF5BMl5BanBnXkFtZTcwOTE4ODM4Mg@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "35513",
                "_score": 18.498657,
                "_source": {
                    "title": "Hitler's Children",
                    "rating": 7.4,
                    "year": 2011,
                    "directors": [
                        "Chanoch Ze'evi"
                    ],
                    "actors": [
                        "Bettina Göring",
                        "Katrin Himmler",
                        "Monika Hertwig",
                        "Rainer Höß",
                        "Eldad Beck",
                        "Niklas Frank",
                        "Yael Bedarshi",
                        "Adi Piper",
                        "Samuel West"
                    ],
                    "genres": [
                        "Documentary",
                        "History"
                    ],
                    "country": "Israel",
                    "languages": [
                        "German",
                        "English",
                        "Hebrew"
                    ],
                    "runtime": 59,
                    "summary": [
                        "A look into the lives of the descendants of the top Nazi officials who worked under Hitler's command.",
                        "Bettina Göring is the great-niece of Nazi official Hermann Göring. Katrin Himmler is the great-niece of Heinrich Himmler, second in command of the Nazi Party under Adolf Hitler. Rainer Höß is the grandson of Rudolf Hoess, creator and commandant of the Auschwitz Concentration Camp. Niklas Frank is the son of Hans Frank, Polish Governor-General during WWII, he who was responsible for the ghettos and concentration camps in Nazi occupied Poland. Monika Hertwig is the daughter of Amon Goeth, commandant of the Plaszów Concentration Camp. None with Nazi leanings, the five talk individually about what it is like to carry a name associated with the Nazi Party, being a blood relative to someone associated with hate and murder, being German at a time when that in and of itself was seen as being associated with Naziism, dealing with their family regardless of their allegiance to the Nazi Party, and if they feel any guilt associated with the actions of their infamous ancestor. In addition to these musings, Hoess and journalist Eldad Beck - a third generation Holocaust survivor - travel back to Auschwitz to revisit their shared ancestral past. And Frank tells in his writings and in public speaking engagements, most to school aged children, of his past of being the direct beneficiary to many of the Nazi Party's favors which in turn is partly the reason he denounces his parents. —Huggo",
                        "Hitler's Children is a film about the descendants of the most powerful figures in the Nazi regime; men and women who were left a legacy that permanently associates them with one of the greatest crimes in history. What is it like for them to have grown up with a name that immediately raises images of murder and genocide? Sons and daughters of notorious Nazis share how they deal with the fact that they bear the genetics of some of the worst criminals of the modern era."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMjAwMTY0MDQ4NF5BMl5BanBnXkFtZTgwODk3OTU0MDE@._V1_SY150_CR3,0,101,150_.jpg"
                }
            },
            {
                "_index": "imdb",
                "_type": "_doc",
                "_id": "33449",
                "_score": 18.369053,
                "_source": {
                    "title": "Perdidos en la nieve",
                    "rating": 7.1,
                    "year": 2012,
                    "directors": [
                        "Petter Næss"
                    ],
                    "writers": [
                        "Ole Meldgaard",
                        "Dave Mango",
                        "Petter Næss"
                    ],
                    "actors": [
                        "Florian Lukas",
                        "David Kross",
                        "Stig Henrik Hoff",
                        "Lachlan Nieboer",
                        "Rupert Grint",
                        "Kim Haugen",
                        "Knut Joner",
                        "Morten Faldaas",
                        "Sondre Krogtoft Larsen"
                    ],
                    "genres": [
                        "Action",
                        "Biography",
                        "Drama",
                        "History",
                        "War"
                    ],
                    "country": "Norway",
                    "languages": [
                        "English",
                        "Norwegian",
                        "German"
                    ],
                    "runtime": 104,
                    "summary": [
                        "Norway, WWII: A group of British and German soldiers find themselves stranded in the wilderness after an aircraft battle. Finding shelter in the same cabin, they realize the only way to survive the winter is to place the rules of war aside.",
                        "In World War II, the German pilots Lieutenant Horst Schopis, Josef Schwartz and Wolfgang Strunk crash their airplane in the wilderness of Norway after shooting down a British airplane. They walk through a snow storm until they reach shelter in an abandoned hunter cabin. Soon the British pilot Captain Charles P. Davenport and the gunner Robert Smith arrive in the cabin and they become prisoners of the German pilots. However, after the initial friction between the enemies, they realize that they should team-up to survive in the wilderness in the beginning of an improbable friendship. —Claudio Carvalho, Rio de Janeiro, Brazil",
                        "At the beginning of World War II, a hostile chance encounter in the skies above the harsh Norwegian wilderness leaves two aircraft - one British, one German - shot down in a remote and isolated region. By strange coincidence the crews seek shelter in the same cabin. They must battle to survive the brutal winter in order to get back to the war - and to fighting one another. Although war has made them enemies, as the days go by animosity proves hard to maintain. Mutual need leads to unlikely friendships, and the rules of war must be put aside. —Magnolia Pictures",
                        "High above the harsh Norwegian wilderness, English and German pilots shoot each other to the ground after a violent chance encounter. Isolated, they must fight to survive the brutal winter. Though war has made them enemies, antagonism is hard to maintain as days go by. Through mutual need, unlikely friendships bloom. Somehow, they become comrades."
                    ],
                    "poster": "https://m.media-amazon.com/images/M/MV5BMTM5MDgzMTAyMV5BMl5BanBnXkFtZTcwODA5MzUwOQ@@._V1_SY150_CR0,0,101,150_.jpg"
                }
            }
        ]
    }
}