{"index": {"_index": "imdb", "_type": "film", "_id": 0}}
{"title": "My Boy", "year": 1921, "director": ["Albert Austin", "Victor Heerman"], "writers": ["Max Abramson", "Victor Heerman", "Shirley Vance Martin"], "actors": ["Mathilde Brundage", "Claude Gillingwater", "Jackie Coogan", "Frank Hayes", "Patsy Marks"], "genres": ["Comedy", "Drama"], "country": "United States", "lenguages": ["None", "English"], "runtime": "55 min", "summary": ["An orphan escapes immigration officials at Ellis Island and goes to live with an old ship's master who can't find work and can't pay the rent.", "Jackie Blair's father was killed in France. His mother died traveling in steerage. This leaves little Jackie Blair alone when he appears at Ellis Island, and the immigration officials want to send him right back. Captain Bill appears on the scene asking for a job - but he's too old and no one wants him. He sees lonely little Jackie, pities him and asks the eight Pinkosuwitz children to include him in their games. Thus, the Captain unwittingly engineers Jackie's escape. The orphan is mixed in with the Pinkosuwitzes when they leave the immigration building. When they find they've gained a ninth child, they send him on his way. This leaves Jackie to follow Captain Bill back to his very modest home - for which the old salt is unable to pay the rent. Jackie tries to make himself useful. He even sings and dances with an organ grinder to make money for the Captain's medicine. Little does either guess that Jackie's wealthy grandmother has everyone in immigration looking for the boy. When Jackie turns up at the matron's party for unfortunate children, he may be reunited with her. Or he may go to jail when he's suspected of stealing her hand-bag.\n\n—J. Spurlin"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 1}}
{"title": "Las 3 luces", "year": 1921, "director": ["Fritz Lang"], "writers": ["Fritz Lang", "Thea von Harbou"], "actors": ["Bernhard Goetzke", "Lil Dagover", "Walter Janssen", "Hans Sternberg", "Karl Rückert", "Max Adalbert", "Wilhelm Diegelmann", "Erich Pabst", "Karl Platen", "Hermann Picha", "Paul Rehkopf", "Max Pfeiffer", "Georg John", "Lydia Potechina", "Grete Berger", "Eduard von Winterstein", "Erika Unruh", "Rudolf Klein-Rogge", "Lothar Müthel", "Edgar Pauly", "Louis Brody", "Károly Huszár", "Paul Biensfeldt", "Paul Neumann", "Hellmuth Hiemstra", "Edgar Klitzsch", "Loisia Lehnert", "Neumann-Schüler", "Lina Paulsen", "Ernst Rückert", "Hermann Vallentin", "Marie Wismar"], "genres": ["Drama", "Fantasy", "Horror", "Thriller"], "country": "Germany", "lenguages": ["German"], "runtime": "97 min", "summary": ["When a woman's fiancé disappears, Death gives her three chances to save him from his fate.", "As a young couple stops and rests in a small village inn, the man is abducted by Death and is sequestered behind a huge doorless, windowless wall. The woman finds a mystic entrance and is met by Death, who tells her three separate stories set in exotic locales, all involving circumstances similar to hers. In each story, a woman, trying to save her lover from his ultimate tragic fate, fails. The young lady realizes the meaning of the tales and takes the only step she can to reunite herself with her lover.\n\n—Doug Sederberg <vornoff@sonic.net>", "In a small village somewhere in time, a stranger lease for ninety-nine years a field annex to the cemetery and surround it with a very high wall without gate. When a young couple of travelers stop in a local tavern for resting, the fiancé vanishes and her fiancée seeks him and meets his spirit entering through the wall. She finds an entrance and finds that the stranger is actually Death, who is tired of bringing suffering to the world. She begs for the life of her beloved fiancé, and Death proposes her to save one of three lives that are in the end. If she succeeds, Death will bring her lover back to live. The lady becomes a woman in Persia, in Venice and in China, and in all situations she fails to save her respective lover. Death gives her one last chance, if she manages to find within one hour a person in the village that could give up living. When the local hospital is burning in fire, the young woman realizes the only way to stay with her lover.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 2}}
{"title": "Never Weaken", "year": 1921, "director": ["Fred C. Newmeyer"], "writers": ["Hal Roach", "Sam Taylor", "H.M. Walker"], "actors": ["Harold Lloyd", "Mildred Davis", "Roy Brooks", "Mark Jones", "Charles Stevenson", "William Gillespie", "Helen Gilmore", "Wally Howe", "Gaylord Lloyd", "Robert Emmett O'Connor", "George Rowe", "Molly Thompson", "Tiny Ward", "Joseph White", "Vera White"], "genres": ["Short", "Comedy", "Thriller"], "country": "United States", "lenguages": ["None"], "runtime": "19 min", "summary": ["A man hits the streets with a scheme to keep his fiancé from losing her job, however, things quickly go from bad to worse.", "The Boy (Harold Lloyd) is infatuated with The Girl (Mildred Davis) in the next office. In order to drum up business for her boss, an osteopath, he gets an acrobatic and tumbling acquaintance from a nearby office to pretend to sustain injuries that The Boy \"cures\", thereby building a reputation and then hands out the doctor's business cards. When he mistakenly thinks that his girl is marrying another, he decides to commit suicide and spends the bulk of the film in thrilling, failed attempts.\n\n—Herman Seifer <alagain@aol.com>", "Working in different offices in the same commercial high-rise building, twenty-one year old Harold and eighteen year old Mildred more often think about being together than they do about their work. They being close to each other on a day-to-day basis is threatened when her boss, osteopathic specialist Dr. Frank Gary, says she will have to find another position due to a lack of patients. To save his romance, Harold goes on a quest to drum up patients for the doctor on the street below their building by any means possible. Harold's efforts have some unintended consequences which may threaten his relationship with Mildred (or so he mistakenly believes), which lead him to other drastic actions.\n\n—Huggo"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 3}}
{"title": "Now or Never", "year": 1921, "director": ["Fred C. Newmeyer", "Hal Roach"], "writers": ["H.M. Walker", "Sam Taylor"], "actors": ["Harold Lloyd", "Mildred Davis", "Anna Mae Bilson", "Roy Brooks", "Sammy Brooks", "William Gillespie", "Wally Howe", "Mark Jones", "Gaylord Lloyd", "Earl Mohan", "Charles Stevenson", "Noah Young"], "genres": ["Comedy", "Short"], "country": "United States", "lenguages": ["None", "English"], "runtime": "35 min", "summary": ["A young man, unaccustomed to children, must accompany a young girl on a train trip.", "Mary is a nanny to an infant girl named Dolly, neglected by her parents in their own self-absorbed lives. Mary is scheduled to go on vacation, she going home to meet her childhood sweetheart, his childhood promise to her to meet her on her eighteenth birthday, which is upcoming. However, feeling Dolly will be all alone, Mary decides to take Dolly with her, Mary not having asked her parents' permission in their neglect. Mary meets her beau on the train to their hometown, unaware of the trials he has had to make it this far, he on board the train without a ticket or money which he lost en route. Mary also sees Dolly's father on board, he who is off to a business meeting. Not wanting to let Dolly's father see Dolly on board the train with her, Mary leaves Dolly with her beau while she spends time with the father. The beau's inexperience with child caring and his attempts to evade the train conductor who is checking for tickets leads to one misadventure after another for the beau and Dolly on the train.\n\n—Huggo", "Mary is looking after a young child whose parents have little time for her. So, when Mary travels home to meet her childhood sweetheart, she takes the child with her. Meanwhile, her boyfriend has a mishap on the road, and is tricked out of his money by a tramp. When the tramp then hitches a ride on a train, the boyfriend does so as well. At the station, he meets Mary and the child, and they plan to re-board the train together. But difficulties arise when Mary sees her boss boarding the same train - and there is also the problem that her boyfriend doesn't have a ticket.\n\n—Snow Leopard"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 4}}
{"title": "Las dos huérfanas", "year": 1921, "director": ["D.W. Griffith"], "writers": ["Adolphe d'Ennery", "Eugène Cormon", "D.W. Griffith"], "actors": ["Lillian Gish", "Dorothy Gish", "Joseph Schildkraut", "Frank Losee", "Katherine Emmet", "Morgan Wallace", "Lucille La Verne", "Sheldon Lewis", "Frank Puglia", "Creighton Hale", "Monte Blue", "Sidney Herbert", "Lee Kohlmar", "Marcia Harris", "Adolph Lestina", "Kate Bruce", "Flora Finch", "Louis Wolheim", "Kenny Delmar", "James Smith", "Herbert Sutch", "Rose Smith", "Leslie King", "William J. Walsh", "Nellie Battipaglia", "Ruth Cleaver", "Tove Danor", "Fay Marbe", "Dorothy McConnell", "Frank O'Connor", "Jill Rainsford", "Frances Robinson", "Rita Rogan", "William Welsh"], "genres": ["Drama", "History", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "150 min", "summary": ["Two orphaned sisters are caught up in the turmoil of the French Revolution, encountering misery and love along the way.", "Henriette and Louise, a foundling, are raised together as sisters. When Louise goes blind, Henriette swears to take care of her forever. They go to Paris to see if Louise's blindness can be cured, but are separated when an aristocrat lusts after Henriette and abducts her. Only Chevalier de Vaudrey is kind to her, and they fall in love. The French Revolution replaces the corrupt Aristocracy with the equally corrupt Robespierre. De Vaudrey, who has always been good to peasants, is condemned to death for being an aristocrat, and Henriette for harboring him. Will revolutionary hero Danton, the only voice for mercy in the new regime, be able to save them from the guillotine?\n\n—John Oswalt <jao@jao.com>", "The epic tale of two step-sisters, Henriette and Louise Girard, caught up in the storm of the French Revolution. Louise, the child of an aristocrat, was abandoned on the cathedral steps where Henriette's father found her and took her home to raise as their own. After Louise goes blind, Henriette takes her to Paris where she hopes her sight can be restored. They are separated however, with Louise taken in by an old hag who forces her to beg on the street. Henriette has met the handsome Chevalier de Vaudrey who, although an aristocrat, is kind and cares about his fellow man. With the advent of the revolution, both Henriette and de Vaudrey are sentenced to the guillotine and it left to Danton to plead their case.\n\n—garykmcd", "In the Eighteenth Century in France, a few years before the French Revolution, the Countess de Linieres asks her minion to deliver her baby daughter Louise to an orphanage to protect her. However he leaves the baby on the stairs of a church. A peasant finds Louise and brings her home to his wife and they find a necklace with her name and money in the basket. They raise Louise with their daughter Henriette as sisters, but years later there is a plague and they die and Louise becomes blind. Louise Girard is totally dependent on Henriette Girard and they travel to Paris expecting to find the cure of Louise's blindness. The rogue Marquis de Praille sees Henriette and becomes fascinated with her virginal beauty. He asks his men to abduct Henriette and brings her to his party. Louise is left alone in Paris and the scoundrel Mother Frochard forces Louise to beg on the streets for her. Meanwhile the noble aristocrat Chevalier de Vaudrey saves Henriette and they fall in love with each other. But Henriette explains that she had promised Louise that she would not marry until Louise could look upon her husband to approve him. Meanwhile Danton, who is saved by Henriette, and Robespierre are plotting the French Revolution that explodes on the streets keeping the sisters apart.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 5}}
{"title": "El rostropálido", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Edward F. Cline", "Buster Keaton"], "actors": ["Buster Keaton", "Virginia Fox", "Joe Roberts"], "genres": ["Short", "Comedy", "Western"], "country": "United States", "lenguages": ["None", "English"], "runtime": "20 min", "summary": ["Buster helps a Native American tribe save their land from greedy oil barons.", "Evil oil barons have given the Indians one day to vacate their land. The Indian chief tells his braves to kill the first white man they see. Buster shows up chasing a butterfly. Later he keeps moving the stake to which he is tied and at which he is to be burned. He becomes one of the tribe and helps them with their fight.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "Unscrupulous financial speculators and ruthless oil sharks have set their money-grubbing sights on a small patch of Indians' land, and they are willing to do anything to succeed--including stealing the tribe's deed for the territory. As a result, an urgent ultimatum to vacate the area will only infuriate the Great Indian Chief who swears to kill the first paleface who dares to pass through their gate. Of course, the first white man who sets his foot on their campsite is none other than Buster, the avid but utterly unsuspecting lepidopterist. But, is this the end of the innocent entomologist?\n\n—Nick Riganas"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 6}}
{"title": "El gran espectáculo", "year": 1921, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Buster Keaton", "Edward F. Cline"], "actors": ["Buster Keaton", "Edward F. Cline", "Monte Collins", "Virginia Fox", "Joe Murphy", "Joe Roberts", "Jess Weldon", "Ford West"], "genres": ["Short", "Comedy", "Fantasy"], "country": "United States", "lenguages": ["None"], "runtime": "23 min", "summary": ["After waking up from his wacky dream, a theater stage hand inadvertently causes havoc everywhere he works.", "Portraying more than twenty characters at once--including lively stage actors, an attentive audience, an orchestra, and an entire nine-member minstrel act--Buster Keaton pushes the boundaries of technical artistry and film trickery, in a time when effects really were special. With this in mind--after waking up from a delightful vaudeville dream sequence--Buster realises that he still is the play house's humble general factotum, and he must keep the show up and running amid delusion and disorder, identical twin sisters, Zouave guards, and a rampant orangutan on the loose. But, can a mere gopher yearn for recognition, and perhaps, love?\n\n—Nick Riganas", "A spectator goes to buy a ticket, looking for money in a multi-pocket wallet. Keaton himself directs an orchestra of himself. The name of Buster Keaton is on every role of the list. Also the different actors of the theatrical performance are always him. While he has to dress a monkey, he escapes and he disguises himself as a monkey, going on stage. Later, Keaton always goes to free an acrobat enclosed in a container of water with a cup. After, he breaks the container and the water falls on the public. To escape the artistic director, he swims in the orchestral hole as if he were at sea, rowing with his instruments.\n\n—luigicavaliere"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 7}}
{"title": "Sapho", "year": 1921, "director": ["Dimitri Buchowetzki"], "writers": ["Dimitri Buchowetzki", "Alexandre Dumas"], "actors": ["Pola Negri", "Johannes Riemann", "Alfred Abel", "Albert Steinrück", "Helga Molander", "Otto Treptow", "Elsa Wagner", "Ellinor Gynt"], "genres": ["Drama"], "country": "Germany", "lenguages": ["None"], "runtime": "82 min", "summary": ["Richard De La Croix has a brother, Andreas, who has been driven insane by a notorious vamp and socialite named Sappho. A man-about-town named Teddy takes Richard to the Odeon to meet her, but when Sappho actually meets Richard, he is unaware that she is the woman who drove Andreas insane.\n\n—Ulf Kjell Gür"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 8}}
{"title": "El castillo Vogeloed", "year": 1921, "director": ["F.W. Murnau"], "writers": ["Rudolf Stratz", "Carl Mayer"], "actors": ["Arnold Korff", "Lulu Kyser-Korff", "Lothar Mehnert", "Paul Hartmann", "Paul Bildt", "Olga Tschechowa", "Victor Bluetner", "Hermann Vallentin", "Julius Falkenstein", "Robert Leffler", "Walter Kurt Kuhle", "Loni Nest", "Ursula Nest", "Georg Zawatzky"], "genres": ["Crime", "Drama", "Mystery"], "country": "Germany", "lenguages": ["German"], "runtime": "75 min", "summary": ["In the castle Vogeloed, a few aristocrats are awaiting baroness Safferstätt. But first count Oetsch invites himself.. Everyone thinks he murdered his brother, baroness Safferstat's first husband, three years ago. So he is rather undesirable. But Oetsch stays; arguing he is not the murderer and will find the real one...\n\n—Yepok", "The sinister Count Oetsch scandalizes the aristocratic social gathering at Castle Vogelod as he announces his intention to \"crash\" the festivities. Baroness Safferstätt is expected shortly, and the guests are well-aware of the rumors that Count Oetsch murdered the baroness' late husband. Oetsch refuses to leave, vowing that he will reveal the identity of the real killer. Before the weekend is through, the Count and Baroness will reveal secrets too shocking to be believed!\n\n—yusufpiskin"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 9}}
{"title": "El caíd", "year": 1921, "director": ["George Melford"], "writers": ["Edith Maude Hull", "Monte M. Katterjohn"], "actors": ["Rudolph Valentino", "Agnes Ayres", "Ruth Miller", "George Waggner", "Frank Butler", "Charles Brinley", "Lucien Littlefield", "Adolphe Menjou", "Walter Long", "Sally Blane", "Earl Gordon Bostwick", "Sidney Bracey", "Rafael Negrete", "Natacha Rambova", "Loretta Young", "Polly Ann Young"], "genres": ["Adventure", "Drama", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "86 min", "summary": ["A charming Arabian sheik becomes infatuated with an adventurous, modern-thinking Englishwoman and abducts her to his home in the Saharan desert.", "Sheik Ahmed (Valentino) desperately desires fiesty British socialite Diana (Ayres), so he abducts her and carries her off to his luxurious desert tent-palace. The free-spirited Diana recoils from his passionate embraces and yearns to be released. Only after being kidnapped by desert bandits does Diana realize how much she has grown to love Ahmed, who comes to her rescue in the nick of time.\n\n—E. Beck", "British Lady Diana Mayo is an independent woman who will have no man tell her what she can or cannot do. She is in Biskra, Algeria where she plans on embarking on a month long trip into the desert by herself with only a guide. In Biskra, a tribal leader, western educated Sheik Ahmed Ben Hassan, becomes enthralled with the vision of Lady Diana. With the assistance of her guide, Sheik Ahmed is able to abduct Lady Diana as she embarks on her desert tour. The Sheik brings her to his desert oasis compound, where he is sure she will ultimately fall in love with him as he has with her. Lady Diana is not used to taking orders from anyone, let alone someone who has abducted her, especially as his orders make her feel humiliated, such as wearing Arab garb, and being treated as a subservient Arab woman especially in front of a visiting \"western\" friend from Paris, Raoul de Saint Hubert. As the Sheik begins to know Lady Diana and upon consultation with Raoul, he begins to trust her to act and be herself without his rules. Slowly, Lady Diana does begin to fall in love with Sheik Ahmed. But acknowledgment of her true feelings may come too late as a rival sheik name Omair may have his own designs on Diana.\n\n—Huggo"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 10}}
{"title": "Los tres mosqueteros", "year": 1921, "director": ["Fred Niblo"], "writers": ["Alexandre Dumas", "Edward Knoblock", "Lotta Woods", "Douglas Fairbanks"], "actors": ["Douglas Fairbanks", "Nigel De Brulier", "George Siegmann", "Eugene Pallette", "Adolphe Menjou", "Mary MacLaren", "Thomas Holding", "Marguerite De La Motte", "Willis Robards", "Boyd Irwin", "Barbara La Marr", "Lon Poff", "Léon Bary", "Walt Whitman", "Sidney Franklin", "Charles Belcher", "Charles Stevens", "Janet Chandler", "Jean de Limur", "Dorothy Dorr", "Douglas Fairbanks Jr.", "Granville Redmond"], "genres": ["Action", "Adventure", "Family", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "119 min", "summary": ["Cardinal Richelieu, engaged in intrigue at the court of Louis XIII, attempts to rule by threatening the queen, who is secretly in love with the Duke of Buckingham. From Gascony comes D'Artagnan to join the King's Musketeers in his quest for adventure. He wins the right to membership by proving his prowess with the sword and forms an eternal alliance with Athos, Porthos, and Aramis, the Three Musketeers. After many adventures, he embarks on a dangerous mission to England to recover a diamond brooch, a gift of the king, which the queen has given to Buckingham as a token of affection. He recovers it and returns in time to save the queen from the wrath of Louis, defeat the cardinal's intrigue, and win Constance, the queen's seamstress.", "The young Gascon D'Artagnan arrives in Paris, his heart set on joining the king's Musketeers. He is taken under the wings of three of the most respected and feared Musketeers, Porthos, Aramis, and Athos. Together they fight to save France and the honor of a lady from the machinations of the powerful Cardinal Richelieu.\n\n—Jim Beaver <jumblejim@prodigy.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 11}}
{"title": "Los tres mosqueteros", "year": 1921, "director": ["Fred Niblo"], "writers": ["Alexandre Dumas", "Edward Knoblock", "Lotta Woods", "Douglas Fairbanks"], "actors": ["Douglas Fairbanks", "Nigel De Brulier", "George Siegmann", "Eugene Pallette", "Adolphe Menjou", "Mary MacLaren", "Thomas Holding", "Marguerite De La Motte", "Willis Robards", "Boyd Irwin", "Barbara La Marr", "Lon Poff", "Léon Bary", "Walt Whitman", "Sidney Franklin", "Charles Belcher", "Charles Stevens", "Janet Chandler", "Jean de Limur", "Dorothy Dorr", "Douglas Fairbanks Jr.", "Granville Redmond"], "genres": ["Action", "Adventure", "Family", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "119 min", "summary": ["Cardinal Richelieu, engaged in intrigue at the court of Louis XIII, attempts to rule by threatening the queen, who is secretly in love with the Duke of Buckingham. From Gascony comes D'Artagnan to join the King's Musketeers in his quest for adventure. He wins the right to membership by proving his prowess with the sword and forms an eternal alliance with Athos, Porthos, and Aramis, the Three Musketeers. After many adventures, he embarks on a dangerous mission to England to recover a diamond brooch, a gift of the king, which the queen has given to Buckingham as a token of affection. He recovers it and returns in time to save the queen from the wrath of Louis, defeat the cardinal's intrigue, and win Constance, the queen's seamstress.", "The young Gascon D'Artagnan arrives in Paris, his heart set on joining the king's Musketeers. He is taken under the wings of three of the most respected and feared Musketeers, Porthos, Aramis, and Athos. Together they fight to save France and the honor of a lady from the machinations of the powerful Cardinal Richelieu.\n\n—Jim Beaver <jumblejim@prodigy.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 12}}
{"title": "David el duro", "year": 1921, "director": ["Henry King"], "writers": ["Joseph Hergesheimer", "Edmund Goulding", "Henry King"], "actors": ["Richard Barthelmess", "Gladys Hulette", "Walter P. Lewis", "Ernest Torrence", "Ralph Yearsley", "Forrest Robinson", "Laurence Eddinger", "Edmund Gurney", "Warner Richmond", "Marion Abbott", "Henry Hallam", "Patterson Dial", "Lassie"], "genres": ["Drama"], "country": "United States", "lenguages": ["None"], "runtime": "99 min", "sinopsis": "\nWhen three thuggish men are responsible for the death of his father and the crippling of his brother, young David must choose between supporting his family or risking his life and exacting vengeance.\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 13}}
{"title": "The Adventures of Robinson Crusoe", "year": 1922, "director": ["Robert F. Hill"], "writers": ["Emma Bell Clifton", "Daniel Defoe"], "actors": ["Harry Myers", "Noble Johnson", "Gertrude Olmstead", "Scott Pembroke", "Aaron Edwards", "Josef Swickard", "Gertrude Claire", "Emmett King", "Margaret Livingston"], "genres": ["Adventure"], "country": "United States", "lenguages": ["None", "English"], "runtime": "360 min", "summary": ["A man struggles to survive after being shipwrecked on a deserted island."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 14}}
{"title": "Más fuertes que su amor", "year": 1922, "director": ["Sam Wood"], "writers": ["Elinor Glyn", "Jack Cunningham"], "actors": ["Gloria Swanson", "Rudolph Valentino", "Edythe Chapman", "Alec B. Francis", "Robert Bolder", "Gertrude Astor", "June Elvidge", "Mabel Van Buren", "Helen Dunbar", "Raymond Blathwayt", "Frank Butler", "Gino Corrado", "Mary Foy", "Lucien Littlefield", "Larry Steers", "Adele Watson", "Leo White"], "genres": ["Drama", "Romance"], "country": "United States", "lenguages": ["None"], "runtime": "80 min", "summary": ["A young woman marries an older millionaire and then falls in love with a handsome nobleman on her honeymoon.", "Love, duty, and the scent of narcissus. Theodora, a penniless young aristocrat, marries a much-older man, self-made millionaire grocer Josiah Brown, so that her father and spinster sisters can live comfortably. Soon after the wedding, she finds herself falling in love with Hector, the 10th Earl of Bracondale, a playboy she encounters on the social circuit of the very rich--in the Swiss Alps, Paris, London, and the English countryside. Hector is attracted to her as well. Theodora must choose between love and duty, then Josiah and Hector must make their own choices.\n\n—<jhailey@hotmail.com>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 15}}
{"title": "El herrero", "year": 1922, "director": ["Buster Keaton", "Malcolm St. Clair"], "writers": ["Buster Keaton", "Malcolm St. Clair"], "actors": ["Buster Keaton", "Virginia Fox", "Joe Roberts"], "genres": ["Comedy", "Short"], "country": "United States", "lenguages": ["None", "English"], "runtime": "21 min", "summary": ["Buster Keaton shoes horses and repairs cars, with mixed results.", "Buster clowns around in a blacksmith's shop until he and the smithy get in a fight which sends the smithy to jail. Buster helps several customers with horses, then destroys a Rolls Royce while fixing the car parked next to it.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "Left all alone to run the dark but well-equipped smithy after an intense fight with his irate boss, Buster--an utterly inept blacksmith apprentice--receives his first customer: the proud white mare of the upper-class noblewoman, Virginia. Of course, today of all days, this is the busiest day of the week, and before long, another hurried customer--the affluent but obnoxious owner of a gleaming Rolls-Royce in pristine condition--arrives for a minor repair. What delightful catastrophes await?\n\n—Nick Riganas"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 16}}
{"title": "La mudanza", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Buster Keaton", "Edward F. Cline"], "actors": ["Buster Keaton", "Edward F. Cline", "Virginia Fox", "Steve Murphy", "Joe Roberts"], "genres": ["Short", "Comedy", "Family"], "country": "United States", "lenguages": ["None", "English"], "runtime": "18 min", "sinopsis": "\nAs the film opens, Buster is speaking with a young woman. She rejects him because he is not wealthy, and states he must become a business man to win her.As he walks down the street, Buster sees a large man who has dropped his wallet. He returns the wallet. Buster and the man stumble over each other, and in the process the wallet falls out. Buster picks it up - it contains a large amount of cash. The man realizes the money is missing, and goes back to get his wallet. Buster has lifted the money, and gives the man the wallet. He returns to try and get his money back; gets out of his car, and Buster gets in and drives away.Buster then gets out of the car, where a family is waiting for a moving company to take their possessions. A con artist convinces Buster that the possessions are his and he is being evicted, but will sell the things to Buster. Buster buys them, then buys a horse to take them away.The family, believing Buster to be the moving man, loads their possessions on his cart, and tells him to take them to their new address. Buster, believing he has bought the items, ignores the instructions.He travels down the street in the horse drawn cart, having an encounter with a nasty dog, which leads him to attach a boxing glove on a stick to his cart. The boxing glove knocks down a traffic cop at an intersection -- twice, coming and going.Buster then has several problems with the horse. Meanwhile, the family is wondering what happened to the furniture and other belongings.The film cuts to a police parade in a major city. Buster accidentally finds himself in the middle of the parade, which is being viewed by the mayor and his daughter.\nA bomb-wielding anarchist throws said bomb into Buster's cart. He uses it to light a cigarette and then tosses it away. When the smoke clears, dazed and confused cops are wandering about and chaos reigns.The rest of the film is an extended chase, in which hundreds of police officers chase after Buster and he escapes them in various ways. Stunts include Keaton balancing on a ladder as cops pull it from both sides.As the film closes, Buster manages to corral all of the police into the central police station. He escapes by disguising himself as a policeman. The girl from the start of the film sees him in the police uniform, and once again rejects him. A heartbroken Buster then surrenders to the cops.\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 17}}
{"title": "Sueños imposibles", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Roscoe 'Fatty' Arbuckle", "Edward F. Cline", "Buster Keaton", "Jeffrey Vance"], "actors": ["Buster Keaton", "Renée Adorée", "Edward F. Cline", "Joe Keaton", "Joe Roberts", "George Rowe"], "genres": ["Short", "Comedy"], "country": "United States", "lenguages": ["None", "English"], "runtime": "28 min", "summary": ["A sincere young man leaves his home to win his fortune so he can marry his home town sweetheart.", "Buster goes away to the city to prove to his girl's father he can succeed. He writes her of his various jobs which she glorifies in her imagination. She sees a surgeon, he is a vet's assistant; she sees him cleaning up on Wall Street, he's really a janitor.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "A young man proposes a young woman, but her father questions how he might support his daughter after the marriage. The youth informs that he will move to New York, find a job and marry the girl. If he fails, he would commit suicide. Once in the big city, he works in many professions and writes to his girlfriend; and his imaginative girl reads each letter and thinks in her beloved being successful on each trial.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 18}}
{"title": "Érase una vez", "year": 1922, "director": ["Carl Theodor Dreyer"], "writers": ["Holger Drachmann", "Carl Theodor Dreyer", "Palle Rosenkrantz"], "actors": ["Clara Pontoppidan", "Svend Methling", "Peter Jerndorff", "Hakon Ahnfelt-Rønne", "Mohamed Archer", "Bodil Faber", "Wilhelmine Henriksen", "Lili Lani", "Henry Larsen", "Frederik Leth", "Schiøler Linck", "Gerda Madsen", "Lars Madsen", "Torben Meyer", "Karen Poulsen", "Musse Scheel", "Emilie Walbom", "Viggo Wiehe", "Zun Zimmermann"], "genres": ["Drama", "Family", "Fantasy", "Romance"], "country": "Denmark", "lenguages": ["None"], "runtime": "75 min", "sinopsis": "\nOnce upon a time, in the kingdom of Illiria, lived a princess who was beautiful, but cruel. She had a fierce temper and would lash out whenever she was displeased. Those who sought her hand in marriage would frequently be condemned to death. Her father, the king, wished for her to marry, but he was powerless to control her.One day, the prince of Denmark comes seeking her hand in marriage. He tells her about the wonderful country comes from up north, but she is not persuaded. Since she is in a good mood, she does not have him killed, but simply sends him away.The prince is miserable. He wanders through the woods. A mystical figure decides to help him. He gives the prince a gift of a magic kettle that will show him the way to happiness. By breathing on the kettle, he can see his future. The prince does so and sees an himself in a domestic scene. The mystical figure vanishes, also leaving with the prince another gift, a noisemaker.The prince returns to Illiria and spies the princess dancing with her handmaidens. He attracts her attention with the noisemaker. The princess decides she must have it, but he will not part with it unless she pays the price - a kiss on her lips. She agrees to the deal, giving him a brief kiss and grabbing the noisemaker.The prince makes a bet with his fool that he will sleep that night in the princess's chamber. He then attracts her attention with his second magic object, the kettle. He tells the princess that the kettle will show the one who breaths on it who he or she will marry. The princess wants the magical kettle, too, but the price has gone up. She sends her handmaiden, who is told that he will part with the kettle only if the princess allows him to sleep in her chamber. At first, the princess refuses, but then the handmaiden returns with the key, warning the prince that, if he is caught, the princess will deny knowledge and he will be executed.That night, a messenger from the prince arrives by boat to ask the princess if she has changed her mind. She tells him that she will never allow the prince into her room.The fool, disguised as the prince, arrives at the castle, and is given entry by the king. He comes to the princess's chamber. The kettle shows her that the prince is the one she will marry. Angrily, she tells him that the kettle is wrong. She will execute him but, since a deal is a deal, she will allow him to sleep in the corner of her chamber.The fool informs the king that the prince has schemed to ruin the princess's reputation. Furthermore, he threatens that, if the king does not exile the princess, the prince's army will overrun the country. The king goes to his daughter's chamber and catches her there with whom she thinks is a beggar. Despite her protests, he exiles her with the beggar.They travel to the north, and he brings her to a shabby hut. He tells her she is free to go, but humbled, she decides to stay. Still, she refuses to do any work. She is still a princess. But here, this hut is his kingdom and, reluctantly, she obeys. As time passes, she becomes useful learning how to make pots which they go to sell in the market. On their way, they pass by a man hanging from a tree, a poacher who has been caught by the foresters. They meet a friend of the poacher, who asks the potter to help him. The potter sends the princess to the market by herself to sell the pots, warning her not to break any. On her way to the market, she is accosted by a group of foresters who overturn her cart and smash all the pots. She returns to the hut and shows the potter the cart of broken parts. He is angry. She tries to stop him from leaving by trying to tell him that she loves him, but she cannot quite get the words out. He goes into the woods to poach, and is pursued by the foresters back to the hut. She hides him and, finally, tells him that she loves him. They kiss.They fall upon hard times, and the potter tells his wife to go to the castle to beg for food. The scullery maid gives her food on condition that she make herself useful. The fool announces that the prince has returned, but the foreign princess he was to marry has fallen ill. He asks to find someone who will fit the wedding dress to stand in for the bride. Naturally, the dress fits only the potter's wife. She begs to be allowed to go home to her sick husband, but the prince demands she stay.The fool asks the scullery maid to marry him. She agrees.The prince says that he will marry her instead of the prince. She refuses and begs to home to her husband. He commands that he potter's hut be burned down. She offers her own life in exchange for the man she loves. He relents, but as she goes, he stops her with the same words she used. She realizes that he is the potter. They embrace. Her father, the king, arrives to see the happy couple.\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 19}}
{"title": "Doctor Jack", "year": 1922, "director": ["Fred C. Newmeyer", "Sam Taylor"], "writers": ["Hal Roach", "Sam Taylor", "Jean C. Havez", "H.M. Walker", "Thomas J. Crizer"], "actors": ["Harold Lloyd", "Mildred Davis", "John T. Prince", "Eric Mayne", "C. Norman Hammond", "Jackie Condon", "Mickey Daniels", "Richard Daniels", "William Gillespie", "Wally Howe", "James T. Kelley", "'Auntie' Mackay", "Florence Mayon", "Oscar Morgan", "Charles Stevenson", "Anna Townsend", "Dorothy Vernon", "Joy Winthrop"], "genres": ["Comedy", "Romance"], "country": "United States", "lenguages": ["None", "English"], "runtime": "60 min", "summary": ["Country Doctor, Jack Jackson is called in to treat the Sick-Little-Well-Girl, who has been making Dr. Saulsbourg and his sanitarium very rich, after years of unsuccessful treatment. Dr. Jack's old-fashioned methods do the trick, and the quack is sent packing.\n\n—Herman Seifer <alagain@aol.com>", "Dr. Ludwig von Saulsbourg is a big city physician whose primary goal is to bilk as much money out of his patients as possible. He has been treating a young woman for nearly four years, prescribing her complete rest, darkness, and medication, and, in the process, billing her father exorbitant amounts of money for his services. She is not getting any better, but worse, based on her declining mental state about her health. In reality, she is physically healthy. When the family lawyer, Jamison, advises her father to call in a consulting physician, Dr. von Saulsbourg retaliates by advising him to move her to his expensive sanitarium. The antithesis to Dr. von Saulsbourg is kindhearted Dr. Jackson - affectionately referred to as Dr. Jack by his patients - of small town Magnolia Meadows, who treats his patients with compassion and understanding. That understanding is knowing what truly ails his patients, which often is nothing physical or medical, and treating them without embarrassing them. When Dr. Jack is called in by Jamison as that consulting physician, he is initially unaware that this case is the young woman whom he met casually and fell in love with at first sight when she passed through Magnolia Meadows. Dr. Jack sees immediately that there is nothing physically wrong with her, and that a little excitement in her life is what is truly needed to rejuvenate her existence. What threatens Dr. Jack being able to help her is his feelings for her, which others may believe makes him an inappropriate person to treat her, and Dr. von Saulsbourg doing whatever he can to hang onto his meal ticket.\n\n—Huggo"]}
