{"index": {"_index": "imdb", "_type": "film", "_id": 0}}
{"title": "El doctor Mabuse", "year": 1922, "director": ["Fritz Lang"], "writers": ["Norbert Jacques", "Thea von Harbou", "Fritz Lang"], "actors": ["Rudolf Klein-Rogge", "Aud Egede-Nissen", "Gertrude Welcker", "Alfred Abel", "Bernhard Goetzke", "Paul Richter", "Robert Forster-Larrinaga", "Hans Adalbert Schlettow", "Georg John", "Károly Huszár", "Grete Berger", "Julius Falkenstein", "Lydia Potechina", "Julius E. Herrmann", "Max Adalbert", "Anita Berber", "Paul Biensfeldt", "Gustav Botz", "Julietta Brandt", "Lil Dagover", "Heinrich Gotho", "Leonhard Haskel", "Erner Huebsch", "Gottfried Huppertz", "Hans Junkermann", "Adolf Klein", "Erich Pabst", "Edgar Pauly", "Karl Platen", "Auguste Prasch-Grevenberg", "Adele Sandrock", "Willy Schmidt-Gentner", "Hans Sternberg", "Olaf Storm", "Oscar Stribolt", "Erich Walter"], "genres": ["Crime", "Mystery", "Thriller"], "country": "Germany", "lenguages": ["German", "English", "French"], "runtime": "242 min", "summary": ["Arch-criminal Dr. Mabuse sets out to make a fortune and run Berlin. Detective Wenk sets out to stop him.", "Dr. Mabuse and his organization of criminals are in the process of completing their latest scheme, a theft of information that will allow Mabuse to make huge profits on the stock exchange. Afterwards, Mabuse disguises himself and attends the Folies Bergères show, where Cara Carozza, the main attraction of the show, passes him information on Mabuse's next intended victim, the young millionaire Edgar Hull. Mabuse then uses psychic manipulation to lure Hull into a card game where he loses heavily. When Police Commissioner von Wenk begins an investigation of this mysterious crime spree, he has little to go on, and he needs to find someone who can help him.\n\n—Snow Leopard"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 1}}
{"title": "La casa eléctrica", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Buster Keaton", "Edward F. Cline", "Jeffrey Vance"], "actors": ["Buster Keaton", "Virginia Fox", "Joe Keaton", "Louise Keaton", "Myra Keaton", "Laura La Varnie", "Steve Murphy", "Joe Roberts"], "genres": ["Short", "Comedy"], "country": "United States", "lenguages": ["None", "English"], "runtime": "23 min", "summary": ["After being mistakenly certified as an electrical engineer, Buster is hired to wire a house.", "Botany major Buster mistakenly graduates in electrical engineering and is hired to wire a new home. He installs lots of fanciful gadgets. The one who should have received the degree gets even by rewiring all the gadgets to wreak havoc.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "By a twist of fate, Buster, the fresh Botany graduate, is hired by the college's dean to \"electrify\" his beautiful mansion, after being mistaken for a professional electrical engineer. To prove his worth--as both the employer and his young daughter leave for a short vacation--Buster equips the entire house with state-of-the-art gadgetry and high-powered electronic contraptions meant to make one's life easier. However, there's one man who is green with envy, bent on getting even. Is there an escape from the electric mayhem?\n\n—Nick Riganas"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 2}}
{"title": "Esposas frívolas", "year": 1922, "director": ["Erich von Stroheim"], "writers": ["Erich von Stroheim", "Marian Ainslee", "Walter Anthony", "Erich von Stroheim"], "actors": ["Rudolph Christians", "Miss DuPont", "Maude George", "Mae Busch", "Erich von Stroheim", "Dale Fuller", "Albert Edmondson", "Cesare Gravina", "Malvina Polo", "C.J. Allen", "Nigel De Brulier", "Robert Edeson", "Agnes Emerson", "Louise Emmons", "Harrison Ford", "Valerie Germonprez", "Mrs. Kent", "Mme. Kopetzky", "William H. O'Brien", "Mary Philbin", "Edward Reinach", "Louis K. Webb"], "genres": ["Drama", "Thriller"], "country": "United States", "lenguages": ["English", "Latin", "French"], "runtime": "117 min", "summary": ["A con artist masquerades as Russian nobility and attempts to seduce the wife of an American diplomat.", "\"Count\" Karanzim, a Don Juan, is with his cousins in Monte Carlo, living from faked money and the money he gets from rich ladies who are attracted by his charms and his title or his militaristic and aristocratic behavior. He tries to have success with Mrs Hughes, the wife of the new US ambassador.\n\n—Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>", "A Russian emigre' leases a villa near Monte Carlo after WWI, and poses as a count in order to take advantage of women with the aid of two of his mistresses pretending to be his cousins, attempts to swindle unsuspecting women and citizens in Monte Carlo. They hatch a scheme to ingratiate themselves with the American ambassador and his gullible wife. Mrs. Hughes wants some excitement, and he seduces her. While the Count relates his sob story about needing 90,000 francs to Mrs. Hughes, the maid in jealousy sets the house on fire. Both escape the flames, but the Count does not escape his just desserts.\n\n—Fiona Kelleghan <fkelleghan@aol.com>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 3}}
{"title": "El Polo Norte", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Edward F. Cline", "Buster Keaton"], "actors": ["Buster Keaton", "Edward F. Cline", "Bonnie Hill", "Joe Roberts", "Sybil Seely", "Freeman Wood"], "genres": ["Short", "Comedy", "Western"], "country": "United States", "lenguages": ["None", "English"], "runtime": "17 min", "sinopsis": "\nThe film opens near the \"last stop on the subway\", a train terminal in Alaska, which appears to be emerging from deep snow in the middle of nowhere. A tough-looking cowboy (Buster Keaton) emerges. He arrives at a small settlement, finding people gambling in a saloon. He tries to rob them by scaring them with the cutout of a poster of a man holding a gun, which he places at the window, as if it is he is an accomplice. He tells the gamblers to raise their hands in the air. Frightened, they hand over their cash, but soon they find out the truth when a drunk man falls over the cutout. Keaton is thrown out through the window. Keaton offers flowers to his pretty neighbor (Bonnie Hill).Next, he mistakenly enters a house thinking that its his own house. Inside, he sees a man and a woman kissing. Thinking the woman is his wife, he gets red-hot angry and shoots the couple, later to realize his mistake. He goes to his own house, where he finds his wife (Sybil Seely), who greets him, but he treats her coldly. She tries to pick a vase from a shelf, but it drops and knocks her out. Investigating the shooting of the couple, a passing policeman then knocks at Keaton's door after hearing his wife scream. Keaton saves himself from arrest by playing music on gramophone and pretending to dance with his unconscious wife. As soon as the officer leaves, he drops her on the floor.He looks out of the window and sees his pretty neighbor (Bonnie Hill). He quickly dons an elegant white suit and picks flowers (mysteriously growing from the deep snow-a sign remarks \"Keep Off the Grass\"). He attempts to woo her, but she rejects him. Her husband comes back home and Keaton's character has to flee once more.The neighbors leave on a sled for a new, even more bleak northerly location. Keaton gets a \"car\" (a dog sled with an engine) driven by a friend (Joe Roberts) to follow them, but it breaks down, so he has to hail a passing \"taxi\" (a horse drawn sled with upholstery). The taxi is stopped by a traffic warden riding a motorized sled with a propeller for speeding on the snow, but they get away. Keaton is up to his old tricks-he \"reverses\" the propeller so the officer goes backward into a lake. Near the north pole, he and Roberts find a hotel-like igloo with wall-hangings of a stag's head and a guitar. In a gag Keaton tries to hang his hat on a stag head antler but it keeps falling off. They attempt to survive by fishing in the manner of the Eskimos. Keaton makes snow-shoes from guitars and attempts to catch fish using tinned sardines as bait, but just creates trouble he first falls through the ice and then tries to fish but the only things he \"catches\" are another fisherman's baited fish and the other fisherman himself!Forced to flee back to the igloo, where his companion is hoovering the ice floor, Keaton sees his pretty neighbor again in her new hut. Fortified by drinking a bottle of cola, he decides he will force himself on her in the manner of Erich von Stroheim's character from the film Foolish Wives. He appears in Stroheim-like clothing at her hut, but is chased by her husband. Pretending to be a snowman, he eludes him and returns to the hut. Roberts tries to fight the husband but ends up falling into a lake. The husband returns to find his wife weeping on the floor as Keaton stands over her. He wrestles with Keaton. Keaton's wife appears and shoots her husband. The wounded Keaton takes a pistol and tries to shoot the husband, but at that moment a janitor wakes Keaton up in the front row of a film theater (the gun in the last scene turns out to be a folded newspaper in his hand) and Keaton realizes that it was all a dream!\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 4}}
{"title": "El mimado de la abuelita", "year": 1922, "director": ["Fred C. Newmeyer"], "writers": ["Hal Roach", "Sam Taylor", "Jean C. Havez", "H.M. Walker", "Thomas J. Crizer", "Harold Lloyd"], "actors": ["Harold Lloyd", "Mildred Davis", "Anna Townsend", "Charles Stevenson", "Dick Sutherland", "Noah Young", "Jack Morgan", "Roy Brooks", "Sammy Brooks", "Jack Edwards", "William Gillespie", "John Hatton", "Wally Howe", "Mark Jones", "James T. Kelley", "Gus Leonard", "Gaylord Lloyd", "George Rowe", "May Wallace", "George Ward"], "genres": ["Comedy", "Family"], "country": "United States", "lenguages": ["None", "English"], "runtime": "60 min", "summary": ["A meek young man must find the courage within when a rogue tramp menaces his home town.", "Always the mama's boy, or in this case a grandma's boy, Sonny joins a posse after a tramp accused of robbery and murder. He is unable to conquer his cowardice until Grandma tells him of his grandfather, also a coward, who overcame his fears with the help of a magic amulet. With new courage (and the charm), Sonny captures the fugitive and becomes the hero of the day.\n\n—Herman Seifer <alagain@aol.com>", "Bespectacled Harold, who was basically born with his trademark horn rimmed glasses on his face, is a meek, cowardly man who has never thrown a punch in retaliation in his life, despite having ample cause to do so. He lives with his Granny, who looks after him more than he is her protector. He is in love with Mildred, whose affections he has to battle for with a bully, who will do anything to show up Harold in front of Mildred. Some actions by Granny to help Harold unwittingly don't help his cause. When the Sheriff deputizes a bunch of young men in an effort to apprehend a gun-toting murderous tramp on the loose, Harold, based on a story by Granny about how his Grandpa became a hero and due to a special idol she gives him, may truly become the man he wants to get Mildred's hand once and for all.\n\n—Huggo", "Harold plays a backward, awkward, shy boy who is afraid of everything, including his own shadow. After a bully runs him off from the girl that he loves, his Grandma tells him about a magic charm his Grandfather used to gain courage. After Harold begins carrying the charm, he singlehandedly captures a killer and teaches the bully a lesson.\n\n—<malderson@oregontrail.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 5}}
{"title": "Häxan. La brujería a través de los tiempos", "year": 1922, "director": ["Benjamin Christensen"], "writers": ["Benjamin Christensen"], "actors": ["Maren Pedersen", "Clara Pontoppidan", "Elith Pio", "Oscar Stribolt", "Tora Teje", "John Andersen", "Benjamin Christensen", "Poul Reumert", "Karen Winther", "Kate Fabian", "Else Vermehren", "Astrid Holm", "Johannes Andersen", "Gerda Madsen", "Aage Hertel", "Ib Schønberg", "Emmy Schønfeld", "Frederik Christensen", "Ella La Cour", "Elisabeth Christensen", "Henry Seemann", "Alice O'Fredericks", "Knud Rassow", "William S. Burroughs", "Ellen Rassow", "Holst Jørgensen", "H.C. Nielsen", "Albrecht Schmidt", "Karina Bell", "Karen Caspersen", "Holger Pedersen"], "genres": ["Documentary", "Fantasy", "Horror"], "country": "Sweden", "lenguages": ["Swedish", "Danish"], "runtime": "91 min", "summary": ["Fictionalized documentary showing the evolution of witchcraft, from its pagan roots to its confusion with hysteria in Eastern Europe.", "Part history lesson followed by re-enactments with actors, this film depicts the history of witchcraft from its earliest days through to the present day (in this case,1922 or thereabouts). The result is a documentary-like film that must be among the first to use re-enactments as a visual and narrative tool. From pagan worship to satanic rites to hysteria, the film takes you on a journey through the ages with highly effective visual sequences.\n\n—garykmcd", "Divided into seven chapters, this part-documentary/part-fiction hybrid attempts to shed light on the numerous superstitions pivoting around the indecipherable mental illnesses that led to the relentless witch purges during the medieval times. Through a series of graphic vignettes and original gravures, Witchcraft Through the Ages does not shy away from the Inquisition's revolting inhumanities and its hideous practices of interrogation, as the sadistically ruthless inquisitors shatter human limbs and torture the flesh until the accused hag confesses or implicates another woman in witchery. From the Dark Ages to the modern 1920s, hysteria is often mistaken for demonolatry; however, what separates truth from a lie?\n\n—Nick Riganas", "A historical view of witchcraft in seven parts and a variety of styles. First, there is a slide-show alternating inter-titles with drawings and paintings to illustrate the behavior of pagan cultures in the Middle Ages regarding their vision of demons and witches. Then there is a dramatization of the situation of the witches in the Middle Ages, witchcraft and witch-hunts. Finally the film compares the behavior of hysteria of contemporary (1921) women with the behavior of the witches in the Middle Ages, concluding that they are very similar.\n\n—Claudio Carvalho, Rio de Janeiro, Brazil"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 6}}
{"title": "The Man from Beyond", "year": 1922, "director": ["Burton L. King"], "writers": ["Harry Houdini", "Coolidge Streeter"], "actors": ["Harry Houdini", "Arthur Maude", "Albert Tavernier", "Erwin Connelly", "Frank Montgomery", "Luis Alberni", "Yale Benner", "Jane Connelly", "Nita Naldi"], "genres": ["Mystery", "Sci-Fi"], "country": "United States", "lenguages": ["English"], "runtime": "74 min", "summary": ["A man who has been frozen in the Arctic ice for 100 years returns to civilization to find his lost love.", "The body of a man, Howard Hillary, frozen for a hundred years, is found in the Arctic ice. Thawed out and awakened, Hillary insists that a young woman, Felice, is his fiancée from a century before. Hillary is interned in a mental institution but escapes and realizes the truth of where he is and that Felice is actually the descendant of his own Felice from long ago. Hillary joins her in searching for her father, who has been abducted by someone known to them both.\n\n—Jim Beaver <jumblejim@prodigy.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 7}}
{"title": "El homicida", "year": 1922, "director": ["Cecil B. DeMille"], "writers": ["Jeanie Macpherson", "Alice Duer Miller"], "actors": ["Leatrice Joy", "Thomas Meighan", "Lois Wilson", "John Miltern", "George Fawcett", "Julia Faye", "Edythe Chapman", "Jack Mower", "Dorothy Cumming", "Casson Ferguson", "Michael D. Moore", "James Neill", "Sylvia Ashton", "Raymond Hatton", "Mabel Van Buren", "Ethel Wales", "Dale Fuller", "Edward Martindel", "Charles Ogle", "Guy Oliver", "Shannon Day", "Lucien Littlefield", "Spottiswoode Aitken", "Robert Bolder", "William Boyd", "Sidney Bracey", "Clarence Burton", "Allan Cavan", "Nora Cecil", "Michael Dark", "Teddy the Dog", "Louise Emmons", "Pauline Garon", "Mildred June", "Fred Kelsey", "Emmett King", "J. Farrell MacDonald", "Mildred Reardon", "Robert St. Angelo", "Madame Sul-Te-Wan", "Theodore von Eltz", "Charles West"], "genres": ["Drama"], "country": "United States", "lenguages": ["None"], "runtime": "100 min", "summary": ["Thrill-seeking society girl Lydia causes a motorcycle policeman's death and is prosecuted by her fiancé Daniel, who describes in lurid detail the downfall of Rome. While she's in prison, she reforms and Daniel becomes a wasted alcoholic.", "Lydia Thorne, a wealthy girl who loves speed and thrills, is unsympathetic when her maid Evans is jailed for stealing her jewels. District Attorney Daniel O'Bannon visits Lydia to make her see the error of her own ways, but instead views a scene of Lydia and her friends that reminds him of a Roman orgy. O'Bannon feels that he must send Lydia to jail for her own good when her automobile-driving causes a motorcycle policeman's death. Lydia is resentful, and her rebuff of O'Bannon, who has come to love her, causes him such remorse that he turns to drink and dissipation. Meanwhile, Lydia reforms, realizes she loves O'Bannon, and resolves to do charitable work. She and Evans open a soup kitchen after their release, and a chance meeting with O'Bannon starts him on the road to recovery. With Lydia's encouragement he becomes himself again, runs for governor, but withdraws his candidacy to marry Lydia when he sees that her record would be a liability to him in politics.\n\n—Pamela Short"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 8}}
{"title": "Los amores de un príncipe o El carrusel de la vida", "year": 1923, "director": ["Rupert Julian", "Erich von Stroheim"], "writers": ["Finis Fox", "Harvey Gates", "Mary O'Hara", "Erich von Stroheim"], "actors": ["Norman Kerry", "Mary Philbin", "Cesare Gravina", "Edith Yorke", "George Hackathorne", "George Siegmann", "Dale Fuller", "Lillian Sylvester", "Spottiswoode Aitken", "Dorothy Wallace", "Albert Edmondson", "Albert Conti", "Charles King", "Fenwick Oliver", "Sidney Bracey", "Anton Vaverka", "Maude George", "Helen Broneau", "Jane Sherman", "Eugene H. Roth", "Sadie Campbell", "Tommy Hicks", "Donald Hughes", "Ella McKenzie", "Ida Mae McKenzie", "Jack Murphy", "Rolfe Sedan"], "genres": ["Drama"], "country": "United States", "lenguages": ["None", "English"], "runtime": "110 min", "summary": ["A nobleman posing as a necktie salesman falls in love with the daughter of a circus puppeteer although he is already married to the daughter of his country's war minister.", "Life's merry-go-round goes full tilt for Agnes, a virtuous carny at Vienna's Prater just before the Great War. Her father is abused by their cruel boss Huber, who might force himself on Agnes. A Count who's engaged to the daughter of the Minister of Defense chats up Agnes one night while he's slumming; she thinks he's Franz, a necktie salesman, and falls in love with him. Is he using charm and guile to seduce her? Plus there's Bartholomew, a hunchback who's a barker at the Prater; his love for Agnes is unrequited. Are the fates blind or is there reward for virtue?\n\n—<jhailey@hotmail.com>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 9}}
{"title": "Las relaciones con mi mujer", "year": 1922, "director": ["Edward F. Cline", "Buster Keaton"], "writers": ["Buster Keaton", "Edward F. Cline"], "actors": ["Buster Keaton", "Wallace Beery", "Monte Collins", "Wheezer Dell", "Harry Madison", "Kate Price", "Joe Roberts", "Tom Wilson"], "genres": ["Short", "Comedy"], "country": "United States", "lenguages": ["None", "English"], "runtime": "24 min", "summary": ["By accident, Buster and an intimidating woman end up married.", "When a large Irish woman falsely accuses Buster of breaking a window he is hauled before a Polish judge who speaks no English and assumes they are there to be married. She takes her new husband home to meet her four gorilla-like brothers.\n\n—Ed Stephan <stephan@cc.wwu.edu>", "By a broken window and an unfortunate but fateful judicial error, poor Buster ends up married to a bullying and utterly intimidating old harridan. But, that's not all. As the unloving newly-wed couple heads to the bride's house, another surprise awaits the reluctant groom, as he has to live under the same roof with a mean father, and four hulking brothers. Under those circumstances, is the wedding night something to look forward to? Will Buster make it in this family, especially now that great news is just around the corner?\n\n—Nick Riganas", "A large woman brings Buster to court, wrongly accusing him of smashing a window. But the judge is an immigrant who only understands Polish. He mistakes Buster and the woman for another couple and marries them to one another. The large woman brings her new husband to her home, where Buster is confronted with her brutal brothers. The next morning one of them finds a letter, which has slipped out of Buster's clothes. The man doesn't see that the letter isn't addressed to Buster, who just got it by mistake. The letter says that the addressee has inherited §100.000. Believing that Buster has become rich his new brothers-in-law start to treat him kindly. They purchase a luxury house for him by installments. When they find out that the letter actually isn't addressed to Buster, their attitude changes once more. They now want to kill him. After a furious chase Buster slips into a train just leaving for Reno.\n\n—Maths Jesperson {maths.jesperson1@comhem.se}"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 10}}
{"title": "Nanuk, el esquimal", "year": 1922, "director": ["Robert J. Flaherty"], "writers": ["Frances H. Flaherty", "Robert J. Flaherty"], "actors": ["Allakariallak", "Alice Nevalinga", "Cunayou", "Allegoo", "Camock", "Berry Kroeger"], "genres": ["Documentary"], "country": "France", "lenguages": ["English"], "runtime": "78 min", "summary": ["In this silent predecessor to the modern documentary, film-maker Robert J. Flaherty spends one year following the lives of Nanook and his family, Inuits living in the Arctic Circle.", "Documents one year in the life of Nanook, an Eskimo (Inuit), and his family. Describes the trading, hunting, fishing and migrations of a group barely touched by industrial technology. Nanook of the North was widely shown and praised as the first full-length, anthropological documentary in cinematographic history.\n\n—<xaviermartin@hotmail.com>", "Nanook, an Eskimo (what is now known as an Inuit), his family, and his followers of \"Itivimuits\" are among the approximately three hundred nomadic people who live in an area roughly the size of England on the eastern shores of Hudson's Bay in a region called Ungava of Canada's north. Their travel is largely through kayak and other water vessels in the summer and dog sled during the winter. They have some contact with white people of \"western\" civilization, with whom they barter for goods at set trading posts. However, their life is primarily one of subsistence, with Nanook and the men hunting for food to keep them alive, which is not always easy. Their food sources are primarily sea related - salmon, seal and walrus - meaning that they spend most of their time along the Hudson's Bay shore, although animals such as white foxes, polar bears and deer are also prized for food and/or hide and fur. Ice buildup during the winter makes it that much more difficult to access the water, and the food underneath the water. But the harsh winter also provide certain opportunities, such as the plentiful raw material of ice and snow to construct temporary shelters, namely igloos, to protect them from the elements, and easier ways to spot water-dwelling seals.\n\n—Huggo", "This early full-length documentary looks at the life of Nanook, the Bear, an Inuit living on the shores of Hudson's Bay in Northern Quebec. He lives there with his wives, his many children and their dogs. Nanook is known as a superb fisherman and hunter and the search for food is a constant struggle. In the springtime, Nanook and his family travel by kayak to the trading post where he trades the many furs he has collected over the winter. The film shows Nanook and others hunting and fishing and working together during a walrus hunt. In the winter, Nanook manages to build an igloo in less than an hour. The climate is harsh however and the Inuit are forever battling the elements.\n\n—garykmcd"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 11}}
{"title": "Nosferatu", "year": 1922, "director": ["F.W. Murnau"], "writers": ["Henrik Galeen", "Bram Stoker"], "actors": ["Max Schreck", "Gustav von Wangenheim", "Greta Schröder", "Georg H. Schnell", "Ruth Landshoff", "Gustav Botz", "Alexander Granach", "John Gottowt", "Max Nemetz", "Wolfgang Heinz", "Albert Venohr", "Eric van Viele", "Karl Etlinger", "Guido Herzfeld", "Hans Lanser-Rudolf", "Loni Nest", "Josef Sareny", "Fanny Schreck", "Hardy von Francois", "Heinrich Witte"], "genres": ["Fantasy", "Horror"], "country": "Germany", "lenguages": ["German", "English"], "runtime": "94 min", "sinopsis": "\nThe story is narrated from the diary of Johann Cavallius, historian of the city of Bremen, who is wondering if it was the Nosferatu who brought the plague to Bremen in 1838.Newlyweds Hutter [Gustav von Wangenheim] and Ellen [Greta Schroeder] are saddened when Hutter is sent to Transylvania by Hutter's employer Knock [Alexander Grannach] to arrange for Count Orlok's [Max Schreck] purchase of a house across the street from the Hutters' house in Bremen. Hutter travels to Transylvania where he stays with the Count, is bitten by the Count, and eventually escapes from the castle but not before seeing the Count depart on a cart loaded with coffins. While Hutter recuperates in a hospital after succeeding in his escape, the Count moves into the house across from the Hutters'. The rise in deaths is accredited to a plague thought to have arrived with the Demeter. The \"Book of the Vampires\" tells Ellen what she must do to end the vampire.The Count meets his doom when Ellen manages to keep him until after cock crow. Best scene is the vampire rising from Ellen's neck after realizing the cock has crowed. As the sun slowly advances on the houses across the street (visible from the window), the Nosferatu attempts to escape. In doing so, he passes the window and is trapped by the sunlight. He 'vaporizes' into a puff of fire on the carpet. [Original synopsis by bj_kuehl]1922 Version\nThe film presents itself as a chronicle of the Great Death of Wisborg. It begins with a man named Hutter (Gustav von Wangenheim) picking flowers for his wife Ellen (Greta Schroeder) She remarks why have you killed them the beautiful flowers? Hutter hugs his wife, laughing at her reaction. He soon leaves for work, when a passerby tells him Do not hurry, my young friend! Nobody can escape destiny. An inter-title card reveals that Hutters employer is man named Knock (Alexander Granach). He has many rumors surrounding him, the only thing known for certain is that he pays well. Knock is reading in his office a letter covered in strange writing. He calls Hutter into his office and informs him that Count Orlok (Max Schreck) of Transylvania is looking to purchase a house in their small town. He tells Hutter he could make a lot of money though it might require a bit of effort perhaps a bit of blood. Hutter examines a map of Europe while he considers the proposition and Knock takes another look at the letter from the Count. After a moment a thought occurs to Knock, he suggests Hutter sell Orlok the nice deserted house opposite Hutters own home. Knock tells him to travel quickly to the country of ghosts. Both men laugh as the scene fades to black.Hutter rushes home to inform his wife of the exciting news. Ellen is disappointed her husband is leaving, but he is anxious to begin his journey. He packs a few belongings, leaving his wife with friends of the family, a rich shipowner named Harding (Georg H. Schnell) and his sister (Ruth Landshoff). Hutter kisses his wife to reassure her, then leaves for Transylvania. A title card tells us that Hutter travels many dusty roads to the Karpathen mountains. He arrives at a tavern, still excited by his trip. He yells out for dinner before he continues on to Count Orloks castle. Upon hearing this, the crowd in the tavern react with shock and fear. They tell him he cant continue due to the werewolf stalking the forests at night. A wolf like creature scares many horses into bolting into the wilderness, so Hutter stays the night at the inn. After being led to his room, Hutter closes the window and gets ready for bed when he notices a book on his nightstand. It is titled Of Vampires, Terrible Ghosts, Magic, and The Seven Deadly Sins. He reads a section on Nosferatu, terrible creatures that live in caves filled with soil from the fields of Black Death. Thinking nothing of it, Hutter goes to sleep. The next morning Hutter wakes as shepherds are returning horses to their corrals. He again notices the book, but still thinks nothing of it and soon continues his journey.After traveling all day by carriage Hutter is yelling to the driver to hurry before the sun sets. The driver pulls over, telling Hutter he refuses to go any further, no matter Hutter offers to pay him. Undisturbed by the drivers cowardice, Hutter takes his gear and continues on foot. He crosses a small wooden bridge and comes to a deserted road. A moment later a carriage arrives with a sinister looking driver. The driver says nothing, but motions for Hutter to get in. After a cautious moment, Hutter gets in, and the carriage goes back the way it came. They soon arrive at a ruined castle, and the driver motions for Hutter to go inside. Hutter walks toward the castle when the door appears to open by itself. With a bit of apprehension, Hutter enters the castle. He is met by the same sinister figure, now revealed to be Count Orlok. Orlok informs him that he has waited too long, and all the servants have already gone to bed, so he leads Hutter inside himself.A moment later the two men are sitting at a table. Hutter is eating as Orlok studies papers concerning his new real estate. Hutter is watching Orlok so intently that he accidentally cuts his thumb while slicing bread, drawing blood. Orlok reacts immediately, saying the precious blood. Hutter begins to back away in fear, when Orlok proposes the two spend some time together talking, as it is several hours until dawn and Orlok must sleep during the day. Hutter awakens the next morning to find the castle empty but a meal waiting for him. He takes a mirror out of his pocket and examines his neck where he can see two small marks. After breakfast he examines the castle grounds, stopping to write a letter to his wife Ellen. He tells her not to be mad that her love is away, and attributes the marks on his neck to mosquitoes. He flags down a passerby to deliver his letter.That night Hutter is again sitting with Count Orlok. The Count is going over paperwork when he notices portrait of Hutters wife, which instantly catches his attention. He holds the picture remarking she has such a beautiful neck. He then informs Hutter that he will buy the beautiful deserted house opposite his own. Later Hutter is in his room where he is reading more from his book. He reads an article concerning how the Nosferatu hunt and a warning not let their shadow burden your sleep. His bedroom door opens by itself to reveal Orlok who menacingly enters the room. As he does so Ellen begins sleepwalking back in their hometown. She wanders out onto her balcony where she almost falls off. When Orlok finally leaves Hutter, the door again moving on its own behind him, Ellen falls back to sleep.The next morning Hutter decides to investigate the horrors of the castle. He finds a coffin in the basement, and further investigation reveals Orlok sleeping inside. Hutter leaves the basement in a state of horror. That night he looks out his window to see Orlok loading a wagon with several coffins. After stacking the coffins he climbs into the last one, lid lifting onto the coffin by itself before the carriage drives itself away. Hutter, worried about his wife, ties several sheets together in an effort to escape out his window. He falls from his makeshift rope before reaching the bottom, and is knocked unconscious. Orlok continues his journey down the river via raft, the raftsmen unaware of their cargo. Hutter is found by a farmer and is brought to a hospital, where he is slowly recovering. Orlok's coffins arrive at a seaport where they are being loaded onto a ship. The sailors are curious as the contents of the boxes, so the tip over to find nothing but soil and rats.Professor Bulwer (John Gottowt) is presenting a lecture to his class about unusual predators in nature. He shows his class meat-eating plants, remarking how similar they are to vampires. Back in Wisborg, Knock has been admitted to an insane asylum. He attacks his doctor, yelling blood is life! After being subdued, Knock becomes fascinated by the spiders in his cell.Ellen passes the time waiting for her husband sitting on the beach. One day, Harding and his sister bring her the letter Hutter wrote while at the castle. Ellen still longs for her husband, who has recovered enough that he decides to head home. He is still visibly weak, but he cant wait any longer. As he leaves for home Orlok is traveling towards Wisborg via ship. Back in the asylum, Knock steals a newspaper from one of the guards where he reads an article about plague victims in the ports along the Black Sea. All the plague victims have strange marks on their neck, and Knock realizes his master is coming. On the ship sailors are falling ill. The first mate and the captain come to check on their sickened crew, where the ghostly image of Orlok is watching him. Soon only the first mate and captain remain alive. As they heave another body overboard, the first mate decides to finish things once and for all, and takes a hatchet into the cargo hold. He begins to break up the boxes of soil, but as he does the lid lifts off a coffin and Orlok arises. Stricken with fear, the first mate drops his hatchet, runs to the top deck and throws himself overboard. The captain lashes himself to the wheel, but he is soon attacked and killed by Orlok. A title card exclaims the death ship has a new captain.Hutter travels night and day to get home as quickly as possible. In Wisborg, Ellen is again sleepwalking, now speaking in her sleep, seemingly in anticipation of Orloks arrival. She says, I have to go to him he is coming! Knock also seems to sense the arrival of the ship, becoming anxious as Orlok gets closer. The ship docks itself and the door to the cargo hold opens. Orlok immerges, carrying one of his coffins. As Orlok makes his way through town with his coffin, Hutter arrives home where he and his wife greet each other enthusiastically.Back at the dock Harding is investigating the ship, finding the dead captain and a log of the journey. He reads about how illness gradually killed the eight crewman. The captain wrote of a rat infestation and the possibility of a plague threat. Upon reading this, Harding tells everyone to return to their homes and keep their windows and doors closed. Later the town crier announces that plague victims must stay within their homes. White crosses mark the doors of plague victims as coffins are being carried out of several houses.Hutter tells his wife not to read the horrible book he has brought back with him, but some force compels her to read. He tries to comfort her, but they both sense the presence of Orlok watching them from his new home. Hardings sister falls ill, and Ellen watches as a funeral procession is lead by her house. This leads her to read from the book, where she reads that the only way to defeat the Nosferatu is if a sinless maiden gives her blood to it willingly, making it forget about the coming dawn until it is too late.Meanwhile, the fear stricken town is searching for a scapegoat to blame for the plague, and they blame the recently escaped Knock. They chase him throughout the city, but he eludes them, mocking the townspeople from rooftops before running into the woods.Ellen is working on needlepoint, writing Ich Liebe Dich, a German phrase meaning I Love You. That night she can sense Orlok watching her from his building. She opens the window, in a sense inviting him to her. She pretends to fall ill, telling Hutter to go get Bulwer, leaving her alone to face Orlok. Hutter rushes off, leaving Ellen alone in bed. She cowers in bed as the shadow of Orlok creeps ever closer to her, soon enveloping her completely. As Orlok sucks her blood he suddenly hears a rooster crow, and realizes that he has mistakenly stayed out until dawn. He rushes to leave, but as he crosses in front of the window he walks into the beams of the rising sun. He is instantly burned, vanishing in a puff of smoke. Knock, who has finally be captured and returned to the asylum, senses that his master is dead. Ellen is found by Hutter the next morning, the two embracing as the horror is finally over.[synopsis by mvrainey 12/15/09]\n"}
{"index": {"_index": "imdb", "_type": "film", "_id": 12}}
{"title": "La pandilla", "year": 1922, "director": ["Robert F. McGowan", "Fred C. Newmeyer"], "writers": ["Hal Roach", "H.M. Walker"], "actors": ["Anna Mae Bilson", "Jackie Condon", "Mickey Daniels", "John Hatton", "Ernest Morrison", "Buck Black", "Peggy Cartwright", "Billy Condon", "Weston Doty", "Winston Doty", "Henry Hill", "George Ward", "Helen Gilmore", "Wally Howe", "Mark Jones", "Fanny Kelly", "Charley Young"], "genres": ["Short", "Comedy", "Family"], "country": "United States", "lenguages": ["None", "English"], "runtime": "20 min", "summary": ["An unethical merchant moves into town and steals customers from the widowed owner of an established store; the gang steps in to help.", "One member of the gang has a widowed mother who keeps the village store. A rival merchant opens a shop across the street and by questionable methods lures the widow's customers away from her. The gang decides to take a hand and try and get the widow's business back.\n\n—Jonathan D. Parshall <jdp1981@netscape.net>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 13}}
{"title": "El beso de la fama", "year": 1922, "director": ["F.W. Murnau"], "writers": ["Gerhart Hauptmann", "Thea von Harbou", "Hans Heinrich von Twardowski"], "actors": ["Alfred Abel", "Frida Richard", "Aud Egede-Nissen", "Hans Heinrich von Twardowski", "Adolf Klein", "Olga Engl", "Lya De Putti", "Ilka Grüning", "Grete Berger", "Anton Edthofer", "Karl Etlinger", "Lil Dagover", "Heinrich Witte", "Wilhelm Diegelmann", "Gerhart Hauptmann", "Ursula Nest"], "genres": ["Drama", "Romance"], "country": "Germany", "lenguages": ["None", "German"], "runtime": "125 min", "summary": ["A shiftless young man becomes obsessed with a mysterious woman and yearns to find her again.", "Lorenz Lubota is a city clerk with no direction in life. One day on his way to work he is run over by a woman driving a chariot and he is immediately infatuated with her. His life begins to spiral out of control as he searches for this girl and tries to win her heart.\n\n—page8701"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 14}}
{"title": "Polikushka", "year": 1922, "director": ["Aleksandr Sanin"], "writers": ["Nikolai Efros", "Fyodor Otsep", "Lev Tolstoy"], "actors": ["Ivan Moskvin", "Vera Pashennaya", "Evgeniya Raevskaya", "Barbara Bulgakov", "Sergei Aidarov", "Dimitri Gundurov", "Sergei Golovin", "Aleksandr Istomin", "Nikolai Znamenskiy", "Varvara Massalitinova", "Nikolai Kostromskoy"], "genres": ["Drama"], "country": "Soviet Union", "lenguages": ["None"], "runtime": "50 min", "summary": ["In 19th century Russia, peasant Polikei is sent by the wealthy landlady to town. Things start to get complicated and even tragic, when he loses the lady's money he was sent for."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 15}}
{"title": "Robin de los bosques", "year": 1922, "director": ["Allan Dwan"], "writers": ["Douglas Fairbanks", "Kenneth Davenport", "Allan Dwan", "Edward Knoblock", "Lotta Woods"], "actors": ["Douglas Fairbanks", "Wallace Beery", "Sam De Grasse", "Enid Bennett", "Paul Dickey", "William Lowery", "Roy Coulson", "Billie Bennett", "Merrill McCormick", "Wilson Benge", "Willard Louis", "Alan Hale", "Bud Geary", "Lloyd Talman", "Frank Austin", "Ted Billings", "Nino Cochise", "Ann Doran", "Louise Emmons", "Robert Florey", "Dale Fuller", "Rita Gilman", "Ruth Hiatt", "Betty Lawson", "Charles Lewis", "Earl Luick", "Virginia Moon", "Charles Ray", "Eugene H. Roth", "David Sharpe", "Charles Stevens"], "genres": ["Adventure", "Family", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "143 min", "summary": ["A nobleman becomes the vigilante Robin Hood who protects the oppressed English people from the tyrannical Prince John.", "Amid big-budget medieval pageantry, King Richard goes on the Crusades leaving his brother Prince John as regent, who promptly emerges as a cruel, grasping, treacherous tyrant. Apprised of England's peril by message from his lady-love Marian, the dashing Earl of Huntingdon endangers his life and honor by returning to oppose John, but finds himself and his friends outlawed, and Marian apparently dead. Enter Robin Hood, acrobatic champion of the oppressed, laboring to set things right through swash buckling feats and cliffhanging perils!\n\n—Rod Crawford <puffinus@u.washington.edu>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 16}}
{"title": "Robin de los bosques", "year": 1922, "director": ["Allan Dwan"], "writers": ["Douglas Fairbanks", "Kenneth Davenport", "Allan Dwan", "Edward Knoblock", "Lotta Woods"], "actors": ["Douglas Fairbanks", "Wallace Beery", "Sam De Grasse", "Enid Bennett", "Paul Dickey", "William Lowery", "Roy Coulson", "Billie Bennett", "Merrill McCormick", "Wilson Benge", "Willard Louis", "Alan Hale", "Bud Geary", "Lloyd Talman", "Frank Austin", "Ted Billings", "Nino Cochise", "Ann Doran", "Louise Emmons", "Robert Florey", "Dale Fuller", "Rita Gilman", "Ruth Hiatt", "Betty Lawson", "Charles Lewis", "Earl Luick", "Virginia Moon", "Charles Ray", "Eugene H. Roth", "David Sharpe", "Charles Stevens"], "genres": ["Adventure", "Family", "Romance"], "country": "United States", "lenguages": ["English"], "runtime": "143 min", "summary": ["A nobleman becomes the vigilante Robin Hood who protects the oppressed English people from the tyrannical Prince John.", "Amid big-budget medieval pageantry, King Richard goes on the Crusades leaving his brother Prince John as regent, who promptly emerges as a cruel, grasping, treacherous tyrant. Apprised of England's peril by message from his lady-love Marian, the dashing Earl of Huntingdon endangers his life and honor by returning to oppose John, but finds himself and his friends outlawed, and Marian apparently dead. Enter Robin Hood, acrobatic champion of the oppressed, laboring to set things right through swash buckling feats and cliffhanging perils!\n\n—Rod Crawford <puffinus@u.washington.edu>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 17}}
{"title": "Salomé", "year": 1922, "director": ["Charles Bryant", "Alla Nazimova"], "writers": ["Oscar Wilde", "Alla Nazimova", "Natacha Rambova"], "actors": ["Alla Nazimova", "Nigel De Brulier", "Mitchell Lewis", "Rose Dione", "Earl Schenck", "Arthur Jasmine", "Frederick Peters", "Louis Dumar"], "genres": ["Biography", "Drama", "History", "Horror"], "country": "United States", "lenguages": ["None"], "runtime": "72 min", "summary": ["Salome, the daughter of Herodias, seduces her step-father/uncle Herod, governor of Judea, with a salacious dance. In return, he promises her the head of the prophet John the Baptist."]}
{"index": {"_index": "imdb", "_type": "film", "_id": 18}}
{"title": "Sombras", "year": 1923, "director": ["Arthur Robison"], "writers": ["Albin Grau", "Arthur Robison", "Rudolf Schneider"], "actors": ["Fritz Kortner", "Ruth Weyher", "Gustav von Wangenheim", "Eugen Rex", "Max Gülstorff", "Ferdinand von Alten", "Fritz Rasp", "Karl Platen", "Lilli Herder", "Alexander Granach", "Heinrich Gotho", "Rudolf Klein-Rogge"], "genres": ["Drama", "Fantasy", "Horror", "Mystery", "Romance"], "country": "Germany", "lenguages": ["None", "German"], "runtime": "90 min", "summary": ["A wealthy man invites the local wealthy bachelors over for a puppet show about men who covet another man's wife. The puppeteer is actually a witch and gives the men nightmares about what could happen if they date the lady of the house.", "During a dinner, given by a wealthy baron and his wive, attended by four of her suitors in a 19th century German manor, a shadow-player rescues the marriage by giving all the guests a vision what might happen tonight if the baron stays jealous and the suitors do not reduce their advances towards his beautiful wife. Or was it a vision?\n\n—Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>"]}
{"index": {"_index": "imdb", "_type": "film", "_id": 19}}
{"title": "Sherlock Holmes", "year": 1922, "director": ["Albert Parker"], "writers": ["Earle Browne", "Arthur Conan Doyle", "Marion Fairfax", "William Gillette"], "actors": ["John Barrymore", "Roland Young", "Carol Dempster", "Gustav von Seyffertitz", "Louis Wolheim", "Percy Knight", "William Powell", "Hedda Hopper", "Peggy Bayfield", "Margaret Kemp", "Anders Randolf", "Robert Schable", "Reginald Denny", "David Torrence", "Robert Fischer", "Lumsden Hare", "Jerry Devine", "John Willard", "Albert Bruning", "Walter Kingsford"], "genres": ["Drama", "Mystery"], "country": "United States", "lenguages": ["None", "English"], "runtime": "85 min", "summary": ["A young Sherlock Holmes seeks to bring down the criminal mastermind Moriarty as he solves a crime involving a blackmailed prince.", "One of Barrymore's most prestigious early roles, this rarely seen film also presents screen debuts of William Powell and Roland Young. When a young prince is accused of a crime that could embroil him in international scandal, debonair super-sleuth Sherlock Holmes comes to his aid, and quickly discovers that behind the incident lurks a criminal mastermind eager to reduce Western civilization to anarchy.\n\n—Anonymous"]}
